// BSD 2-Clause License
//
// Copyright (c) 2024, Styx Emulator Project
//
// Redistribution and use in source and binary forms, with or without
// modification, are permitted provided that the following conditions are met:
//
// 1. Redistributions of source code must retain the above copyright notice, this
//    list of conditions and the following disclaimer.
//
// 2. Redistributions in binary form must reproduce the above copyright notice,
//    this list of conditions and the following disclaimer in the documentation
//    and/or other materials provided with the distribution.
//
// THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
// AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
// IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
// DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
// FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
// DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
// SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
// CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
// OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
// OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
//! Provides base system types and headers for the MK21Fxxx12 Family.
//!

pub const UINT_LEAST32_MAX: u32 = 4294967295;
pub const INT_FAST8_MIN: i32 = -128;
pub const INT_FAST16_MIN: i64 = -9223372036854775808;
pub const INT_FAST32_MIN: i64 = -9223372036854775808;
pub const INT_FAST8_MAX: u32 = 127;
pub const INT_FAST16_MAX: u64 = 9223372036854775807;
pub const INT_FAST32_MAX: u64 = 9223372036854775807;
pub const UINT_FAST8_MAX: u32 = 255;
pub const UINT_FAST16_MAX: i32 = -1;
pub const UINT_FAST32_MAX: i32 = -1;
pub const INTPTR_MIN: i64 = -9223372036854775808;
pub const INTPTR_MAX: u64 = 9223372036854775807;
pub const UINTPTR_MAX: i32 = -1;
pub const PTRDIFF_MIN: i64 = -9223372036854775808;
pub const PTRDIFF_MAX: u64 = 9223372036854775807;
pub const SIG_ATOMIC_MIN: i32 = -2147483648;
pub const SIG_ATOMIC_MAX: u32 = 2147483647;
pub const SIZE_MAX: i32 = -1;
pub const WINT_MIN: u32 = 0;
pub const WINT_MAX: u32 = 4294967295;
pub const __CM_CMSIS_VERSION_MAIN: u32 = 5;
pub const __CM_CMSIS_VERSION_SUB: u32 = 0;
pub const __CM_CMSIS_VERSION: u32 = 327680;
pub const __CM4_CMSIS_VERSION_MAIN: u32 = 5;
pub const __CM4_CMSIS_VERSION_SUB: u32 = 0;
pub const __CM4_CMSIS_VERSION: u32 = 327680;
pub const __CORTEX_M: u32 = 4;
pub const __FPU_USED: u32 = 0;
pub type __u_char = ::std::os::raw::c_uchar;
pub type __u_short = ::std::os::raw::c_ushort;
pub type __u_int = ::std::os::raw::c_uint;
pub type __u_long = ::std::os::raw::c_ulong;
pub type __int8_t = ::std::os::raw::c_schar;
pub type __uint8_t = ::std::os::raw::c_uchar;
pub type __int16_t = ::std::os::raw::c_short;
pub type __uint16_t = ::std::os::raw::c_ushort;
pub type __int32_t = ::std::os::raw::c_int;
pub type __uint32_t = ::std::os::raw::c_uint;
pub type __int64_t = ::std::os::raw::c_long;
pub type __uint64_t = ::std::os::raw::c_ulong;
pub type __int_least8_t = __int8_t;
pub type __uint_least8_t = __uint8_t;
pub type __int_least16_t = __int16_t;
pub type __uint_least16_t = __uint16_t;
pub type __int_least32_t = __int32_t;
pub type __uint_least32_t = __uint32_t;
pub type __int_least64_t = __int64_t;
pub type __uint_least64_t = __uint64_t;
pub type __quad_t = ::std::os::raw::c_long;
pub type __u_quad_t = ::std::os::raw::c_ulong;
pub type __intmax_t = ::std::os::raw::c_long;
pub type __uintmax_t = ::std::os::raw::c_ulong;
pub type __dev_t = ::std::os::raw::c_ulong;
pub type __uid_t = ::std::os::raw::c_uint;
pub type __gid_t = ::std::os::raw::c_uint;
pub type __ino_t = ::std::os::raw::c_ulong;
pub type __ino64_t = ::std::os::raw::c_ulong;
pub type __mode_t = ::std::os::raw::c_uint;
pub type __nlink_t = ::std::os::raw::c_ulong;
pub type __off_t = ::std::os::raw::c_long;
pub type __off64_t = ::std::os::raw::c_long;
pub type __pid_t = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __fsid_t {
    pub __val: [::std::os::raw::c_int; 2usize],
}
#[test]
fn bindgen_test_layout___fsid_t() {
    const UNINIT: ::std::mem::MaybeUninit<__fsid_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<__fsid_t>(),
        8usize,
        concat!("Size of: ", stringify!(__fsid_t))
    );
    assert_eq!(
        ::std::mem::align_of::<__fsid_t>(),
        4usize,
        concat!("Alignment of ", stringify!(__fsid_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__val) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__fsid_t),
            "::",
            stringify!(__val)
        )
    );
}
pub type __clock_t = ::std::os::raw::c_long;
pub type __rlim_t = ::std::os::raw::c_ulong;
pub type __rlim64_t = ::std::os::raw::c_ulong;
pub type __id_t = ::std::os::raw::c_uint;
pub type __time_t = ::std::os::raw::c_long;
pub type __useconds_t = ::std::os::raw::c_uint;
pub type __suseconds_t = ::std::os::raw::c_long;
pub type __daddr_t = ::std::os::raw::c_int;
pub type __key_t = ::std::os::raw::c_int;
pub type __clockid_t = ::std::os::raw::c_int;
pub type __timer_t = *mut ::std::os::raw::c_void;
pub type __blksize_t = ::std::os::raw::c_long;
pub type __blkcnt_t = ::std::os::raw::c_long;
pub type __blkcnt64_t = ::std::os::raw::c_long;
pub type __fsblkcnt_t = ::std::os::raw::c_ulong;
pub type __fsblkcnt64_t = ::std::os::raw::c_ulong;
pub type __fsfilcnt_t = ::std::os::raw::c_ulong;
pub type __fsfilcnt64_t = ::std::os::raw::c_ulong;
pub type __fsword_t = ::std::os::raw::c_long;
pub type __ssize_t = ::std::os::raw::c_long;
pub type __syscall_slong_t = ::std::os::raw::c_long;
pub type __syscall_ulong_t = ::std::os::raw::c_ulong;
pub type __loff_t = __off64_t;
pub type __caddr_t = *mut ::std::os::raw::c_char;
pub type __intptr_t = ::std::os::raw::c_long;
pub type __socklen_t = ::std::os::raw::c_uint;
pub type __sig_atomic_t = ::std::os::raw::c_int;
pub type int_least8_t = __int_least8_t;
pub type int_least16_t = __int_least16_t;
pub type int_least32_t = __int_least32_t;
pub type int_least64_t = __int_least64_t;
pub type uint_least8_t = __uint_least8_t;
pub type uint_least16_t = __uint_least16_t;
pub type uint_least32_t = __uint_least32_t;
pub type uint_least64_t = __uint_least64_t;
pub type int_fast8_t = ::std::os::raw::c_schar;
pub type int_fast16_t = ::std::os::raw::c_long;
pub type int_fast32_t = ::std::os::raw::c_long;
pub type int_fast64_t = ::std::os::raw::c_long;
pub type uint_fast8_t = ::std::os::raw::c_uchar;
pub type uint_fast16_t = ::std::os::raw::c_ulong;
pub type uint_fast32_t = ::std::os::raw::c_ulong;
pub type uint_fast64_t = ::std::os::raw::c_ulong;
pub type intmax_t = __intmax_t;
pub type uintmax_t = __uintmax_t;
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct T_UINT32 {
    pub v: u32,
}
#[test]
fn bindgen_test_layout_T_UINT32() {
    const UNINIT: ::std::mem::MaybeUninit<T_UINT32> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<T_UINT32>(),
        4usize,
        concat!("Size of: ", stringify!(T_UINT32))
    );
    assert_eq!(
        ::std::mem::align_of::<T_UINT32>(),
        1usize,
        concat!("Alignment of ", stringify!(T_UINT32))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).v) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(T_UINT32),
            "::",
            stringify!(v)
        )
    );
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct T_UINT16_WRITE {
    pub v: u16,
}
#[test]
fn bindgen_test_layout_T_UINT16_WRITE() {
    const UNINIT: ::std::mem::MaybeUninit<T_UINT16_WRITE> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<T_UINT16_WRITE>(),
        2usize,
        concat!("Size of: ", stringify!(T_UINT16_WRITE))
    );
    assert_eq!(
        ::std::mem::align_of::<T_UINT16_WRITE>(),
        1usize,
        concat!("Alignment of ", stringify!(T_UINT16_WRITE))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).v) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(T_UINT16_WRITE),
            "::",
            stringify!(v)
        )
    );
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct T_UINT16_READ {
    pub v: u16,
}
#[test]
fn bindgen_test_layout_T_UINT16_READ() {
    const UNINIT: ::std::mem::MaybeUninit<T_UINT16_READ> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<T_UINT16_READ>(),
        2usize,
        concat!("Size of: ", stringify!(T_UINT16_READ))
    );
    assert_eq!(
        ::std::mem::align_of::<T_UINT16_READ>(),
        1usize,
        concat!("Alignment of ", stringify!(T_UINT16_READ))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).v) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(T_UINT16_READ),
            "::",
            stringify!(v)
        )
    );
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct T_UINT32_WRITE {
    pub v: u32,
}
#[test]
fn bindgen_test_layout_T_UINT32_WRITE() {
    const UNINIT: ::std::mem::MaybeUninit<T_UINT32_WRITE> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<T_UINT32_WRITE>(),
        4usize,
        concat!("Size of: ", stringify!(T_UINT32_WRITE))
    );
    assert_eq!(
        ::std::mem::align_of::<T_UINT32_WRITE>(),
        1usize,
        concat!("Alignment of ", stringify!(T_UINT32_WRITE))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).v) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(T_UINT32_WRITE),
            "::",
            stringify!(v)
        )
    );
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct T_UINT32_READ {
    pub v: u32,
}
#[test]
fn bindgen_test_layout_T_UINT32_READ() {
    const UNINIT: ::std::mem::MaybeUninit<T_UINT32_READ> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<T_UINT32_READ>(),
        4usize,
        concat!("Size of: ", stringify!(T_UINT32_READ))
    );
    assert_eq!(
        ::std::mem::align_of::<T_UINT32_READ>(),
        1usize,
        concat!("Alignment of ", stringify!(T_UINT32_READ))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).v) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(T_UINT32_READ),
            "::",
            stringify!(v)
        )
    );
}
#[doc = "\\brief  Union type to access the Application Program Status Register (APSR)."]
#[repr(C)]
#[derive(Copy, Clone)]
pub union APSR_Type {
    #[doc = "< Structure used for bit  access"]
    pub b: APSR_Type__bindgen_ty_1,
    #[doc = "< Type      used for word access"]
    pub w: u32,
}
#[repr(C)]
#[repr(align(4))]
#[derive(Debug, Copy, Clone)]
pub struct APSR_Type__bindgen_ty_1 {
    pub _bitfield_align_1: [u16; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 4usize]>,
}
#[test]
fn bindgen_test_layout_APSR_Type__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<APSR_Type__bindgen_ty_1>(),
        4usize,
        concat!("Size of: ", stringify!(APSR_Type__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<APSR_Type__bindgen_ty_1>(),
        4usize,
        concat!("Alignment of ", stringify!(APSR_Type__bindgen_ty_1))
    );
}
impl APSR_Type__bindgen_ty_1 {
    #[inline]
    pub fn _reserved0(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 16u8) as u32) }
    }
    #[inline]
    pub fn set__reserved0(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 16u8, val as u64)
        }
    }
    #[inline]
    pub fn GE(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(16usize, 4u8) as u32) }
    }
    #[inline]
    pub fn set_GE(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(16usize, 4u8, val as u64)
        }
    }
    #[inline]
    pub fn _reserved1(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(20usize, 7u8) as u32) }
    }
    #[inline]
    pub fn set__reserved1(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(20usize, 7u8, val as u64)
        }
    }
    #[inline]
    pub fn Q(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(27usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_Q(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(27usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn V(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(28usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_V(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(28usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn C(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(29usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_C(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(29usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn Z(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(30usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_Z(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(30usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn N(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(31usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_N(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(31usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        _reserved0: u32,
        GE: u32,
        _reserved1: u32,
        Q: u32,
        V: u32,
        C: u32,
        Z: u32,
        N: u32,
    ) -> __BindgenBitfieldUnit<[u8; 4usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 4usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 16u8, {
            let _reserved0: u32 = unsafe { ::std::mem::transmute(_reserved0) };
            _reserved0 as u64
        });
        __bindgen_bitfield_unit.set(16usize, 4u8, {
            let GE: u32 = unsafe { ::std::mem::transmute(GE) };
            GE as u64
        });
        __bindgen_bitfield_unit.set(20usize, 7u8, {
            let _reserved1: u32 = unsafe { ::std::mem::transmute(_reserved1) };
            _reserved1 as u64
        });
        __bindgen_bitfield_unit.set(27usize, 1u8, {
            let Q: u32 = unsafe { ::std::mem::transmute(Q) };
            Q as u64
        });
        __bindgen_bitfield_unit.set(28usize, 1u8, {
            let V: u32 = unsafe { ::std::mem::transmute(V) };
            V as u64
        });
        __bindgen_bitfield_unit.set(29usize, 1u8, {
            let C: u32 = unsafe { ::std::mem::transmute(C) };
            C as u64
        });
        __bindgen_bitfield_unit.set(30usize, 1u8, {
            let Z: u32 = unsafe { ::std::mem::transmute(Z) };
            Z as u64
        });
        __bindgen_bitfield_unit.set(31usize, 1u8, {
            let N: u32 = unsafe { ::std::mem::transmute(N) };
            N as u64
        });
        __bindgen_bitfield_unit
    }
}
#[test]
fn bindgen_test_layout_APSR_Type() {
    const UNINIT: ::std::mem::MaybeUninit<APSR_Type> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<APSR_Type>(),
        4usize,
        concat!("Size of: ", stringify!(APSR_Type))
    );
    assert_eq!(
        ::std::mem::align_of::<APSR_Type>(),
        4usize,
        concat!("Alignment of ", stringify!(APSR_Type))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).b) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(APSR_Type),
            "::",
            stringify!(b)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).w) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(APSR_Type),
            "::",
            stringify!(w)
        )
    );
}
pub const APSR_N_Pos: u32 = 31;
pub const APSR_N_Msk: u32 = 2147483648;
pub const APSR_Z_Pos: u32 = 30;
pub const APSR_Z_Msk: u32 = 1073741824;
pub const APSR_C_Pos: u32 = 29;
pub const APSR_C_Msk: u32 = 536870912;
pub const APSR_V_Pos: u32 = 28;
pub const APSR_V_Msk: u32 = 268435456;
pub const APSR_Q_Pos: u32 = 27;
pub const APSR_Q_Msk: u32 = 134217728;
pub const APSR_GE_Pos: u32 = 16;
pub const APSR_GE_Msk: u32 = 983040;
#[doc = "\\brief  Union type to access the Interrupt Program Status Register (IPSR)."]
#[repr(C)]
#[derive(Copy, Clone)]
pub union IPSR_Type {
    #[doc = "< Structure used for bit  access"]
    pub b: IPSR_Type__bindgen_ty_1,
    #[doc = "< Type      used for word access"]
    pub w: u32,
}
#[repr(C)]
#[repr(align(4))]
#[derive(Debug, Copy, Clone)]
pub struct IPSR_Type__bindgen_ty_1 {
    pub _bitfield_align_1: [u32; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 4usize]>,
}
#[test]
fn bindgen_test_layout_IPSR_Type__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<IPSR_Type__bindgen_ty_1>(),
        4usize,
        concat!("Size of: ", stringify!(IPSR_Type__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<IPSR_Type__bindgen_ty_1>(),
        4usize,
        concat!("Alignment of ", stringify!(IPSR_Type__bindgen_ty_1))
    );
}
impl IPSR_Type__bindgen_ty_1 {
    #[inline]
    pub fn ISR(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 9u8) as u32) }
    }
    #[inline]
    pub fn set_ISR(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 9u8, val as u64)
        }
    }
    #[inline]
    pub fn _reserved0(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(9usize, 23u8) as u32) }
    }
    #[inline]
    pub fn set__reserved0(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(9usize, 23u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(ISR: u32, _reserved0: u32) -> __BindgenBitfieldUnit<[u8; 4usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 4usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 9u8, {
            let ISR: u32 = unsafe { ::std::mem::transmute(ISR) };
            ISR as u64
        });
        __bindgen_bitfield_unit.set(9usize, 23u8, {
            let _reserved0: u32 = unsafe { ::std::mem::transmute(_reserved0) };
            _reserved0 as u64
        });
        __bindgen_bitfield_unit
    }
}
#[test]
fn bindgen_test_layout_IPSR_Type() {
    const UNINIT: ::std::mem::MaybeUninit<IPSR_Type> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<IPSR_Type>(),
        4usize,
        concat!("Size of: ", stringify!(IPSR_Type))
    );
    assert_eq!(
        ::std::mem::align_of::<IPSR_Type>(),
        4usize,
        concat!("Alignment of ", stringify!(IPSR_Type))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).b) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(IPSR_Type),
            "::",
            stringify!(b)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).w) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(IPSR_Type),
            "::",
            stringify!(w)
        )
    );
}
pub const IPSR_ISR_Pos: u32 = 0;
pub const IPSR_ISR_Msk: u32 = 511;
#[doc = "\\brief  Union type to access the Special-Purpose Program Status Registers (xPSR)."]
#[repr(C)]
#[derive(Copy, Clone)]
pub union xPSR_Type {
    #[doc = "< Structure used for bit  access"]
    pub b: xPSR_Type__bindgen_ty_1,
    #[doc = "< Type      used for word access"]
    pub w: u32,
}
#[repr(C)]
#[repr(align(4))]
#[derive(Debug, Copy, Clone)]
pub struct xPSR_Type__bindgen_ty_1 {
    pub _bitfield_align_1: [u16; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 4usize]>,
}
#[test]
fn bindgen_test_layout_xPSR_Type__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<xPSR_Type__bindgen_ty_1>(),
        4usize,
        concat!("Size of: ", stringify!(xPSR_Type__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<xPSR_Type__bindgen_ty_1>(),
        4usize,
        concat!("Alignment of ", stringify!(xPSR_Type__bindgen_ty_1))
    );
}
impl xPSR_Type__bindgen_ty_1 {
    #[inline]
    pub fn ISR(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 9u8) as u32) }
    }
    #[inline]
    pub fn set_ISR(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 9u8, val as u64)
        }
    }
    #[inline]
    pub fn _reserved0(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(9usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set__reserved0(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(9usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn ICI_IT_1(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(10usize, 6u8) as u32) }
    }
    #[inline]
    pub fn set_ICI_IT_1(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(10usize, 6u8, val as u64)
        }
    }
    #[inline]
    pub fn GE(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(16usize, 4u8) as u32) }
    }
    #[inline]
    pub fn set_GE(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(16usize, 4u8, val as u64)
        }
    }
    #[inline]
    pub fn _reserved1(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(20usize, 4u8) as u32) }
    }
    #[inline]
    pub fn set__reserved1(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(20usize, 4u8, val as u64)
        }
    }
    #[inline]
    pub fn T(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(24usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_T(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(24usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn ICI_IT_2(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(25usize, 2u8) as u32) }
    }
    #[inline]
    pub fn set_ICI_IT_2(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(25usize, 2u8, val as u64)
        }
    }
    #[inline]
    pub fn Q(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(27usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_Q(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(27usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn V(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(28usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_V(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(28usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn C(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(29usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_C(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(29usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn Z(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(30usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_Z(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(30usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn N(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(31usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_N(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(31usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        ISR: u32,
        _reserved0: u32,
        ICI_IT_1: u32,
        GE: u32,
        _reserved1: u32,
        T: u32,
        ICI_IT_2: u32,
        Q: u32,
        V: u32,
        C: u32,
        Z: u32,
        N: u32,
    ) -> __BindgenBitfieldUnit<[u8; 4usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 4usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 9u8, {
            let ISR: u32 = unsafe { ::std::mem::transmute(ISR) };
            ISR as u64
        });
        __bindgen_bitfield_unit.set(9usize, 1u8, {
            let _reserved0: u32 = unsafe { ::std::mem::transmute(_reserved0) };
            _reserved0 as u64
        });
        __bindgen_bitfield_unit.set(10usize, 6u8, {
            let ICI_IT_1: u32 = unsafe { ::std::mem::transmute(ICI_IT_1) };
            ICI_IT_1 as u64
        });
        __bindgen_bitfield_unit.set(16usize, 4u8, {
            let GE: u32 = unsafe { ::std::mem::transmute(GE) };
            GE as u64
        });
        __bindgen_bitfield_unit.set(20usize, 4u8, {
            let _reserved1: u32 = unsafe { ::std::mem::transmute(_reserved1) };
            _reserved1 as u64
        });
        __bindgen_bitfield_unit.set(24usize, 1u8, {
            let T: u32 = unsafe { ::std::mem::transmute(T) };
            T as u64
        });
        __bindgen_bitfield_unit.set(25usize, 2u8, {
            let ICI_IT_2: u32 = unsafe { ::std::mem::transmute(ICI_IT_2) };
            ICI_IT_2 as u64
        });
        __bindgen_bitfield_unit.set(27usize, 1u8, {
            let Q: u32 = unsafe { ::std::mem::transmute(Q) };
            Q as u64
        });
        __bindgen_bitfield_unit.set(28usize, 1u8, {
            let V: u32 = unsafe { ::std::mem::transmute(V) };
            V as u64
        });
        __bindgen_bitfield_unit.set(29usize, 1u8, {
            let C: u32 = unsafe { ::std::mem::transmute(C) };
            C as u64
        });
        __bindgen_bitfield_unit.set(30usize, 1u8, {
            let Z: u32 = unsafe { ::std::mem::transmute(Z) };
            Z as u64
        });
        __bindgen_bitfield_unit.set(31usize, 1u8, {
            let N: u32 = unsafe { ::std::mem::transmute(N) };
            N as u64
        });
        __bindgen_bitfield_unit
    }
}
#[test]
fn bindgen_test_layout_xPSR_Type() {
    const UNINIT: ::std::mem::MaybeUninit<xPSR_Type> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<xPSR_Type>(),
        4usize,
        concat!("Size of: ", stringify!(xPSR_Type))
    );
    assert_eq!(
        ::std::mem::align_of::<xPSR_Type>(),
        4usize,
        concat!("Alignment of ", stringify!(xPSR_Type))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).b) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(xPSR_Type),
            "::",
            stringify!(b)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).w) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(xPSR_Type),
            "::",
            stringify!(w)
        )
    );
}
pub const xPSR_N_Pos: u32 = 31;
pub const xPSR_N_Msk: u32 = 2147483648;
pub const xPSR_Z_Pos: u32 = 30;
pub const xPSR_Z_Msk: u32 = 1073741824;
pub const xPSR_C_Pos: u32 = 29;
pub const xPSR_C_Msk: u32 = 536870912;
pub const xPSR_V_Pos: u32 = 28;
pub const xPSR_V_Msk: u32 = 268435456;
pub const xPSR_Q_Pos: u32 = 27;
pub const xPSR_Q_Msk: u32 = 134217728;
pub const xPSR_ICI_IT_2_Pos: u32 = 25;
pub const xPSR_ICI_IT_2_Msk: u32 = 100663296;
pub const xPSR_T_Pos: u32 = 24;
pub const xPSR_T_Msk: u32 = 16777216;
pub const xPSR_GE_Pos: u32 = 16;
pub const xPSR_GE_Msk: u32 = 983040;
pub const xPSR_ICI_IT_1_Pos: u32 = 10;
pub const xPSR_ICI_IT_1_Msk: u32 = 64512;
pub const xPSR_ISR_Pos: u32 = 0;
pub const xPSR_ISR_Msk: u32 = 511;
#[doc = "\\brief  Union type to access the Control Registers (CONTROL)."]
#[repr(C)]
#[derive(Copy, Clone)]
pub union CONTROL_Type {
    #[doc = "< Structure used for bit  access"]
    pub b: CONTROL_Type__bindgen_ty_1,
    #[doc = "< Type      used for word access"]
    pub w: u32,
}
#[repr(C)]
#[repr(align(4))]
#[derive(Debug, Copy, Clone)]
pub struct CONTROL_Type__bindgen_ty_1 {
    pub _bitfield_align_1: [u32; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 4usize]>,
}
#[test]
fn bindgen_test_layout_CONTROL_Type__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<CONTROL_Type__bindgen_ty_1>(),
        4usize,
        concat!("Size of: ", stringify!(CONTROL_Type__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<CONTROL_Type__bindgen_ty_1>(),
        4usize,
        concat!("Alignment of ", stringify!(CONTROL_Type__bindgen_ty_1))
    );
}
impl CONTROL_Type__bindgen_ty_1 {
    #[inline]
    pub fn nPRIV(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_nPRIV(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn SPSEL(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(1usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_SPSEL(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(1usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn FPCA(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(2usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_FPCA(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(2usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn _reserved0(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(3usize, 29u8) as u32) }
    }
    #[inline]
    pub fn set__reserved0(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(3usize, 29u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        nPRIV: u32,
        SPSEL: u32,
        FPCA: u32,
        _reserved0: u32,
    ) -> __BindgenBitfieldUnit<[u8; 4usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 4usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let nPRIV: u32 = unsafe { ::std::mem::transmute(nPRIV) };
            nPRIV as u64
        });
        __bindgen_bitfield_unit.set(1usize, 1u8, {
            let SPSEL: u32 = unsafe { ::std::mem::transmute(SPSEL) };
            SPSEL as u64
        });
        __bindgen_bitfield_unit.set(2usize, 1u8, {
            let FPCA: u32 = unsafe { ::std::mem::transmute(FPCA) };
            FPCA as u64
        });
        __bindgen_bitfield_unit.set(3usize, 29u8, {
            let _reserved0: u32 = unsafe { ::std::mem::transmute(_reserved0) };
            _reserved0 as u64
        });
        __bindgen_bitfield_unit
    }
}
#[test]
fn bindgen_test_layout_CONTROL_Type() {
    const UNINIT: ::std::mem::MaybeUninit<CONTROL_Type> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<CONTROL_Type>(),
        4usize,
        concat!("Size of: ", stringify!(CONTROL_Type))
    );
    assert_eq!(
        ::std::mem::align_of::<CONTROL_Type>(),
        4usize,
        concat!("Alignment of ", stringify!(CONTROL_Type))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).b) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(CONTROL_Type),
            "::",
            stringify!(b)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).w) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(CONTROL_Type),
            "::",
            stringify!(w)
        )
    );
}
pub const CONTROL_FPCA_Pos: u32 = 2;
pub const CONTROL_FPCA_Msk: u32 = 4;
pub const CONTROL_SPSEL_Pos: u32 = 1;
pub const CONTROL_SPSEL_Msk: u32 = 2;
pub const CONTROL_nPRIV_Pos: u32 = 0;
pub const CONTROL_nPRIV_Msk: u32 = 1;
#[doc = "\\brief  Structure type to access the Nested Vectored Interrupt Controller (NVIC)."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct NVIC_Type {
    #[doc = "< Offset: 0x000 (R/W)  Interrupt Set Enable Register"]
    pub ISER: [u32; 8usize],
    pub RESERVED0: [u32; 24usize],
    #[doc = "< Offset: 0x080 (R/W)  Interrupt Clear Enable Register"]
    pub ICER: [u32; 8usize],
    pub RSERVED1: [u32; 24usize],
    #[doc = "< Offset: 0x100 (R/W)  Interrupt Set Pending Register"]
    pub ISPR: [u32; 8usize],
    pub RESERVED2: [u32; 24usize],
    #[doc = "< Offset: 0x180 (R/W)  Interrupt Clear Pending Register"]
    pub ICPR: [u32; 8usize],
    pub RESERVED3: [u32; 24usize],
    #[doc = "< Offset: 0x200 (R/W)  Interrupt Active bit Register"]
    pub IABR: [u32; 8usize],
    pub RESERVED4: [u32; 56usize],
    #[doc = "< Offset: 0x300 (R/W)  Interrupt Priority Register (8Bit wide)"]
    pub IP: [u8; 240usize],
    pub RESERVED5: [u32; 644usize],
    #[doc = "< Offset: 0xE00 ( /W)  Software Trigger Interrupt Register"]
    pub STIR: u32,
}
#[test]
fn bindgen_test_layout_NVIC_Type() {
    const UNINIT: ::std::mem::MaybeUninit<NVIC_Type> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<NVIC_Type>(),
        3588usize,
        concat!("Size of: ", stringify!(NVIC_Type))
    );
    assert_eq!(
        ::std::mem::align_of::<NVIC_Type>(),
        4usize,
        concat!("Alignment of ", stringify!(NVIC_Type))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ISER) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(NVIC_Type),
            "::",
            stringify!(ISER)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).RESERVED0) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(NVIC_Type),
            "::",
            stringify!(RESERVED0)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ICER) as usize - ptr as usize },
        128usize,
        concat!(
            "Offset of field: ",
            stringify!(NVIC_Type),
            "::",
            stringify!(ICER)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).RSERVED1) as usize - ptr as usize },
        160usize,
        concat!(
            "Offset of field: ",
            stringify!(NVIC_Type),
            "::",
            stringify!(RSERVED1)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ISPR) as usize - ptr as usize },
        256usize,
        concat!(
            "Offset of field: ",
            stringify!(NVIC_Type),
            "::",
            stringify!(ISPR)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).RESERVED2) as usize - ptr as usize },
        288usize,
        concat!(
            "Offset of field: ",
            stringify!(NVIC_Type),
            "::",
            stringify!(RESERVED2)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ICPR) as usize - ptr as usize },
        384usize,
        concat!(
            "Offset of field: ",
            stringify!(NVIC_Type),
            "::",
            stringify!(ICPR)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).RESERVED3) as usize - ptr as usize },
        416usize,
        concat!(
            "Offset of field: ",
            stringify!(NVIC_Type),
            "::",
            stringify!(RESERVED3)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).IABR) as usize - ptr as usize },
        512usize,
        concat!(
            "Offset of field: ",
            stringify!(NVIC_Type),
            "::",
            stringify!(IABR)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).RESERVED4) as usize - ptr as usize },
        544usize,
        concat!(
            "Offset of field: ",
            stringify!(NVIC_Type),
            "::",
            stringify!(RESERVED4)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).IP) as usize - ptr as usize },
        768usize,
        concat!(
            "Offset of field: ",
            stringify!(NVIC_Type),
            "::",
            stringify!(IP)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).RESERVED5) as usize - ptr as usize },
        1008usize,
        concat!(
            "Offset of field: ",
            stringify!(NVIC_Type),
            "::",
            stringify!(RESERVED5)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).STIR) as usize - ptr as usize },
        3584usize,
        concat!(
            "Offset of field: ",
            stringify!(NVIC_Type),
            "::",
            stringify!(STIR)
        )
    );
}
pub const NVIC_STIR_INTID_Pos: u32 = 0;
pub const NVIC_STIR_INTID_Msk: u32 = 511;
#[doc = "\\brief  Structure type to access the System Control Block (SCB)."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCB_Type {
    #[doc = "< Offset: 0x000 (R/ )  CPUID Base Register"]
    pub CPUID: u32,
    #[doc = "< Offset: 0x004 (R/W)  Interrupt Control and State Register"]
    pub ICSR: u32,
    #[doc = "< Offset: 0x008 (R/W)  Vector Table Offset Register"]
    pub VTOR: u32,
    #[doc = "< Offset: 0x00C (R/W)  Application Interrupt and Reset Control Register"]
    pub AIRCR: u32,
    #[doc = "< Offset: 0x010 (R/W)  System Control Register"]
    pub SCR: u32,
    #[doc = "< Offset: 0x014 (R/W)  Configuration Control Register"]
    pub CCR: u32,
    #[doc = "< Offset: 0x018 (R/W)  System Handlers Priority Registers (4-7, 8-11, 12-15)"]
    pub SHP: [u8; 12usize],
    #[doc = "< Offset: 0x024 (R/W)  System Handler Control and State Register"]
    pub SHCSR: u32,
    #[doc = "< Offset: 0x028 (R/W)  Configurable Fault Status Register"]
    pub CFSR: u32,
    #[doc = "< Offset: 0x02C (R/W)  HardFault Status Register"]
    pub HFSR: u32,
    #[doc = "< Offset: 0x030 (R/W)  Debug Fault Status Register"]
    pub DFSR: u32,
    #[doc = "< Offset: 0x034 (R/W)  MemManage Fault Address Register"]
    pub MMFAR: u32,
    #[doc = "< Offset: 0x038 (R/W)  BusFault Address Register"]
    pub BFAR: u32,
    #[doc = "< Offset: 0x03C (R/W)  Auxiliary Fault Status Register"]
    pub AFSR: u32,
    #[doc = "< Offset: 0x040 (R/ )  Processor Feature Register"]
    pub PFR: [u32; 2usize],
    #[doc = "< Offset: 0x048 (R/ )  Debug Feature Register"]
    pub DFR: u32,
    #[doc = "< Offset: 0x04C (R/ )  Auxiliary Feature Register"]
    pub ADR: u32,
    #[doc = "< Offset: 0x050 (R/ )  Memory Model Feature Register"]
    pub MMFR: [u32; 4usize],
    #[doc = "< Offset: 0x060 (R/ )  Instruction Set Attributes Register"]
    pub ISAR: [u32; 5usize],
    pub RESERVED0: [u32; 5usize],
    #[doc = "< Offset: 0x088 (R/W)  Coprocessor Access Control Register"]
    pub CPACR: u32,
}
#[test]
fn bindgen_test_layout_SCB_Type() {
    const UNINIT: ::std::mem::MaybeUninit<SCB_Type> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<SCB_Type>(),
        140usize,
        concat!("Size of: ", stringify!(SCB_Type))
    );
    assert_eq!(
        ::std::mem::align_of::<SCB_Type>(),
        4usize,
        concat!("Alignment of ", stringify!(SCB_Type))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).CPUID) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SCB_Type),
            "::",
            stringify!(CPUID)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ICSR) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(SCB_Type),
            "::",
            stringify!(ICSR)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).VTOR) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(SCB_Type),
            "::",
            stringify!(VTOR)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).AIRCR) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(SCB_Type),
            "::",
            stringify!(AIRCR)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).SCR) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(SCB_Type),
            "::",
            stringify!(SCR)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).CCR) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(SCB_Type),
            "::",
            stringify!(CCR)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).SHP) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(SCB_Type),
            "::",
            stringify!(SHP)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).SHCSR) as usize - ptr as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(SCB_Type),
            "::",
            stringify!(SHCSR)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).CFSR) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(SCB_Type),
            "::",
            stringify!(CFSR)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).HFSR) as usize - ptr as usize },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(SCB_Type),
            "::",
            stringify!(HFSR)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).DFSR) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(SCB_Type),
            "::",
            stringify!(DFSR)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).MMFAR) as usize - ptr as usize },
        52usize,
        concat!(
            "Offset of field: ",
            stringify!(SCB_Type),
            "::",
            stringify!(MMFAR)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).BFAR) as usize - ptr as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(SCB_Type),
            "::",
            stringify!(BFAR)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).AFSR) as usize - ptr as usize },
        60usize,
        concat!(
            "Offset of field: ",
            stringify!(SCB_Type),
            "::",
            stringify!(AFSR)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).PFR) as usize - ptr as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(SCB_Type),
            "::",
            stringify!(PFR)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).DFR) as usize - ptr as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(SCB_Type),
            "::",
            stringify!(DFR)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ADR) as usize - ptr as usize },
        76usize,
        concat!(
            "Offset of field: ",
            stringify!(SCB_Type),
            "::",
            stringify!(ADR)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).MMFR) as usize - ptr as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(SCB_Type),
            "::",
            stringify!(MMFR)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ISAR) as usize - ptr as usize },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(SCB_Type),
            "::",
            stringify!(ISAR)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).RESERVED0) as usize - ptr as usize },
        116usize,
        concat!(
            "Offset of field: ",
            stringify!(SCB_Type),
            "::",
            stringify!(RESERVED0)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).CPACR) as usize - ptr as usize },
        136usize,
        concat!(
            "Offset of field: ",
            stringify!(SCB_Type),
            "::",
            stringify!(CPACR)
        )
    );
}
pub const SCB_CPUID_IMPLEMENTER_Pos: u32 = 24;
pub const SCB_CPUID_IMPLEMENTER_Msk: u32 = 4278190080;
pub const SCB_CPUID_VARIANT_Pos: u32 = 20;
pub const SCB_CPUID_VARIANT_Msk: u32 = 15728640;
pub const SCB_CPUID_ARCHITECTURE_Pos: u32 = 16;
pub const SCB_CPUID_ARCHITECTURE_Msk: u32 = 983040;
pub const SCB_CPUID_PARTNO_Pos: u32 = 4;
pub const SCB_CPUID_PARTNO_Msk: u32 = 65520;
pub const SCB_CPUID_REVISION_Pos: u32 = 0;
pub const SCB_CPUID_REVISION_Msk: u32 = 15;
pub const SCB_ICSR_NMIPENDSET_Pos: u32 = 31;
pub const SCB_ICSR_NMIPENDSET_Msk: u32 = 2147483648;
pub const SCB_ICSR_PENDSVSET_Pos: u32 = 28;
pub const SCB_ICSR_PENDSVSET_Msk: u32 = 268435456;
pub const SCB_ICSR_PENDSVCLR_Pos: u32 = 27;
pub const SCB_ICSR_PENDSVCLR_Msk: u32 = 134217728;
pub const SCB_ICSR_PENDSTSET_Pos: u32 = 26;
pub const SCB_ICSR_PENDSTSET_Msk: u32 = 67108864;
pub const SCB_ICSR_PENDSTCLR_Pos: u32 = 25;
pub const SCB_ICSR_PENDSTCLR_Msk: u32 = 33554432;
pub const SCB_ICSR_ISRPREEMPT_Pos: u32 = 23;
pub const SCB_ICSR_ISRPREEMPT_Msk: u32 = 8388608;
pub const SCB_ICSR_ISRPENDING_Pos: u32 = 22;
pub const SCB_ICSR_ISRPENDING_Msk: u32 = 4194304;
pub const SCB_ICSR_VECTPENDING_Pos: u32 = 12;
pub const SCB_ICSR_VECTPENDING_Msk: u32 = 2093056;
pub const SCB_ICSR_RETTOBASE_Pos: u32 = 11;
pub const SCB_ICSR_RETTOBASE_Msk: u32 = 2048;
pub const SCB_ICSR_VECTACTIVE_Pos: u32 = 0;
pub const SCB_ICSR_VECTACTIVE_Msk: u32 = 511;
pub const SCB_VTOR_TBLOFF_Pos: u32 = 7;
pub const SCB_VTOR_TBLOFF_Msk: u32 = 4294967168;
pub const SCB_AIRCR_VECTKEY_Pos: u32 = 16;
pub const SCB_AIRCR_VECTKEY_Msk: u32 = 4294901760;
pub const SCB_AIRCR_VECTKEYSTAT_Pos: u32 = 16;
pub const SCB_AIRCR_VECTKEYSTAT_Msk: u32 = 4294901760;
pub const SCB_AIRCR_ENDIANESS_Pos: u32 = 15;
pub const SCB_AIRCR_ENDIANESS_Msk: u32 = 32768;
pub const SCB_AIRCR_PRIGROUP_Pos: u32 = 8;
pub const SCB_AIRCR_PRIGROUP_Msk: u32 = 1792;
pub const SCB_AIRCR_SYSRESETREQ_Pos: u32 = 2;
pub const SCB_AIRCR_SYSRESETREQ_Msk: u32 = 4;
pub const SCB_AIRCR_VECTCLRACTIVE_Pos: u32 = 1;
pub const SCB_AIRCR_VECTCLRACTIVE_Msk: u32 = 2;
pub const SCB_AIRCR_VECTRESET_Pos: u32 = 0;
pub const SCB_AIRCR_VECTRESET_Msk: u32 = 1;
pub const SCB_SCR_SEVONPEND_Pos: u32 = 4;
pub const SCB_SCR_SEVONPEND_Msk: u32 = 16;
pub const SCB_SCR_SLEEPDEEP_Pos: u32 = 2;
pub const SCB_SCR_SLEEPDEEP_Msk: u32 = 4;
pub const SCB_SCR_SLEEPONEXIT_Pos: u32 = 1;
pub const SCB_SCR_SLEEPONEXIT_Msk: u32 = 2;
pub const SCB_CCR_STKALIGN_Pos: u32 = 9;
pub const SCB_CCR_STKALIGN_Msk: u32 = 512;
pub const SCB_CCR_BFHFNMIGN_Pos: u32 = 8;
pub const SCB_CCR_BFHFNMIGN_Msk: u32 = 256;
pub const SCB_CCR_DIV_0_TRP_Pos: u32 = 4;
pub const SCB_CCR_DIV_0_TRP_Msk: u32 = 16;
pub const SCB_CCR_UNALIGN_TRP_Pos: u32 = 3;
pub const SCB_CCR_UNALIGN_TRP_Msk: u32 = 8;
pub const SCB_CCR_USERSETMPEND_Pos: u32 = 1;
pub const SCB_CCR_USERSETMPEND_Msk: u32 = 2;
pub const SCB_CCR_NONBASETHRDENA_Pos: u32 = 0;
pub const SCB_CCR_NONBASETHRDENA_Msk: u32 = 1;
pub const SCB_SHCSR_USGFAULTENA_Pos: u32 = 18;
pub const SCB_SHCSR_USGFAULTENA_Msk: u32 = 262144;
pub const SCB_SHCSR_BUSFAULTENA_Pos: u32 = 17;
pub const SCB_SHCSR_BUSFAULTENA_Msk: u32 = 131072;
pub const SCB_SHCSR_MEMFAULTENA_Pos: u32 = 16;
pub const SCB_SHCSR_MEMFAULTENA_Msk: u32 = 65536;
pub const SCB_SHCSR_SVCALLPENDED_Pos: u32 = 15;
pub const SCB_SHCSR_SVCALLPENDED_Msk: u32 = 32768;
pub const SCB_SHCSR_BUSFAULTPENDED_Pos: u32 = 14;
pub const SCB_SHCSR_BUSFAULTPENDED_Msk: u32 = 16384;
pub const SCB_SHCSR_MEMFAULTPENDED_Pos: u32 = 13;
pub const SCB_SHCSR_MEMFAULTPENDED_Msk: u32 = 8192;
pub const SCB_SHCSR_USGFAULTPENDED_Pos: u32 = 12;
pub const SCB_SHCSR_USGFAULTPENDED_Msk: u32 = 4096;
pub const SCB_SHCSR_SYSTICKACT_Pos: u32 = 11;
pub const SCB_SHCSR_SYSTICKACT_Msk: u32 = 2048;
pub const SCB_SHCSR_PENDSVACT_Pos: u32 = 10;
pub const SCB_SHCSR_PENDSVACT_Msk: u32 = 1024;
pub const SCB_SHCSR_MONITORACT_Pos: u32 = 8;
pub const SCB_SHCSR_MONITORACT_Msk: u32 = 256;
pub const SCB_SHCSR_SVCALLACT_Pos: u32 = 7;
pub const SCB_SHCSR_SVCALLACT_Msk: u32 = 128;
pub const SCB_SHCSR_USGFAULTACT_Pos: u32 = 3;
pub const SCB_SHCSR_USGFAULTACT_Msk: u32 = 8;
pub const SCB_SHCSR_BUSFAULTACT_Pos: u32 = 1;
pub const SCB_SHCSR_BUSFAULTACT_Msk: u32 = 2;
pub const SCB_SHCSR_MEMFAULTACT_Pos: u32 = 0;
pub const SCB_SHCSR_MEMFAULTACT_Msk: u32 = 1;
pub const SCB_CFSR_USGFAULTSR_Pos: u32 = 16;
pub const SCB_CFSR_USGFAULTSR_Msk: u32 = 4294901760;
pub const SCB_CFSR_BUSFAULTSR_Pos: u32 = 8;
pub const SCB_CFSR_BUSFAULTSR_Msk: u32 = 65280;
pub const SCB_CFSR_MEMFAULTSR_Pos: u32 = 0;
pub const SCB_CFSR_MEMFAULTSR_Msk: u32 = 255;
pub const SCB_CFSR_MMARVALID_Pos: u32 = 7;
pub const SCB_CFSR_MMARVALID_Msk: u32 = 128;
pub const SCB_CFSR_MLSPERR_Pos: u32 = 5;
pub const SCB_CFSR_MLSPERR_Msk: u32 = 32;
pub const SCB_CFSR_MSTKERR_Pos: u32 = 4;
pub const SCB_CFSR_MSTKERR_Msk: u32 = 16;
pub const SCB_CFSR_MUNSTKERR_Pos: u32 = 3;
pub const SCB_CFSR_MUNSTKERR_Msk: u32 = 8;
pub const SCB_CFSR_DACCVIOL_Pos: u32 = 1;
pub const SCB_CFSR_DACCVIOL_Msk: u32 = 2;
pub const SCB_CFSR_IACCVIOL_Pos: u32 = 0;
pub const SCB_CFSR_IACCVIOL_Msk: u32 = 1;
pub const SCB_CFSR_BFARVALID_Pos: u32 = 15;
pub const SCB_CFSR_BFARVALID_Msk: u32 = 32768;
pub const SCB_CFSR_LSPERR_Pos: u32 = 13;
pub const SCB_CFSR_LSPERR_Msk: u32 = 8192;
pub const SCB_CFSR_STKERR_Pos: u32 = 12;
pub const SCB_CFSR_STKERR_Msk: u32 = 4096;
pub const SCB_CFSR_UNSTKERR_Pos: u32 = 11;
pub const SCB_CFSR_UNSTKERR_Msk: u32 = 2048;
pub const SCB_CFSR_IMPRECISERR_Pos: u32 = 10;
pub const SCB_CFSR_IMPRECISERR_Msk: u32 = 1024;
pub const SCB_CFSR_PRECISERR_Pos: u32 = 9;
pub const SCB_CFSR_PRECISERR_Msk: u32 = 512;
pub const SCB_CFSR_IBUSERR_Pos: u32 = 8;
pub const SCB_CFSR_IBUSERR_Msk: u32 = 256;
pub const SCB_CFSR_DIVBYZERO_Pos: u32 = 25;
pub const SCB_CFSR_DIVBYZERO_Msk: u32 = 33554432;
pub const SCB_CFSR_UNALIGNED_Pos: u32 = 24;
pub const SCB_CFSR_UNALIGNED_Msk: u32 = 16777216;
pub const SCB_CFSR_NOCP_Pos: u32 = 19;
pub const SCB_CFSR_NOCP_Msk: u32 = 524288;
pub const SCB_CFSR_INVPC_Pos: u32 = 18;
pub const SCB_CFSR_INVPC_Msk: u32 = 262144;
pub const SCB_CFSR_INVSTATE_Pos: u32 = 17;
pub const SCB_CFSR_INVSTATE_Msk: u32 = 131072;
pub const SCB_CFSR_UNDEFINSTR_Pos: u32 = 16;
pub const SCB_CFSR_UNDEFINSTR_Msk: u32 = 65536;
pub const SCB_HFSR_DEBUGEVT_Pos: u32 = 31;
pub const SCB_HFSR_DEBUGEVT_Msk: u32 = 2147483648;
pub const SCB_HFSR_FORCED_Pos: u32 = 30;
pub const SCB_HFSR_FORCED_Msk: u32 = 1073741824;
pub const SCB_HFSR_VECTTBL_Pos: u32 = 1;
pub const SCB_HFSR_VECTTBL_Msk: u32 = 2;
pub const SCB_DFSR_EXTERNAL_Pos: u32 = 4;
pub const SCB_DFSR_EXTERNAL_Msk: u32 = 16;
pub const SCB_DFSR_VCATCH_Pos: u32 = 3;
pub const SCB_DFSR_VCATCH_Msk: u32 = 8;
pub const SCB_DFSR_DWTTRAP_Pos: u32 = 2;
pub const SCB_DFSR_DWTTRAP_Msk: u32 = 4;
pub const SCB_DFSR_BKPT_Pos: u32 = 1;
pub const SCB_DFSR_BKPT_Msk: u32 = 2;
pub const SCB_DFSR_HALTED_Pos: u32 = 0;
pub const SCB_DFSR_HALTED_Msk: u32 = 1;
#[doc = "\\brief  Structure type to access the System Control and ID Register not in the SCB."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCnSCB_Type {
    pub RESERVED0: [u32; 1usize],
    #[doc = "< Offset: 0x004 (R/ )  Interrupt Controller Type Register"]
    pub ICTR: u32,
    #[doc = "< Offset: 0x008 (R/W)  Auxiliary Control Register"]
    pub ACTLR: u32,
}
#[test]
fn bindgen_test_layout_SCnSCB_Type() {
    const UNINIT: ::std::mem::MaybeUninit<SCnSCB_Type> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<SCnSCB_Type>(),
        12usize,
        concat!("Size of: ", stringify!(SCnSCB_Type))
    );
    assert_eq!(
        ::std::mem::align_of::<SCnSCB_Type>(),
        4usize,
        concat!("Alignment of ", stringify!(SCnSCB_Type))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).RESERVED0) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SCnSCB_Type),
            "::",
            stringify!(RESERVED0)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ICTR) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(SCnSCB_Type),
            "::",
            stringify!(ICTR)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ACTLR) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(SCnSCB_Type),
            "::",
            stringify!(ACTLR)
        )
    );
}
pub const SCnSCB_ICTR_INTLINESNUM_Pos: u32 = 0;
pub const SCnSCB_ICTR_INTLINESNUM_Msk: u32 = 15;
pub const SCnSCB_ACTLR_DISOOFP_Pos: u32 = 9;
pub const SCnSCB_ACTLR_DISOOFP_Msk: u32 = 512;
pub const SCnSCB_ACTLR_DISFPCA_Pos: u32 = 8;
pub const SCnSCB_ACTLR_DISFPCA_Msk: u32 = 256;
pub const SCnSCB_ACTLR_DISFOLD_Pos: u32 = 2;
pub const SCnSCB_ACTLR_DISFOLD_Msk: u32 = 4;
pub const SCnSCB_ACTLR_DISDEFWBUF_Pos: u32 = 1;
pub const SCnSCB_ACTLR_DISDEFWBUF_Msk: u32 = 2;
pub const SCnSCB_ACTLR_DISMCYCINT_Pos: u32 = 0;
pub const SCnSCB_ACTLR_DISMCYCINT_Msk: u32 = 1;
#[doc = "\\brief  Structure type to access the System Timer (SysTick)."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SysTick_Type {
    #[doc = "< Offset: 0x000 (R/W)  SysTick Control and Status Register"]
    pub CTRL: u32,
    #[doc = "< Offset: 0x004 (R/W)  SysTick Reload Value Register"]
    pub LOAD: u32,
    #[doc = "< Offset: 0x008 (R/W)  SysTick Current Value Register"]
    pub VAL: u32,
    #[doc = "< Offset: 0x00C (R/ )  SysTick Calibration Register"]
    pub CALIB: u32,
}
#[test]
fn bindgen_test_layout_SysTick_Type() {
    const UNINIT: ::std::mem::MaybeUninit<SysTick_Type> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<SysTick_Type>(),
        16usize,
        concat!("Size of: ", stringify!(SysTick_Type))
    );
    assert_eq!(
        ::std::mem::align_of::<SysTick_Type>(),
        4usize,
        concat!("Alignment of ", stringify!(SysTick_Type))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).CTRL) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SysTick_Type),
            "::",
            stringify!(CTRL)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).LOAD) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(SysTick_Type),
            "::",
            stringify!(LOAD)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).VAL) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(SysTick_Type),
            "::",
            stringify!(VAL)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).CALIB) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(SysTick_Type),
            "::",
            stringify!(CALIB)
        )
    );
}
pub const SysTick_CTRL_COUNTFLAG_Pos: u32 = 16;
pub const SysTick_CTRL_COUNTFLAG_Msk: u32 = 65536;
pub const SysTick_CTRL_CLKSOURCE_Pos: u32 = 2;
pub const SysTick_CTRL_CLKSOURCE_Msk: u32 = 4;
pub const SysTick_CTRL_TICKINT_Pos: u32 = 1;
pub const SysTick_CTRL_TICKINT_Msk: u32 = 2;
pub const SysTick_CTRL_ENABLE_Pos: u32 = 0;
pub const SysTick_CTRL_ENABLE_Msk: u32 = 1;
pub const SysTick_LOAD_RELOAD_Pos: u32 = 0;
pub const SysTick_LOAD_RELOAD_Msk: u32 = 16777215;
pub const SysTick_VAL_CURRENT_Pos: u32 = 0;
pub const SysTick_VAL_CURRENT_Msk: u32 = 16777215;
pub const SysTick_CALIB_NOREF_Pos: u32 = 31;
pub const SysTick_CALIB_NOREF_Msk: u32 = 2147483648;
pub const SysTick_CALIB_SKEW_Pos: u32 = 30;
pub const SysTick_CALIB_SKEW_Msk: u32 = 1073741824;
pub const SysTick_CALIB_TENMS_Pos: u32 = 0;
pub const SysTick_CALIB_TENMS_Msk: u32 = 16777215;
#[doc = "\\brief  Structure type to access the Instrumentation Trace Macrocell Register (ITM)."]
#[repr(C)]
#[derive(Copy, Clone)]
pub struct ITM_Type {
    #[doc = "< Offset: 0x000 ( /W)  ITM Stimulus Port Registers"]
    pub PORT: [ITM_Type__bindgen_ty_1; 32usize],
    pub RESERVED0: [u32; 864usize],
    #[doc = "< Offset: 0xE00 (R/W)  ITM Trace Enable Register"]
    pub TER: u32,
    pub RESERVED1: [u32; 15usize],
    #[doc = "< Offset: 0xE40 (R/W)  ITM Trace Privilege Register"]
    pub TPR: u32,
    pub RESERVED2: [u32; 15usize],
    #[doc = "< Offset: 0xE80 (R/W)  ITM Trace Control Register"]
    pub TCR: u32,
    pub RESERVED3: [u32; 29usize],
    #[doc = "< Offset: 0xEF8 ( /W)  ITM Integration Write Register"]
    pub IWR: u32,
    #[doc = "< Offset: 0xEFC (R/ )  ITM Integration Read Register"]
    pub IRR: u32,
    #[doc = "< Offset: 0xF00 (R/W)  ITM Integration Mode Control Register"]
    pub IMCR: u32,
    pub RESERVED4: [u32; 43usize],
    #[doc = "< Offset: 0xFB0 ( /W)  ITM Lock Access Register"]
    pub LAR: u32,
    #[doc = "< Offset: 0xFB4 (R/ )  ITM Lock Status Register"]
    pub LSR: u32,
    pub RESERVED5: [u32; 6usize],
    #[doc = "< Offset: 0xFD0 (R/ )  ITM Peripheral Identification Register #4"]
    pub PID4: u32,
    #[doc = "< Offset: 0xFD4 (R/ )  ITM Peripheral Identification Register #5"]
    pub PID5: u32,
    #[doc = "< Offset: 0xFD8 (R/ )  ITM Peripheral Identification Register #6"]
    pub PID6: u32,
    #[doc = "< Offset: 0xFDC (R/ )  ITM Peripheral Identification Register #7"]
    pub PID7: u32,
    #[doc = "< Offset: 0xFE0 (R/ )  ITM Peripheral Identification Register #0"]
    pub PID0: u32,
    #[doc = "< Offset: 0xFE4 (R/ )  ITM Peripheral Identification Register #1"]
    pub PID1: u32,
    #[doc = "< Offset: 0xFE8 (R/ )  ITM Peripheral Identification Register #2"]
    pub PID2: u32,
    #[doc = "< Offset: 0xFEC (R/ )  ITM Peripheral Identification Register #3"]
    pub PID3: u32,
    #[doc = "< Offset: 0xFF0 (R/ )  ITM Component  Identification Register #0"]
    pub CID0: u32,
    #[doc = "< Offset: 0xFF4 (R/ )  ITM Component  Identification Register #1"]
    pub CID1: u32,
    #[doc = "< Offset: 0xFF8 (R/ )  ITM Component  Identification Register #2"]
    pub CID2: u32,
    #[doc = "< Offset: 0xFFC (R/ )  ITM Component  Identification Register #3"]
    pub CID3: u32,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union ITM_Type__bindgen_ty_1 {
    #[doc = "< Offset: 0x000 ( /W)  ITM Stimulus Port 8-bit"]
    pub u8_: u8,
    #[doc = "< Offset: 0x000 ( /W)  ITM Stimulus Port 16-bit"]
    pub u16_: u16,
    #[doc = "< Offset: 0x000 ( /W)  ITM Stimulus Port 32-bit"]
    pub u32_: u32,
}
#[test]
fn bindgen_test_layout_ITM_Type__bindgen_ty_1() {
    const UNINIT: ::std::mem::MaybeUninit<ITM_Type__bindgen_ty_1> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ITM_Type__bindgen_ty_1>(),
        4usize,
        concat!("Size of: ", stringify!(ITM_Type__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<ITM_Type__bindgen_ty_1>(),
        4usize,
        concat!("Alignment of ", stringify!(ITM_Type__bindgen_ty_1))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).u8_) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ITM_Type__bindgen_ty_1),
            "::",
            stringify!(u8_)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).u16_) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ITM_Type__bindgen_ty_1),
            "::",
            stringify!(u16_)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).u32_) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ITM_Type__bindgen_ty_1),
            "::",
            stringify!(u32_)
        )
    );
}
#[test]
fn bindgen_test_layout_ITM_Type() {
    const UNINIT: ::std::mem::MaybeUninit<ITM_Type> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ITM_Type>(),
        4096usize,
        concat!("Size of: ", stringify!(ITM_Type))
    );
    assert_eq!(
        ::std::mem::align_of::<ITM_Type>(),
        4usize,
        concat!("Alignment of ", stringify!(ITM_Type))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).PORT) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ITM_Type),
            "::",
            stringify!(PORT)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).RESERVED0) as usize - ptr as usize },
        128usize,
        concat!(
            "Offset of field: ",
            stringify!(ITM_Type),
            "::",
            stringify!(RESERVED0)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).TER) as usize - ptr as usize },
        3584usize,
        concat!(
            "Offset of field: ",
            stringify!(ITM_Type),
            "::",
            stringify!(TER)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).RESERVED1) as usize - ptr as usize },
        3588usize,
        concat!(
            "Offset of field: ",
            stringify!(ITM_Type),
            "::",
            stringify!(RESERVED1)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).TPR) as usize - ptr as usize },
        3648usize,
        concat!(
            "Offset of field: ",
            stringify!(ITM_Type),
            "::",
            stringify!(TPR)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).RESERVED2) as usize - ptr as usize },
        3652usize,
        concat!(
            "Offset of field: ",
            stringify!(ITM_Type),
            "::",
            stringify!(RESERVED2)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).TCR) as usize - ptr as usize },
        3712usize,
        concat!(
            "Offset of field: ",
            stringify!(ITM_Type),
            "::",
            stringify!(TCR)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).RESERVED3) as usize - ptr as usize },
        3716usize,
        concat!(
            "Offset of field: ",
            stringify!(ITM_Type),
            "::",
            stringify!(RESERVED3)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).IWR) as usize - ptr as usize },
        3832usize,
        concat!(
            "Offset of field: ",
            stringify!(ITM_Type),
            "::",
            stringify!(IWR)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).IRR) as usize - ptr as usize },
        3836usize,
        concat!(
            "Offset of field: ",
            stringify!(ITM_Type),
            "::",
            stringify!(IRR)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).IMCR) as usize - ptr as usize },
        3840usize,
        concat!(
            "Offset of field: ",
            stringify!(ITM_Type),
            "::",
            stringify!(IMCR)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).RESERVED4) as usize - ptr as usize },
        3844usize,
        concat!(
            "Offset of field: ",
            stringify!(ITM_Type),
            "::",
            stringify!(RESERVED4)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).LAR) as usize - ptr as usize },
        4016usize,
        concat!(
            "Offset of field: ",
            stringify!(ITM_Type),
            "::",
            stringify!(LAR)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).LSR) as usize - ptr as usize },
        4020usize,
        concat!(
            "Offset of field: ",
            stringify!(ITM_Type),
            "::",
            stringify!(LSR)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).RESERVED5) as usize - ptr as usize },
        4024usize,
        concat!(
            "Offset of field: ",
            stringify!(ITM_Type),
            "::",
            stringify!(RESERVED5)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).PID4) as usize - ptr as usize },
        4048usize,
        concat!(
            "Offset of field: ",
            stringify!(ITM_Type),
            "::",
            stringify!(PID4)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).PID5) as usize - ptr as usize },
        4052usize,
        concat!(
            "Offset of field: ",
            stringify!(ITM_Type),
            "::",
            stringify!(PID5)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).PID6) as usize - ptr as usize },
        4056usize,
        concat!(
            "Offset of field: ",
            stringify!(ITM_Type),
            "::",
            stringify!(PID6)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).PID7) as usize - ptr as usize },
        4060usize,
        concat!(
            "Offset of field: ",
            stringify!(ITM_Type),
            "::",
            stringify!(PID7)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).PID0) as usize - ptr as usize },
        4064usize,
        concat!(
            "Offset of field: ",
            stringify!(ITM_Type),
            "::",
            stringify!(PID0)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).PID1) as usize - ptr as usize },
        4068usize,
        concat!(
            "Offset of field: ",
            stringify!(ITM_Type),
            "::",
            stringify!(PID1)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).PID2) as usize - ptr as usize },
        4072usize,
        concat!(
            "Offset of field: ",
            stringify!(ITM_Type),
            "::",
            stringify!(PID2)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).PID3) as usize - ptr as usize },
        4076usize,
        concat!(
            "Offset of field: ",
            stringify!(ITM_Type),
            "::",
            stringify!(PID3)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).CID0) as usize - ptr as usize },
        4080usize,
        concat!(
            "Offset of field: ",
            stringify!(ITM_Type),
            "::",
            stringify!(CID0)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).CID1) as usize - ptr as usize },
        4084usize,
        concat!(
            "Offset of field: ",
            stringify!(ITM_Type),
            "::",
            stringify!(CID1)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).CID2) as usize - ptr as usize },
        4088usize,
        concat!(
            "Offset of field: ",
            stringify!(ITM_Type),
            "::",
            stringify!(CID2)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).CID3) as usize - ptr as usize },
        4092usize,
        concat!(
            "Offset of field: ",
            stringify!(ITM_Type),
            "::",
            stringify!(CID3)
        )
    );
}
pub const ITM_TPR_PRIVMASK_Pos: u32 = 0;
pub const ITM_TPR_PRIVMASK_Msk: u32 = 15;
pub const ITM_TCR_BUSY_Pos: u32 = 23;
pub const ITM_TCR_BUSY_Msk: u32 = 8388608;
pub const ITM_TCR_TraceBusID_Pos: u32 = 16;
pub const ITM_TCR_TraceBusID_Msk: u32 = 8323072;
pub const ITM_TCR_GTSFREQ_Pos: u32 = 10;
pub const ITM_TCR_GTSFREQ_Msk: u32 = 3072;
pub const ITM_TCR_TSPrescale_Pos: u32 = 8;
pub const ITM_TCR_TSPrescale_Msk: u32 = 768;
pub const ITM_TCR_SWOENA_Pos: u32 = 4;
pub const ITM_TCR_SWOENA_Msk: u32 = 16;
pub const ITM_TCR_DWTENA_Pos: u32 = 3;
pub const ITM_TCR_DWTENA_Msk: u32 = 8;
pub const ITM_TCR_SYNCENA_Pos: u32 = 2;
pub const ITM_TCR_SYNCENA_Msk: u32 = 4;
pub const ITM_TCR_TSENA_Pos: u32 = 1;
pub const ITM_TCR_TSENA_Msk: u32 = 2;
pub const ITM_TCR_ITMENA_Pos: u32 = 0;
pub const ITM_TCR_ITMENA_Msk: u32 = 1;
pub const ITM_IWR_ATVALIDM_Pos: u32 = 0;
pub const ITM_IWR_ATVALIDM_Msk: u32 = 1;
pub const ITM_IRR_ATREADYM_Pos: u32 = 0;
pub const ITM_IRR_ATREADYM_Msk: u32 = 1;
pub const ITM_IMCR_INTEGRATION_Pos: u32 = 0;
pub const ITM_IMCR_INTEGRATION_Msk: u32 = 1;
pub const ITM_LSR_ByteAcc_Pos: u32 = 2;
pub const ITM_LSR_ByteAcc_Msk: u32 = 4;
pub const ITM_LSR_Access_Pos: u32 = 1;
pub const ITM_LSR_Access_Msk: u32 = 2;
pub const ITM_LSR_Present_Pos: u32 = 0;
pub const ITM_LSR_Present_Msk: u32 = 1;
#[doc = "\\brief  Structure type to access the Data Watchpoint and Trace Register (DWT)."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct DWT_Type {
    #[doc = "< Offset: 0x000 (R/W)  Control Register"]
    pub CTRL: u32,
    #[doc = "< Offset: 0x004 (R/W)  Cycle Count Register"]
    pub CYCCNT: u32,
    #[doc = "< Offset: 0x008 (R/W)  CPI Count Register"]
    pub CPICNT: u32,
    #[doc = "< Offset: 0x00C (R/W)  Exception Overhead Count Register"]
    pub EXCCNT: u32,
    #[doc = "< Offset: 0x010 (R/W)  Sleep Count Register"]
    pub SLEEPCNT: u32,
    #[doc = "< Offset: 0x014 (R/W)  LSU Count Register"]
    pub LSUCNT: u32,
    #[doc = "< Offset: 0x018 (R/W)  Folded-instruction Count Register"]
    pub FOLDCNT: u32,
    #[doc = "< Offset: 0x01C (R/ )  Program Counter Sample Register"]
    pub PCSR: u32,
    #[doc = "< Offset: 0x020 (R/W)  Comparator Register 0"]
    pub COMP0: u32,
    #[doc = "< Offset: 0x024 (R/W)  Mask Register 0"]
    pub MASK0: u32,
    #[doc = "< Offset: 0x028 (R/W)  Function Register 0"]
    pub FUNCTION0: u32,
    pub RESERVED0: [u32; 1usize],
    #[doc = "< Offset: 0x030 (R/W)  Comparator Register 1"]
    pub COMP1: u32,
    #[doc = "< Offset: 0x034 (R/W)  Mask Register 1"]
    pub MASK1: u32,
    #[doc = "< Offset: 0x038 (R/W)  Function Register 1"]
    pub FUNCTION1: u32,
    pub RESERVED1: [u32; 1usize],
    #[doc = "< Offset: 0x040 (R/W)  Comparator Register 2"]
    pub COMP2: u32,
    #[doc = "< Offset: 0x044 (R/W)  Mask Register 2"]
    pub MASK2: u32,
    #[doc = "< Offset: 0x048 (R/W)  Function Register 2"]
    pub FUNCTION2: u32,
    pub RESERVED2: [u32; 1usize],
    #[doc = "< Offset: 0x050 (R/W)  Comparator Register 3"]
    pub COMP3: u32,
    #[doc = "< Offset: 0x054 (R/W)  Mask Register 3"]
    pub MASK3: u32,
    #[doc = "< Offset: 0x058 (R/W)  Function Register 3"]
    pub FUNCTION3: u32,
}
#[test]
fn bindgen_test_layout_DWT_Type() {
    const UNINIT: ::std::mem::MaybeUninit<DWT_Type> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<DWT_Type>(),
        92usize,
        concat!("Size of: ", stringify!(DWT_Type))
    );
    assert_eq!(
        ::std::mem::align_of::<DWT_Type>(),
        4usize,
        concat!("Alignment of ", stringify!(DWT_Type))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).CTRL) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(DWT_Type),
            "::",
            stringify!(CTRL)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).CYCCNT) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(DWT_Type),
            "::",
            stringify!(CYCCNT)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).CPICNT) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(DWT_Type),
            "::",
            stringify!(CPICNT)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).EXCCNT) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(DWT_Type),
            "::",
            stringify!(EXCCNT)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).SLEEPCNT) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(DWT_Type),
            "::",
            stringify!(SLEEPCNT)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).LSUCNT) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(DWT_Type),
            "::",
            stringify!(LSUCNT)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).FOLDCNT) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(DWT_Type),
            "::",
            stringify!(FOLDCNT)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).PCSR) as usize - ptr as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(DWT_Type),
            "::",
            stringify!(PCSR)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).COMP0) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(DWT_Type),
            "::",
            stringify!(COMP0)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).MASK0) as usize - ptr as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(DWT_Type),
            "::",
            stringify!(MASK0)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).FUNCTION0) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(DWT_Type),
            "::",
            stringify!(FUNCTION0)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).RESERVED0) as usize - ptr as usize },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(DWT_Type),
            "::",
            stringify!(RESERVED0)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).COMP1) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(DWT_Type),
            "::",
            stringify!(COMP1)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).MASK1) as usize - ptr as usize },
        52usize,
        concat!(
            "Offset of field: ",
            stringify!(DWT_Type),
            "::",
            stringify!(MASK1)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).FUNCTION1) as usize - ptr as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(DWT_Type),
            "::",
            stringify!(FUNCTION1)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).RESERVED1) as usize - ptr as usize },
        60usize,
        concat!(
            "Offset of field: ",
            stringify!(DWT_Type),
            "::",
            stringify!(RESERVED1)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).COMP2) as usize - ptr as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(DWT_Type),
            "::",
            stringify!(COMP2)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).MASK2) as usize - ptr as usize },
        68usize,
        concat!(
            "Offset of field: ",
            stringify!(DWT_Type),
            "::",
            stringify!(MASK2)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).FUNCTION2) as usize - ptr as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(DWT_Type),
            "::",
            stringify!(FUNCTION2)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).RESERVED2) as usize - ptr as usize },
        76usize,
        concat!(
            "Offset of field: ",
            stringify!(DWT_Type),
            "::",
            stringify!(RESERVED2)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).COMP3) as usize - ptr as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(DWT_Type),
            "::",
            stringify!(COMP3)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).MASK3) as usize - ptr as usize },
        84usize,
        concat!(
            "Offset of field: ",
            stringify!(DWT_Type),
            "::",
            stringify!(MASK3)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).FUNCTION3) as usize - ptr as usize },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(DWT_Type),
            "::",
            stringify!(FUNCTION3)
        )
    );
}
pub const DWT_CTRL_NUMCOMP_Pos: u32 = 28;
pub const DWT_CTRL_NUMCOMP_Msk: u32 = 4026531840;
pub const DWT_CTRL_NOTRCPKT_Pos: u32 = 27;
pub const DWT_CTRL_NOTRCPKT_Msk: u32 = 134217728;
pub const DWT_CTRL_NOEXTTRIG_Pos: u32 = 26;
pub const DWT_CTRL_NOEXTTRIG_Msk: u32 = 67108864;
pub const DWT_CTRL_NOCYCCNT_Pos: u32 = 25;
pub const DWT_CTRL_NOCYCCNT_Msk: u32 = 33554432;
pub const DWT_CTRL_NOPRFCNT_Pos: u32 = 24;
pub const DWT_CTRL_NOPRFCNT_Msk: u32 = 16777216;
pub const DWT_CTRL_CYCEVTENA_Pos: u32 = 22;
pub const DWT_CTRL_CYCEVTENA_Msk: u32 = 4194304;
pub const DWT_CTRL_FOLDEVTENA_Pos: u32 = 21;
pub const DWT_CTRL_FOLDEVTENA_Msk: u32 = 2097152;
pub const DWT_CTRL_LSUEVTENA_Pos: u32 = 20;
pub const DWT_CTRL_LSUEVTENA_Msk: u32 = 1048576;
pub const DWT_CTRL_SLEEPEVTENA_Pos: u32 = 19;
pub const DWT_CTRL_SLEEPEVTENA_Msk: u32 = 524288;
pub const DWT_CTRL_EXCEVTENA_Pos: u32 = 18;
pub const DWT_CTRL_EXCEVTENA_Msk: u32 = 262144;
pub const DWT_CTRL_CPIEVTENA_Pos: u32 = 17;
pub const DWT_CTRL_CPIEVTENA_Msk: u32 = 131072;
pub const DWT_CTRL_EXCTRCENA_Pos: u32 = 16;
pub const DWT_CTRL_EXCTRCENA_Msk: u32 = 65536;
pub const DWT_CTRL_PCSAMPLENA_Pos: u32 = 12;
pub const DWT_CTRL_PCSAMPLENA_Msk: u32 = 4096;
pub const DWT_CTRL_SYNCTAP_Pos: u32 = 10;
pub const DWT_CTRL_SYNCTAP_Msk: u32 = 3072;
pub const DWT_CTRL_CYCTAP_Pos: u32 = 9;
pub const DWT_CTRL_CYCTAP_Msk: u32 = 512;
pub const DWT_CTRL_POSTINIT_Pos: u32 = 5;
pub const DWT_CTRL_POSTINIT_Msk: u32 = 480;
pub const DWT_CTRL_POSTPRESET_Pos: u32 = 1;
pub const DWT_CTRL_POSTPRESET_Msk: u32 = 30;
pub const DWT_CTRL_CYCCNTENA_Pos: u32 = 0;
pub const DWT_CTRL_CYCCNTENA_Msk: u32 = 1;
pub const DWT_CPICNT_CPICNT_Pos: u32 = 0;
pub const DWT_CPICNT_CPICNT_Msk: u32 = 255;
pub const DWT_EXCCNT_EXCCNT_Pos: u32 = 0;
pub const DWT_EXCCNT_EXCCNT_Msk: u32 = 255;
pub const DWT_SLEEPCNT_SLEEPCNT_Pos: u32 = 0;
pub const DWT_SLEEPCNT_SLEEPCNT_Msk: u32 = 255;
pub const DWT_LSUCNT_LSUCNT_Pos: u32 = 0;
pub const DWT_LSUCNT_LSUCNT_Msk: u32 = 255;
pub const DWT_FOLDCNT_FOLDCNT_Pos: u32 = 0;
pub const DWT_FOLDCNT_FOLDCNT_Msk: u32 = 255;
pub const DWT_MASK_MASK_Pos: u32 = 0;
pub const DWT_MASK_MASK_Msk: u32 = 31;
pub const DWT_FUNCTION_MATCHED_Pos: u32 = 24;
pub const DWT_FUNCTION_MATCHED_Msk: u32 = 16777216;
pub const DWT_FUNCTION_DATAVADDR1_Pos: u32 = 16;
pub const DWT_FUNCTION_DATAVADDR1_Msk: u32 = 983040;
pub const DWT_FUNCTION_DATAVADDR0_Pos: u32 = 12;
pub const DWT_FUNCTION_DATAVADDR0_Msk: u32 = 61440;
pub const DWT_FUNCTION_DATAVSIZE_Pos: u32 = 10;
pub const DWT_FUNCTION_DATAVSIZE_Msk: u32 = 3072;
pub const DWT_FUNCTION_LNK1ENA_Pos: u32 = 9;
pub const DWT_FUNCTION_LNK1ENA_Msk: u32 = 512;
pub const DWT_FUNCTION_DATAVMATCH_Pos: u32 = 8;
pub const DWT_FUNCTION_DATAVMATCH_Msk: u32 = 256;
pub const DWT_FUNCTION_CYCMATCH_Pos: u32 = 7;
pub const DWT_FUNCTION_CYCMATCH_Msk: u32 = 128;
pub const DWT_FUNCTION_EMITRANGE_Pos: u32 = 5;
pub const DWT_FUNCTION_EMITRANGE_Msk: u32 = 32;
pub const DWT_FUNCTION_FUNCTION_Pos: u32 = 0;
pub const DWT_FUNCTION_FUNCTION_Msk: u32 = 15;
#[doc = "\\brief  Structure type to access the Trace Port Interface Register (TPI)."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct TPI_Type {
    #[doc = "< Offset: 0x000 (R/ )  Supported Parallel Port Size Register"]
    pub SSPSR: u32,
    #[doc = "< Offset: 0x004 (R/W)  Current Parallel Port Size Register"]
    pub CSPSR: u32,
    pub RESERVED0: [u32; 2usize],
    #[doc = "< Offset: 0x010 (R/W)  Asynchronous Clock Prescaler Register"]
    pub ACPR: u32,
    pub RESERVED1: [u32; 55usize],
    #[doc = "< Offset: 0x0F0 (R/W)  Selected Pin Protocol Register"]
    pub SPPR: u32,
    pub RESERVED2: [u32; 131usize],
    #[doc = "< Offset: 0x300 (R/ )  Formatter and Flush Status Register"]
    pub FFSR: u32,
    #[doc = "< Offset: 0x304 (R/W)  Formatter and Flush Control Register"]
    pub FFCR: u32,
    #[doc = "< Offset: 0x308 (R/ )  Formatter Synchronization Counter Register"]
    pub FSCR: u32,
    pub RESERVED3: [u32; 759usize],
    #[doc = "< Offset: 0xEE8 (R/ )  TRIGGER"]
    pub TRIGGER: u32,
    #[doc = "< Offset: 0xEEC (R/ )  Integration ETM Data"]
    pub FIFO0: u32,
    #[doc = "< Offset: 0xEF0 (R/ )  ITATBCTR2"]
    pub ITATBCTR2: u32,
    pub RESERVED4: [u32; 1usize],
    #[doc = "< Offset: 0xEF8 (R/ )  ITATBCTR0"]
    pub ITATBCTR0: u32,
    #[doc = "< Offset: 0xEFC (R/ )  Integration ITM Data"]
    pub FIFO1: u32,
    #[doc = "< Offset: 0xF00 (R/W)  Integration Mode Control"]
    pub ITCTRL: u32,
    pub RESERVED5: [u32; 39usize],
    #[doc = "< Offset: 0xFA0 (R/W)  Claim tag set"]
    pub CLAIMSET: u32,
    #[doc = "< Offset: 0xFA4 (R/W)  Claim tag clear"]
    pub CLAIMCLR: u32,
    pub RESERVED7: [u32; 8usize],
    #[doc = "< Offset: 0xFC8 (R/ )  TPIU_DEVID"]
    pub DEVID: u32,
    #[doc = "< Offset: 0xFCC (R/ )  TPIU_DEVTYPE"]
    pub DEVTYPE: u32,
}
#[test]
fn bindgen_test_layout_TPI_Type() {
    const UNINIT: ::std::mem::MaybeUninit<TPI_Type> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<TPI_Type>(),
        4048usize,
        concat!("Size of: ", stringify!(TPI_Type))
    );
    assert_eq!(
        ::std::mem::align_of::<TPI_Type>(),
        4usize,
        concat!("Alignment of ", stringify!(TPI_Type))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).SSPSR) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(TPI_Type),
            "::",
            stringify!(SSPSR)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).CSPSR) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(TPI_Type),
            "::",
            stringify!(CSPSR)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).RESERVED0) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(TPI_Type),
            "::",
            stringify!(RESERVED0)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ACPR) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(TPI_Type),
            "::",
            stringify!(ACPR)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).RESERVED1) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(TPI_Type),
            "::",
            stringify!(RESERVED1)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).SPPR) as usize - ptr as usize },
        240usize,
        concat!(
            "Offset of field: ",
            stringify!(TPI_Type),
            "::",
            stringify!(SPPR)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).RESERVED2) as usize - ptr as usize },
        244usize,
        concat!(
            "Offset of field: ",
            stringify!(TPI_Type),
            "::",
            stringify!(RESERVED2)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).FFSR) as usize - ptr as usize },
        768usize,
        concat!(
            "Offset of field: ",
            stringify!(TPI_Type),
            "::",
            stringify!(FFSR)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).FFCR) as usize - ptr as usize },
        772usize,
        concat!(
            "Offset of field: ",
            stringify!(TPI_Type),
            "::",
            stringify!(FFCR)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).FSCR) as usize - ptr as usize },
        776usize,
        concat!(
            "Offset of field: ",
            stringify!(TPI_Type),
            "::",
            stringify!(FSCR)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).RESERVED3) as usize - ptr as usize },
        780usize,
        concat!(
            "Offset of field: ",
            stringify!(TPI_Type),
            "::",
            stringify!(RESERVED3)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).TRIGGER) as usize - ptr as usize },
        3816usize,
        concat!(
            "Offset of field: ",
            stringify!(TPI_Type),
            "::",
            stringify!(TRIGGER)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).FIFO0) as usize - ptr as usize },
        3820usize,
        concat!(
            "Offset of field: ",
            stringify!(TPI_Type),
            "::",
            stringify!(FIFO0)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ITATBCTR2) as usize - ptr as usize },
        3824usize,
        concat!(
            "Offset of field: ",
            stringify!(TPI_Type),
            "::",
            stringify!(ITATBCTR2)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).RESERVED4) as usize - ptr as usize },
        3828usize,
        concat!(
            "Offset of field: ",
            stringify!(TPI_Type),
            "::",
            stringify!(RESERVED4)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ITATBCTR0) as usize - ptr as usize },
        3832usize,
        concat!(
            "Offset of field: ",
            stringify!(TPI_Type),
            "::",
            stringify!(ITATBCTR0)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).FIFO1) as usize - ptr as usize },
        3836usize,
        concat!(
            "Offset of field: ",
            stringify!(TPI_Type),
            "::",
            stringify!(FIFO1)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ITCTRL) as usize - ptr as usize },
        3840usize,
        concat!(
            "Offset of field: ",
            stringify!(TPI_Type),
            "::",
            stringify!(ITCTRL)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).RESERVED5) as usize - ptr as usize },
        3844usize,
        concat!(
            "Offset of field: ",
            stringify!(TPI_Type),
            "::",
            stringify!(RESERVED5)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).CLAIMSET) as usize - ptr as usize },
        4000usize,
        concat!(
            "Offset of field: ",
            stringify!(TPI_Type),
            "::",
            stringify!(CLAIMSET)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).CLAIMCLR) as usize - ptr as usize },
        4004usize,
        concat!(
            "Offset of field: ",
            stringify!(TPI_Type),
            "::",
            stringify!(CLAIMCLR)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).RESERVED7) as usize - ptr as usize },
        4008usize,
        concat!(
            "Offset of field: ",
            stringify!(TPI_Type),
            "::",
            stringify!(RESERVED7)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).DEVID) as usize - ptr as usize },
        4040usize,
        concat!(
            "Offset of field: ",
            stringify!(TPI_Type),
            "::",
            stringify!(DEVID)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).DEVTYPE) as usize - ptr as usize },
        4044usize,
        concat!(
            "Offset of field: ",
            stringify!(TPI_Type),
            "::",
            stringify!(DEVTYPE)
        )
    );
}
pub const TPI_ACPR_PRESCALER_Pos: u32 = 0;
pub const TPI_ACPR_PRESCALER_Msk: u32 = 8191;
pub const TPI_SPPR_TXMODE_Pos: u32 = 0;
pub const TPI_SPPR_TXMODE_Msk: u32 = 3;
pub const TPI_FFSR_FtNonStop_Pos: u32 = 3;
pub const TPI_FFSR_FtNonStop_Msk: u32 = 8;
pub const TPI_FFSR_TCPresent_Pos: u32 = 2;
pub const TPI_FFSR_TCPresent_Msk: u32 = 4;
pub const TPI_FFSR_FtStopped_Pos: u32 = 1;
pub const TPI_FFSR_FtStopped_Msk: u32 = 2;
pub const TPI_FFSR_FlInProg_Pos: u32 = 0;
pub const TPI_FFSR_FlInProg_Msk: u32 = 1;
pub const TPI_FFCR_TrigIn_Pos: u32 = 8;
pub const TPI_FFCR_TrigIn_Msk: u32 = 256;
pub const TPI_FFCR_EnFCont_Pos: u32 = 1;
pub const TPI_FFCR_EnFCont_Msk: u32 = 2;
pub const TPI_TRIGGER_TRIGGER_Pos: u32 = 0;
pub const TPI_TRIGGER_TRIGGER_Msk: u32 = 1;
pub const TPI_FIFO0_ITM_ATVALID_Pos: u32 = 29;
pub const TPI_FIFO0_ITM_ATVALID_Msk: u32 = 1610612736;
pub const TPI_FIFO0_ITM_bytecount_Pos: u32 = 27;
pub const TPI_FIFO0_ITM_bytecount_Msk: u32 = 402653184;
pub const TPI_FIFO0_ETM_ATVALID_Pos: u32 = 26;
pub const TPI_FIFO0_ETM_ATVALID_Msk: u32 = 201326592;
pub const TPI_FIFO0_ETM_bytecount_Pos: u32 = 24;
pub const TPI_FIFO0_ETM_bytecount_Msk: u32 = 50331648;
pub const TPI_FIFO0_ETM2_Pos: u32 = 16;
pub const TPI_FIFO0_ETM2_Msk: u32 = 16711680;
pub const TPI_FIFO0_ETM1_Pos: u32 = 8;
pub const TPI_FIFO0_ETM1_Msk: u32 = 65280;
pub const TPI_FIFO0_ETM0_Pos: u32 = 0;
pub const TPI_FIFO0_ETM0_Msk: u32 = 255;
pub const TPI_ITATBCTR2_ATREADY_Pos: u32 = 0;
pub const TPI_ITATBCTR2_ATREADY_Msk: u32 = 1;
pub const TPI_FIFO1_ITM_ATVALID_Pos: u32 = 29;
pub const TPI_FIFO1_ITM_ATVALID_Msk: u32 = 1610612736;
pub const TPI_FIFO1_ITM_bytecount_Pos: u32 = 27;
pub const TPI_FIFO1_ITM_bytecount_Msk: u32 = 402653184;
pub const TPI_FIFO1_ETM_ATVALID_Pos: u32 = 26;
pub const TPI_FIFO1_ETM_ATVALID_Msk: u32 = 201326592;
pub const TPI_FIFO1_ETM_bytecount_Pos: u32 = 24;
pub const TPI_FIFO1_ETM_bytecount_Msk: u32 = 50331648;
pub const TPI_FIFO1_ITM2_Pos: u32 = 16;
pub const TPI_FIFO1_ITM2_Msk: u32 = 16711680;
pub const TPI_FIFO1_ITM1_Pos: u32 = 8;
pub const TPI_FIFO1_ITM1_Msk: u32 = 65280;
pub const TPI_FIFO1_ITM0_Pos: u32 = 0;
pub const TPI_FIFO1_ITM0_Msk: u32 = 255;
pub const TPI_ITATBCTR0_ATREADY_Pos: u32 = 0;
pub const TPI_ITATBCTR0_ATREADY_Msk: u32 = 1;
pub const TPI_ITCTRL_Mode_Pos: u32 = 0;
pub const TPI_ITCTRL_Mode_Msk: u32 = 1;
pub const TPI_DEVID_NRZVALID_Pos: u32 = 11;
pub const TPI_DEVID_NRZVALID_Msk: u32 = 2048;
pub const TPI_DEVID_MANCVALID_Pos: u32 = 10;
pub const TPI_DEVID_MANCVALID_Msk: u32 = 1024;
pub const TPI_DEVID_PTINVALID_Pos: u32 = 9;
pub const TPI_DEVID_PTINVALID_Msk: u32 = 512;
pub const TPI_DEVID_MinBufSz_Pos: u32 = 6;
pub const TPI_DEVID_MinBufSz_Msk: u32 = 448;
pub const TPI_DEVID_AsynClkIn_Pos: u32 = 5;
pub const TPI_DEVID_AsynClkIn_Msk: u32 = 32;
pub const TPI_DEVID_NrTraceInput_Pos: u32 = 0;
pub const TPI_DEVID_NrTraceInput_Msk: u32 = 31;
pub const TPI_DEVTYPE_MajorType_Pos: u32 = 4;
pub const TPI_DEVTYPE_MajorType_Msk: u32 = 240;
pub const TPI_DEVTYPE_SubType_Pos: u32 = 0;
pub const TPI_DEVTYPE_SubType_Msk: u32 = 15;
#[doc = "\\brief  Structure type to access the Floating Point Unit (FPU)."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct FPU_Type {
    pub RESERVED0: [u32; 1usize],
    #[doc = "< Offset: 0x004 (R/W)  Floating-Point Context Control Register"]
    pub FPCCR: u32,
    #[doc = "< Offset: 0x008 (R/W)  Floating-Point Context Address Register"]
    pub FPCAR: u32,
    #[doc = "< Offset: 0x00C (R/W)  Floating-Point Default Status Control Register"]
    pub FPDSCR: u32,
    #[doc = "< Offset: 0x010 (R/ )  Media and FP Feature Register 0"]
    pub MVFR0: u32,
    #[doc = "< Offset: 0x014 (R/ )  Media and FP Feature Register 1"]
    pub MVFR1: u32,
}
#[test]
fn bindgen_test_layout_FPU_Type() {
    const UNINIT: ::std::mem::MaybeUninit<FPU_Type> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<FPU_Type>(),
        24usize,
        concat!("Size of: ", stringify!(FPU_Type))
    );
    assert_eq!(
        ::std::mem::align_of::<FPU_Type>(),
        4usize,
        concat!("Alignment of ", stringify!(FPU_Type))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).RESERVED0) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(FPU_Type),
            "::",
            stringify!(RESERVED0)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).FPCCR) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(FPU_Type),
            "::",
            stringify!(FPCCR)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).FPCAR) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(FPU_Type),
            "::",
            stringify!(FPCAR)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).FPDSCR) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(FPU_Type),
            "::",
            stringify!(FPDSCR)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).MVFR0) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(FPU_Type),
            "::",
            stringify!(MVFR0)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).MVFR1) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(FPU_Type),
            "::",
            stringify!(MVFR1)
        )
    );
}
pub const FPU_FPCCR_ASPEN_Pos: u32 = 31;
pub const FPU_FPCCR_ASPEN_Msk: u32 = 2147483648;
pub const FPU_FPCCR_LSPEN_Pos: u32 = 30;
pub const FPU_FPCCR_LSPEN_Msk: u32 = 1073741824;
pub const FPU_FPCCR_MONRDY_Pos: u32 = 8;
pub const FPU_FPCCR_MONRDY_Msk: u32 = 256;
pub const FPU_FPCCR_BFRDY_Pos: u32 = 6;
pub const FPU_FPCCR_BFRDY_Msk: u32 = 64;
pub const FPU_FPCCR_MMRDY_Pos: u32 = 5;
pub const FPU_FPCCR_MMRDY_Msk: u32 = 32;
pub const FPU_FPCCR_HFRDY_Pos: u32 = 4;
pub const FPU_FPCCR_HFRDY_Msk: u32 = 16;
pub const FPU_FPCCR_THREAD_Pos: u32 = 3;
pub const FPU_FPCCR_THREAD_Msk: u32 = 8;
pub const FPU_FPCCR_USER_Pos: u32 = 1;
pub const FPU_FPCCR_USER_Msk: u32 = 2;
pub const FPU_FPCCR_LSPACT_Pos: u32 = 0;
pub const FPU_FPCCR_LSPACT_Msk: u32 = 1;
pub const FPU_FPCAR_ADDRESS_Pos: u32 = 3;
pub const FPU_FPCAR_ADDRESS_Msk: u32 = 4294967288;
pub const FPU_FPDSCR_AHP_Pos: u32 = 26;
pub const FPU_FPDSCR_AHP_Msk: u32 = 67108864;
pub const FPU_FPDSCR_DN_Pos: u32 = 25;
pub const FPU_FPDSCR_DN_Msk: u32 = 33554432;
pub const FPU_FPDSCR_FZ_Pos: u32 = 24;
pub const FPU_FPDSCR_FZ_Msk: u32 = 16777216;
pub const FPU_FPDSCR_RMode_Pos: u32 = 22;
pub const FPU_FPDSCR_RMode_Msk: u32 = 12582912;
pub const FPU_MVFR0_FP_rounding_modes_Pos: u32 = 28;
pub const FPU_MVFR0_FP_rounding_modes_Msk: u32 = 4026531840;
pub const FPU_MVFR0_Short_vectors_Pos: u32 = 24;
pub const FPU_MVFR0_Short_vectors_Msk: u32 = 251658240;
pub const FPU_MVFR0_Square_root_Pos: u32 = 20;
pub const FPU_MVFR0_Square_root_Msk: u32 = 15728640;
pub const FPU_MVFR0_Divide_Pos: u32 = 16;
pub const FPU_MVFR0_Divide_Msk: u32 = 983040;
pub const FPU_MVFR0_FP_excep_trapping_Pos: u32 = 12;
pub const FPU_MVFR0_FP_excep_trapping_Msk: u32 = 61440;
pub const FPU_MVFR0_Double_precision_Pos: u32 = 8;
pub const FPU_MVFR0_Double_precision_Msk: u32 = 3840;
pub const FPU_MVFR0_Single_precision_Pos: u32 = 4;
pub const FPU_MVFR0_Single_precision_Msk: u32 = 240;
pub const FPU_MVFR0_A_SIMD_registers_Pos: u32 = 0;
pub const FPU_MVFR0_A_SIMD_registers_Msk: u32 = 15;
pub const FPU_MVFR1_FP_fused_MAC_Pos: u32 = 28;
pub const FPU_MVFR1_FP_fused_MAC_Msk: u32 = 4026531840;
pub const FPU_MVFR1_FP_HPFP_Pos: u32 = 24;
pub const FPU_MVFR1_FP_HPFP_Msk: u32 = 251658240;
pub const FPU_MVFR1_D_NaN_mode_Pos: u32 = 4;
pub const FPU_MVFR1_D_NaN_mode_Msk: u32 = 240;
pub const FPU_MVFR1_FtZ_mode_Pos: u32 = 0;
pub const FPU_MVFR1_FtZ_mode_Msk: u32 = 15;
#[doc = "\\brief  Structure type to access the Core Debug Register (CoreDebug)."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CoreDebug_Type {
    #[doc = "< Offset: 0x000 (R/W)  Debug Halting Control and Status Register"]
    pub DHCSR: u32,
    #[doc = "< Offset: 0x004 ( /W)  Debug Core Register Selector Register"]
    pub DCRSR: u32,
    #[doc = "< Offset: 0x008 (R/W)  Debug Core Register Data Register"]
    pub DCRDR: u32,
    #[doc = "< Offset: 0x00C (R/W)  Debug Exception and Monitor Control Register"]
    pub DEMCR: u32,
}
#[test]
fn bindgen_test_layout_CoreDebug_Type() {
    const UNINIT: ::std::mem::MaybeUninit<CoreDebug_Type> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<CoreDebug_Type>(),
        16usize,
        concat!("Size of: ", stringify!(CoreDebug_Type))
    );
    assert_eq!(
        ::std::mem::align_of::<CoreDebug_Type>(),
        4usize,
        concat!("Alignment of ", stringify!(CoreDebug_Type))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).DHCSR) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(CoreDebug_Type),
            "::",
            stringify!(DHCSR)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).DCRSR) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(CoreDebug_Type),
            "::",
            stringify!(DCRSR)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).DCRDR) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(CoreDebug_Type),
            "::",
            stringify!(DCRDR)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).DEMCR) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(CoreDebug_Type),
            "::",
            stringify!(DEMCR)
        )
    );
}
pub const CoreDebug_DHCSR_DBGKEY_Pos: u32 = 16;
pub const CoreDebug_DHCSR_DBGKEY_Msk: u32 = 4294901760;
pub const CoreDebug_DHCSR_S_RESET_ST_Pos: u32 = 25;
pub const CoreDebug_DHCSR_S_RESET_ST_Msk: u32 = 33554432;
pub const CoreDebug_DHCSR_S_RETIRE_ST_Pos: u32 = 24;
pub const CoreDebug_DHCSR_S_RETIRE_ST_Msk: u32 = 16777216;
pub const CoreDebug_DHCSR_S_LOCKUP_Pos: u32 = 19;
pub const CoreDebug_DHCSR_S_LOCKUP_Msk: u32 = 524288;
pub const CoreDebug_DHCSR_S_SLEEP_Pos: u32 = 18;
pub const CoreDebug_DHCSR_S_SLEEP_Msk: u32 = 262144;
pub const CoreDebug_DHCSR_S_HALT_Pos: u32 = 17;
pub const CoreDebug_DHCSR_S_HALT_Msk: u32 = 131072;
pub const CoreDebug_DHCSR_S_REGRDY_Pos: u32 = 16;
pub const CoreDebug_DHCSR_S_REGRDY_Msk: u32 = 65536;
pub const CoreDebug_DHCSR_C_SNAPSTALL_Pos: u32 = 5;
pub const CoreDebug_DHCSR_C_SNAPSTALL_Msk: u32 = 32;
pub const CoreDebug_DHCSR_C_MASKINTS_Pos: u32 = 3;
pub const CoreDebug_DHCSR_C_MASKINTS_Msk: u32 = 8;
pub const CoreDebug_DHCSR_C_STEP_Pos: u32 = 2;
pub const CoreDebug_DHCSR_C_STEP_Msk: u32 = 4;
pub const CoreDebug_DHCSR_C_HALT_Pos: u32 = 1;
pub const CoreDebug_DHCSR_C_HALT_Msk: u32 = 2;
pub const CoreDebug_DHCSR_C_DEBUGEN_Pos: u32 = 0;
pub const CoreDebug_DHCSR_C_DEBUGEN_Msk: u32 = 1;
pub const CoreDebug_DCRSR_REGWnR_Pos: u32 = 16;
pub const CoreDebug_DCRSR_REGWnR_Msk: u32 = 65536;
pub const CoreDebug_DCRSR_REGSEL_Pos: u32 = 0;
pub const CoreDebug_DCRSR_REGSEL_Msk: u32 = 31;
pub const CoreDebug_DEMCR_TRCENA_Pos: u32 = 24;
pub const CoreDebug_DEMCR_TRCENA_Msk: u32 = 16777216;
pub const CoreDebug_DEMCR_MON_REQ_Pos: u32 = 19;
pub const CoreDebug_DEMCR_MON_REQ_Msk: u32 = 524288;
pub const CoreDebug_DEMCR_MON_STEP_Pos: u32 = 18;
pub const CoreDebug_DEMCR_MON_STEP_Msk: u32 = 262144;
pub const CoreDebug_DEMCR_MON_PEND_Pos: u32 = 17;
pub const CoreDebug_DEMCR_MON_PEND_Msk: u32 = 131072;
pub const CoreDebug_DEMCR_MON_EN_Pos: u32 = 16;
pub const CoreDebug_DEMCR_MON_EN_Msk: u32 = 65536;
pub const CoreDebug_DEMCR_VC_HARDERR_Pos: u32 = 10;
pub const CoreDebug_DEMCR_VC_HARDERR_Msk: u32 = 1024;
pub const CoreDebug_DEMCR_VC_INTERR_Pos: u32 = 9;
pub const CoreDebug_DEMCR_VC_INTERR_Msk: u32 = 512;
pub const CoreDebug_DEMCR_VC_BUSERR_Pos: u32 = 8;
pub const CoreDebug_DEMCR_VC_BUSERR_Msk: u32 = 256;
pub const CoreDebug_DEMCR_VC_STATERR_Pos: u32 = 7;
pub const CoreDebug_DEMCR_VC_STATERR_Msk: u32 = 128;
pub const CoreDebug_DEMCR_VC_CHKERR_Pos: u32 = 6;
pub const CoreDebug_DEMCR_VC_CHKERR_Msk: u32 = 64;
pub const CoreDebug_DEMCR_VC_NOCPERR_Pos: u32 = 5;
pub const CoreDebug_DEMCR_VC_NOCPERR_Msk: u32 = 32;
pub const CoreDebug_DEMCR_VC_MMERR_Pos: u32 = 4;
pub const CoreDebug_DEMCR_VC_MMERR_Msk: u32 = 16;
pub const CoreDebug_DEMCR_VC_CORERESET_Pos: u32 = 0;
pub const CoreDebug_DEMCR_VC_CORERESET_Msk: u32 = 1;
pub const SCS_BASE: u32 = 3758153728;
pub const ITM_BASE: u32 = 3758096384;
pub const DWT_BASE: u32 = 3758100480;
pub const TPI_BASE: u32 = 3758358528;
pub const CoreDebug_BASE: u32 = 3758157296;
pub const SysTick_BASE: u32 = 3758153744;
pub const NVIC_BASE: u32 = 3758153984;
pub const SCB_BASE: u32 = 3758157056;
pub const FPU_BASE: u32 = 3758157616;
pub const NVIC_USER_IRQ_OFFSET: u32 = 16;
unsafe extern "C" {
    #[doc = "< External variable to receive characters."]
    pub static mut ITM_RxBuffer: i32;
}
pub const DISABLE_WDOG: u32 = 1;
pub const CPU_XTAL_CLK_HZ: u32 = 8000000;
pub const CPU_XTAL32k_CLK_HZ: u32 = 32768;
pub const CPU_INT_SLOW_CLK_HZ: u32 = 32768;
pub const CPU_INT_FAST_CLK_HZ: u32 = 4000000;
pub const SYSTEM_SMC_PMPROT_VALUE: u32 = 42;
pub const DEFAULT_SYSTEM_CLOCK: u32 = 20971520;
unsafe extern "C" {
    #[doc = " @brief System clock frequency (core clock)\n\n The system clock frequency supplied to the SysTick timer and the processor\n core clock. This variable can be used by the user application to setup the\n SysTick timer or configure other parameters. It may also be used by debugger to\n query the frequency of the debug timer or configure the trace clock speed\n SystemCoreClock is initialized with a correct predefined value."]
    pub static mut SystemCoreClock: u32;
}
#[doc = "< DMAMUX TriggerDisabled."]
pub const _dma_request_source_kDmaRequestMux0Disable: _dma_request_source = 256;
#[doc = "< Reserved1"]
pub const _dma_request_source_kDmaRequestMux0Reserved1: _dma_request_source = 257;
#[doc = "< UART0 Receive."]
pub const _dma_request_source_kDmaRequestMux0UART0Rx: _dma_request_source = 258;
#[doc = "< UART0 Transmit."]
pub const _dma_request_source_kDmaRequestMux0UART0Tx: _dma_request_source = 259;
#[doc = "< UART1 Receive."]
pub const _dma_request_source_kDmaRequestMux0UART1Rx: _dma_request_source = 260;
#[doc = "< UART1 Transmit."]
pub const _dma_request_source_kDmaRequestMux0UART1Tx: _dma_request_source = 261;
#[doc = "< UART2 Receive."]
pub const _dma_request_source_kDmaRequestMux0UART2Rx: _dma_request_source = 262;
#[doc = "< UART2 Transmit."]
pub const _dma_request_source_kDmaRequestMux0UART2Tx: _dma_request_source = 263;
#[doc = "< UART3 Receive."]
pub const _dma_request_source_kDmaRequestMux0UART3Rx: _dma_request_source = 264;
#[doc = "< UART3 Transmit."]
pub const _dma_request_source_kDmaRequestMux0UART3Tx: _dma_request_source = 265;
#[doc = "< UART4 Transmit or Receive."]
pub const _dma_request_source_kDmaRequestMux0UART4: _dma_request_source = 266;
#[doc = "< UART5 Transmit or Receive."]
pub const _dma_request_source_kDmaRequestMux0UART5: _dma_request_source = 267;
#[doc = "< I2S0 Receive."]
pub const _dma_request_source_kDmaRequestMux0I2S0Rx: _dma_request_source = 268;
#[doc = "< I2S0 Transmit."]
pub const _dma_request_source_kDmaRequestMux0I2S0Tx: _dma_request_source = 269;
#[doc = "< SPI0 Receive."]
pub const _dma_request_source_kDmaRequestMux0SPI0Rx: _dma_request_source = 270;
#[doc = "< SPI0 Transmit."]
pub const _dma_request_source_kDmaRequestMux0SPI0Tx: _dma_request_source = 271;
#[doc = "< SPI1 Transmit or Receive."]
pub const _dma_request_source_kDmaRequestMux0SPI1: _dma_request_source = 272;
#[doc = "< SPI2 Transmit or Receive."]
pub const _dma_request_source_kDmaRequestMux0SPI2: _dma_request_source = 273;
#[doc = "< I2C0."]
pub const _dma_request_source_kDmaRequestMux0I2C0: _dma_request_source = 274;
#[doc = "< I2C1 and I2C2."]
pub const _dma_request_source_kDmaRequestMux0I2C1I2C2: _dma_request_source = 275;
#[doc = "< I2C1 and I2C2."]
pub const _dma_request_source_kDmaRequestMux0I2C1: _dma_request_source = 275;
#[doc = "< I2C1 and I2C2."]
pub const _dma_request_source_kDmaRequestMux0I2C2: _dma_request_source = 275;
#[doc = "< FTM0 C0V."]
pub const _dma_request_source_kDmaRequestMux0FTM0Channel0: _dma_request_source = 276;
#[doc = "< FTM0 C1V."]
pub const _dma_request_source_kDmaRequestMux0FTM0Channel1: _dma_request_source = 277;
#[doc = "< FTM0 C2V."]
pub const _dma_request_source_kDmaRequestMux0FTM0Channel2: _dma_request_source = 278;
#[doc = "< FTM0 C3V."]
pub const _dma_request_source_kDmaRequestMux0FTM0Channel3: _dma_request_source = 279;
#[doc = "< FTM0 C4V."]
pub const _dma_request_source_kDmaRequestMux0FTM0Channel4: _dma_request_source = 280;
#[doc = "< FTM0 C5V."]
pub const _dma_request_source_kDmaRequestMux0FTM0Channel5: _dma_request_source = 281;
#[doc = "< FTM0 C6V."]
pub const _dma_request_source_kDmaRequestMux0FTM0Channel6: _dma_request_source = 282;
#[doc = "< FTM0 C7V."]
pub const _dma_request_source_kDmaRequestMux0FTM0Channel7: _dma_request_source = 283;
#[doc = "< FTM1 C0V."]
pub const _dma_request_source_kDmaRequestMux0FTM1Channel0: _dma_request_source = 284;
#[doc = "< FTM1 C1V."]
pub const _dma_request_source_kDmaRequestMux0FTM1Channel1: _dma_request_source = 285;
#[doc = "< FTM2 C0V."]
pub const _dma_request_source_kDmaRequestMux0FTM2Channel0: _dma_request_source = 286;
#[doc = "< FTM2 C1V."]
pub const _dma_request_source_kDmaRequestMux0FTM2Channel1: _dma_request_source = 287;
#[doc = "< FTM3 C0V."]
pub const _dma_request_source_kDmaRequestMux0FTM3Channel0: _dma_request_source = 288;
#[doc = "< FTM3 C1V."]
pub const _dma_request_source_kDmaRequestMux0FTM3Channel1: _dma_request_source = 289;
#[doc = "< FTM3 C2V."]
pub const _dma_request_source_kDmaRequestMux0FTM3Channel2: _dma_request_source = 290;
#[doc = "< FTM3 C3V."]
pub const _dma_request_source_kDmaRequestMux0FTM3Channel3: _dma_request_source = 291;
#[doc = "< FTM3 C4V."]
pub const _dma_request_source_kDmaRequestMux0FTM3Channel4: _dma_request_source = 292;
#[doc = "< FTM3 C5V."]
pub const _dma_request_source_kDmaRequestMux0FTM3Channel5: _dma_request_source = 293;
#[doc = "< FTM3 C6V."]
pub const _dma_request_source_kDmaRequestMux0FTM3Channel6: _dma_request_source = 294;
#[doc = "< FTM3 C7V."]
pub const _dma_request_source_kDmaRequestMux0FTM3Channel7: _dma_request_source = 295;
#[doc = "< ADC0."]
pub const _dma_request_source_kDmaRequestMux0ADC0: _dma_request_source = 296;
#[doc = "< ADC1."]
pub const _dma_request_source_kDmaRequestMux0ADC1: _dma_request_source = 297;
#[doc = "< CMP0."]
pub const _dma_request_source_kDmaRequestMux0CMP0: _dma_request_source = 298;
#[doc = "< CMP1."]
pub const _dma_request_source_kDmaRequestMux0CMP1: _dma_request_source = 299;
#[doc = "< CMP2."]
pub const _dma_request_source_kDmaRequestMux0CMP2: _dma_request_source = 300;
#[doc = "< DAC0."]
pub const _dma_request_source_kDmaRequestMux0DAC0: _dma_request_source = 301;
#[doc = "< DAC1."]
pub const _dma_request_source_kDmaRequestMux0DAC1: _dma_request_source = 302;
#[doc = "< CMT."]
pub const _dma_request_source_kDmaRequestMux0CMT: _dma_request_source = 303;
#[doc = "< PDB0."]
pub const _dma_request_source_kDmaRequestMux0PDB: _dma_request_source = 304;
#[doc = "< PTA."]
pub const _dma_request_source_kDmaRequestMux0PortA: _dma_request_source = 305;
#[doc = "< PTB."]
pub const _dma_request_source_kDmaRequestMux0PortB: _dma_request_source = 306;
#[doc = "< PTC."]
pub const _dma_request_source_kDmaRequestMux0PortC: _dma_request_source = 307;
#[doc = "< PTD."]
pub const _dma_request_source_kDmaRequestMux0PortD: _dma_request_source = 308;
#[doc = "< PTE."]
pub const _dma_request_source_kDmaRequestMux0PortE: _dma_request_source = 309;
#[doc = "< DMAMUX Always Enabled slot."]
pub const _dma_request_source_kDmaRequestMux0AlwaysOn54: _dma_request_source = 310;
#[doc = "< DMAMUX Always Enabled slot."]
pub const _dma_request_source_kDmaRequestMux0AlwaysOn55: _dma_request_source = 311;
#[doc = "< DMAMUX Always Enabled slot."]
pub const _dma_request_source_kDmaRequestMux0AlwaysOn56: _dma_request_source = 312;
#[doc = "< DMAMUX Always Enabled slot."]
pub const _dma_request_source_kDmaRequestMux0AlwaysOn57: _dma_request_source = 313;
#[doc = "< DMAMUX Always Enabled slot."]
pub const _dma_request_source_kDmaRequestMux0AlwaysOn58: _dma_request_source = 314;
#[doc = "< DMAMUX Always Enabled slot."]
pub const _dma_request_source_kDmaRequestMux0AlwaysOn59: _dma_request_source = 315;
#[doc = "< DMAMUX Always Enabled slot."]
pub const _dma_request_source_kDmaRequestMux0AlwaysOn60: _dma_request_source = 316;
#[doc = "< DMAMUX Always Enabled slot."]
pub const _dma_request_source_kDmaRequestMux0AlwaysOn61: _dma_request_source = 317;
#[doc = "< DMAMUX Always Enabled slot."]
pub const _dma_request_source_kDmaRequestMux0AlwaysOn62: _dma_request_source = 318;
#[doc = "< DMAMUX Always Enabled slot."]
pub const _dma_request_source_kDmaRequestMux0AlwaysOn63: _dma_request_source = 319;
#[doc = " @brief Structure for the DMA hardware request\n\n Defines the structure for the DMA hardware request collections. The user can configure the\n hardware request into DMAMUX to trigger the DMA transfer accordingly. The index\n of the hardware request varies according  to the to SoC."]
pub type _dma_request_source = ::std::os::raw::c_uint;
#[doc = " @brief Structure for the DMA hardware request\n\n Defines the structure for the DMA hardware request collections. The user can configure the\n hardware request into DMAMUX to trigger the DMA transfer accordingly. The index\n of the hardware request varies according  to the to SoC."]
pub use self::_dma_request_source as dma_request_source_t;
#[doc = " ADC - Register Layout Typedef"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ADC_Type {
    #[doc = "< ADC Status and Control Registers 1, array offset: 0x0, array step: 0x4"]
    pub SC1: [u32; 2usize],
    #[doc = "< ADC Configuration Register 1, offset: 0x8"]
    pub CFG1: u32,
    #[doc = "< ADC Configuration Register 2, offset: 0xC"]
    pub CFG2: u32,
    #[doc = "< ADC Data Result Register, array offset: 0x10, array step: 0x4"]
    pub R: [u32; 2usize],
    #[doc = "< Compare Value Registers, offset: 0x18"]
    pub CV1: u32,
    #[doc = "< Compare Value Registers, offset: 0x1C"]
    pub CV2: u32,
    #[doc = "< Status and Control Register 2, offset: 0x20"]
    pub SC2: u32,
    #[doc = "< Status and Control Register 3, offset: 0x24"]
    pub SC3: u32,
    #[doc = "< ADC Offset Correction Register, offset: 0x28"]
    pub OFS: u32,
    #[doc = "< ADC Plus-Side Gain Register, offset: 0x2C"]
    pub PG: u32,
    #[doc = "< ADC Minus-Side Gain Register, offset: 0x30"]
    pub MG: u32,
    #[doc = "< ADC Plus-Side General Calibration Value Register, offset: 0x34"]
    pub CLPD: u32,
    #[doc = "< ADC Plus-Side General Calibration Value Register, offset: 0x38"]
    pub CLPS: u32,
    #[doc = "< ADC Plus-Side General Calibration Value Register, offset: 0x3C"]
    pub CLP4: u32,
    #[doc = "< ADC Plus-Side General Calibration Value Register, offset: 0x40"]
    pub CLP3: u32,
    #[doc = "< ADC Plus-Side General Calibration Value Register, offset: 0x44"]
    pub CLP2: u32,
    #[doc = "< ADC Plus-Side General Calibration Value Register, offset: 0x48"]
    pub CLP1: u32,
    #[doc = "< ADC Plus-Side General Calibration Value Register, offset: 0x4C"]
    pub CLP0: u32,
    pub RESERVED_0: [u8; 4usize],
    #[doc = "< ADC Minus-Side General Calibration Value Register, offset: 0x54"]
    pub CLMD: u32,
    #[doc = "< ADC Minus-Side General Calibration Value Register, offset: 0x58"]
    pub CLMS: u32,
    #[doc = "< ADC Minus-Side General Calibration Value Register, offset: 0x5C"]
    pub CLM4: u32,
    #[doc = "< ADC Minus-Side General Calibration Value Register, offset: 0x60"]
    pub CLM3: u32,
    #[doc = "< ADC Minus-Side General Calibration Value Register, offset: 0x64"]
    pub CLM2: u32,
    #[doc = "< ADC Minus-Side General Calibration Value Register, offset: 0x68"]
    pub CLM1: u32,
    #[doc = "< ADC Minus-Side General Calibration Value Register, offset: 0x6C"]
    pub CLM0: u32,
}
#[test]
fn bindgen_test_layout_ADC_Type() {
    const UNINIT: ::std::mem::MaybeUninit<ADC_Type> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ADC_Type>(),
        112usize,
        concat!("Size of: ", stringify!(ADC_Type))
    );
    assert_eq!(
        ::std::mem::align_of::<ADC_Type>(),
        4usize,
        concat!("Alignment of ", stringify!(ADC_Type))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).SC1) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ADC_Type),
            "::",
            stringify!(SC1)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).CFG1) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ADC_Type),
            "::",
            stringify!(CFG1)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).CFG2) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(ADC_Type),
            "::",
            stringify!(CFG2)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).R) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(ADC_Type),
            "::",
            stringify!(R)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).CV1) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(ADC_Type),
            "::",
            stringify!(CV1)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).CV2) as usize - ptr as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(ADC_Type),
            "::",
            stringify!(CV2)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).SC2) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(ADC_Type),
            "::",
            stringify!(SC2)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).SC3) as usize - ptr as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(ADC_Type),
            "::",
            stringify!(SC3)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).OFS) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(ADC_Type),
            "::",
            stringify!(OFS)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).PG) as usize - ptr as usize },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(ADC_Type),
            "::",
            stringify!(PG)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).MG) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(ADC_Type),
            "::",
            stringify!(MG)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).CLPD) as usize - ptr as usize },
        52usize,
        concat!(
            "Offset of field: ",
            stringify!(ADC_Type),
            "::",
            stringify!(CLPD)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).CLPS) as usize - ptr as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(ADC_Type),
            "::",
            stringify!(CLPS)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).CLP4) as usize - ptr as usize },
        60usize,
        concat!(
            "Offset of field: ",
            stringify!(ADC_Type),
            "::",
            stringify!(CLP4)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).CLP3) as usize - ptr as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(ADC_Type),
            "::",
            stringify!(CLP3)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).CLP2) as usize - ptr as usize },
        68usize,
        concat!(
            "Offset of field: ",
            stringify!(ADC_Type),
            "::",
            stringify!(CLP2)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).CLP1) as usize - ptr as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(ADC_Type),
            "::",
            stringify!(CLP1)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).CLP0) as usize - ptr as usize },
        76usize,
        concat!(
            "Offset of field: ",
            stringify!(ADC_Type),
            "::",
            stringify!(CLP0)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).RESERVED_0) as usize - ptr as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(ADC_Type),
            "::",
            stringify!(RESERVED_0)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).CLMD) as usize - ptr as usize },
        84usize,
        concat!(
            "Offset of field: ",
            stringify!(ADC_Type),
            "::",
            stringify!(CLMD)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).CLMS) as usize - ptr as usize },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(ADC_Type),
            "::",
            stringify!(CLMS)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).CLM4) as usize - ptr as usize },
        92usize,
        concat!(
            "Offset of field: ",
            stringify!(ADC_Type),
            "::",
            stringify!(CLM4)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).CLM3) as usize - ptr as usize },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(ADC_Type),
            "::",
            stringify!(CLM3)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).CLM2) as usize - ptr as usize },
        100usize,
        concat!(
            "Offset of field: ",
            stringify!(ADC_Type),
            "::",
            stringify!(CLM2)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).CLM1) as usize - ptr as usize },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(ADC_Type),
            "::",
            stringify!(CLM1)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).CLM0) as usize - ptr as usize },
        108usize,
        concat!(
            "Offset of field: ",
            stringify!(ADC_Type),
            "::",
            stringify!(CLM0)
        )
    );
}
pub const ADC_SC1_ADCH_MASK: u32 = 31;
pub const ADC_SC1_ADCH_SHIFT: u32 = 0;
pub const ADC_SC1_DIFF_MASK: u32 = 32;
pub const ADC_SC1_DIFF_SHIFT: u32 = 5;
pub const ADC_SC1_AIEN_MASK: u32 = 64;
pub const ADC_SC1_AIEN_SHIFT: u32 = 6;
pub const ADC_SC1_COCO_MASK: u32 = 128;
pub const ADC_SC1_COCO_SHIFT: u32 = 7;
pub const ADC_SC1_COUNT: u32 = 2;
pub const ADC_CFG1_ADICLK_MASK: u32 = 3;
pub const ADC_CFG1_ADICLK_SHIFT: u32 = 0;
pub const ADC_CFG1_MODE_MASK: u32 = 12;
pub const ADC_CFG1_MODE_SHIFT: u32 = 2;
pub const ADC_CFG1_ADLSMP_MASK: u32 = 16;
pub const ADC_CFG1_ADLSMP_SHIFT: u32 = 4;
pub const ADC_CFG1_ADIV_MASK: u32 = 96;
pub const ADC_CFG1_ADIV_SHIFT: u32 = 5;
pub const ADC_CFG1_ADLPC_MASK: u32 = 128;
pub const ADC_CFG1_ADLPC_SHIFT: u32 = 7;
pub const ADC_CFG2_ADLSTS_MASK: u32 = 3;
pub const ADC_CFG2_ADLSTS_SHIFT: u32 = 0;
pub const ADC_CFG2_ADHSC_MASK: u32 = 4;
pub const ADC_CFG2_ADHSC_SHIFT: u32 = 2;
pub const ADC_CFG2_ADACKEN_MASK: u32 = 8;
pub const ADC_CFG2_ADACKEN_SHIFT: u32 = 3;
pub const ADC_CFG2_MUXSEL_MASK: u32 = 16;
pub const ADC_CFG2_MUXSEL_SHIFT: u32 = 4;
pub const ADC_R_D_MASK: u32 = 65535;
pub const ADC_R_D_SHIFT: u32 = 0;
pub const ADC_R_COUNT: u32 = 2;
pub const ADC_CV1_CV_MASK: u32 = 65535;
pub const ADC_CV1_CV_SHIFT: u32 = 0;
pub const ADC_CV2_CV_MASK: u32 = 65535;
pub const ADC_CV2_CV_SHIFT: u32 = 0;
pub const ADC_SC2_REFSEL_MASK: u32 = 3;
pub const ADC_SC2_REFSEL_SHIFT: u32 = 0;
pub const ADC_SC2_DMAEN_MASK: u32 = 4;
pub const ADC_SC2_DMAEN_SHIFT: u32 = 2;
pub const ADC_SC2_ACREN_MASK: u32 = 8;
pub const ADC_SC2_ACREN_SHIFT: u32 = 3;
pub const ADC_SC2_ACFGT_MASK: u32 = 16;
pub const ADC_SC2_ACFGT_SHIFT: u32 = 4;
pub const ADC_SC2_ACFE_MASK: u32 = 32;
pub const ADC_SC2_ACFE_SHIFT: u32 = 5;
pub const ADC_SC2_ADTRG_MASK: u32 = 64;
pub const ADC_SC2_ADTRG_SHIFT: u32 = 6;
pub const ADC_SC2_ADACT_MASK: u32 = 128;
pub const ADC_SC2_ADACT_SHIFT: u32 = 7;
pub const ADC_SC3_AVGS_MASK: u32 = 3;
pub const ADC_SC3_AVGS_SHIFT: u32 = 0;
pub const ADC_SC3_AVGE_MASK: u32 = 4;
pub const ADC_SC3_AVGE_SHIFT: u32 = 2;
pub const ADC_SC3_ADCO_MASK: u32 = 8;
pub const ADC_SC3_ADCO_SHIFT: u32 = 3;
pub const ADC_SC3_CALF_MASK: u32 = 64;
pub const ADC_SC3_CALF_SHIFT: u32 = 6;
pub const ADC_SC3_CAL_MASK: u32 = 128;
pub const ADC_SC3_CAL_SHIFT: u32 = 7;
pub const ADC_OFS_OFS_MASK: u32 = 65535;
pub const ADC_OFS_OFS_SHIFT: u32 = 0;
pub const ADC_PG_PG_MASK: u32 = 65535;
pub const ADC_PG_PG_SHIFT: u32 = 0;
pub const ADC_MG_MG_MASK: u32 = 65535;
pub const ADC_MG_MG_SHIFT: u32 = 0;
pub const ADC_CLPD_CLPD_MASK: u32 = 63;
pub const ADC_CLPD_CLPD_SHIFT: u32 = 0;
pub const ADC_CLPS_CLPS_MASK: u32 = 63;
pub const ADC_CLPS_CLPS_SHIFT: u32 = 0;
pub const ADC_CLP4_CLP4_MASK: u32 = 1023;
pub const ADC_CLP4_CLP4_SHIFT: u32 = 0;
pub const ADC_CLP3_CLP3_MASK: u32 = 511;
pub const ADC_CLP3_CLP3_SHIFT: u32 = 0;
pub const ADC_CLP2_CLP2_MASK: u32 = 255;
pub const ADC_CLP2_CLP2_SHIFT: u32 = 0;
pub const ADC_CLP1_CLP1_MASK: u32 = 127;
pub const ADC_CLP1_CLP1_SHIFT: u32 = 0;
pub const ADC_CLP0_CLP0_MASK: u32 = 63;
pub const ADC_CLP0_CLP0_SHIFT: u32 = 0;
pub const ADC_CLMD_CLMD_MASK: u32 = 63;
pub const ADC_CLMD_CLMD_SHIFT: u32 = 0;
pub const ADC_CLMS_CLMS_MASK: u32 = 63;
pub const ADC_CLMS_CLMS_SHIFT: u32 = 0;
pub const ADC_CLM4_CLM4_MASK: u32 = 1023;
pub const ADC_CLM4_CLM4_SHIFT: u32 = 0;
pub const ADC_CLM3_CLM3_MASK: u32 = 511;
pub const ADC_CLM3_CLM3_SHIFT: u32 = 0;
pub const ADC_CLM2_CLM2_MASK: u32 = 255;
pub const ADC_CLM2_CLM2_SHIFT: u32 = 0;
pub const ADC_CLM1_CLM1_MASK: u32 = 127;
pub const ADC_CLM1_CLM1_SHIFT: u32 = 0;
pub const ADC_CLM0_CLM0_MASK: u32 = 63;
pub const ADC_CLM0_CLM0_SHIFT: u32 = 0;
pub const ADC0_BASE: u32 = 1073983488;
pub const ADC1_BASE: u32 = 1074507776;
#[doc = " AIPS - Register Layout Typedef"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct AIPS_Type {
    #[doc = "< Master Privilege Register A, offset: 0x0"]
    pub MPRA: u32,
    pub RESERVED_0: [u8; 28usize],
    #[doc = "< Peripheral Access Control Register, offset: 0x20"]
    pub PACRA: u32,
    #[doc = "< Peripheral Access Control Register, offset: 0x24"]
    pub PACRB: u32,
    #[doc = "< Peripheral Access Control Register, offset: 0x28"]
    pub PACRC: u32,
    #[doc = "< Peripheral Access Control Register, offset: 0x2C"]
    pub PACRD: u32,
    pub RESERVED_1: [u8; 16usize],
    #[doc = "< Peripheral Access Control Register, offset: 0x40"]
    pub PACRE: u32,
    #[doc = "< Peripheral Access Control Register, offset: 0x44"]
    pub PACRF: u32,
    #[doc = "< Peripheral Access Control Register, offset: 0x48"]
    pub PACRG: u32,
    #[doc = "< Peripheral Access Control Register, offset: 0x4C"]
    pub PACRH: u32,
    #[doc = "< Peripheral Access Control Register, offset: 0x50"]
    pub PACRI: u32,
    #[doc = "< Peripheral Access Control Register, offset: 0x54"]
    pub PACRJ: u32,
    #[doc = "< Peripheral Access Control Register, offset: 0x58"]
    pub PACRK: u32,
    #[doc = "< Peripheral Access Control Register, offset: 0x5C"]
    pub PACRL: u32,
    #[doc = "< Peripheral Access Control Register, offset: 0x60"]
    pub PACRM: u32,
    #[doc = "< Peripheral Access Control Register, offset: 0x64"]
    pub PACRN: u32,
    #[doc = "< Peripheral Access Control Register, offset: 0x68"]
    pub PACRO: u32,
    #[doc = "< Peripheral Access Control Register, offset: 0x6C"]
    pub PACRP: u32,
}
#[test]
fn bindgen_test_layout_AIPS_Type() {
    const UNINIT: ::std::mem::MaybeUninit<AIPS_Type> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<AIPS_Type>(),
        112usize,
        concat!("Size of: ", stringify!(AIPS_Type))
    );
    assert_eq!(
        ::std::mem::align_of::<AIPS_Type>(),
        4usize,
        concat!("Alignment of ", stringify!(AIPS_Type))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).MPRA) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(AIPS_Type),
            "::",
            stringify!(MPRA)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).RESERVED_0) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(AIPS_Type),
            "::",
            stringify!(RESERVED_0)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).PACRA) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(AIPS_Type),
            "::",
            stringify!(PACRA)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).PACRB) as usize - ptr as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(AIPS_Type),
            "::",
            stringify!(PACRB)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).PACRC) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(AIPS_Type),
            "::",
            stringify!(PACRC)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).PACRD) as usize - ptr as usize },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(AIPS_Type),
            "::",
            stringify!(PACRD)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).RESERVED_1) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(AIPS_Type),
            "::",
            stringify!(RESERVED_1)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).PACRE) as usize - ptr as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(AIPS_Type),
            "::",
            stringify!(PACRE)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).PACRF) as usize - ptr as usize },
        68usize,
        concat!(
            "Offset of field: ",
            stringify!(AIPS_Type),
            "::",
            stringify!(PACRF)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).PACRG) as usize - ptr as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(AIPS_Type),
            "::",
            stringify!(PACRG)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).PACRH) as usize - ptr as usize },
        76usize,
        concat!(
            "Offset of field: ",
            stringify!(AIPS_Type),
            "::",
            stringify!(PACRH)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).PACRI) as usize - ptr as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(AIPS_Type),
            "::",
            stringify!(PACRI)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).PACRJ) as usize - ptr as usize },
        84usize,
        concat!(
            "Offset of field: ",
            stringify!(AIPS_Type),
            "::",
            stringify!(PACRJ)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).PACRK) as usize - ptr as usize },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(AIPS_Type),
            "::",
            stringify!(PACRK)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).PACRL) as usize - ptr as usize },
        92usize,
        concat!(
            "Offset of field: ",
            stringify!(AIPS_Type),
            "::",
            stringify!(PACRL)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).PACRM) as usize - ptr as usize },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(AIPS_Type),
            "::",
            stringify!(PACRM)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).PACRN) as usize - ptr as usize },
        100usize,
        concat!(
            "Offset of field: ",
            stringify!(AIPS_Type),
            "::",
            stringify!(PACRN)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).PACRO) as usize - ptr as usize },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(AIPS_Type),
            "::",
            stringify!(PACRO)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).PACRP) as usize - ptr as usize },
        108usize,
        concat!(
            "Offset of field: ",
            stringify!(AIPS_Type),
            "::",
            stringify!(PACRP)
        )
    );
}
pub const AIPS_PACRA_TP7_MASK: u32 = 1;
pub const AIPS_PACRA_TP7_SHIFT: u32 = 0;
pub const AIPS_PACRA_WP7_MASK: u32 = 2;
pub const AIPS_PACRA_WP7_SHIFT: u32 = 1;
pub const AIPS_PACRA_SP7_MASK: u32 = 4;
pub const AIPS_PACRA_SP7_SHIFT: u32 = 2;
pub const AIPS_PACRA_TP6_MASK: u32 = 16;
pub const AIPS_PACRA_TP6_SHIFT: u32 = 4;
pub const AIPS_PACRA_WP6_MASK: u32 = 32;
pub const AIPS_PACRA_WP6_SHIFT: u32 = 5;
pub const AIPS_PACRA_SP6_MASK: u32 = 64;
pub const AIPS_PACRA_SP6_SHIFT: u32 = 6;
pub const AIPS_PACRA_TP5_MASK: u32 = 256;
pub const AIPS_PACRA_TP5_SHIFT: u32 = 8;
pub const AIPS_PACRA_WP5_MASK: u32 = 512;
pub const AIPS_PACRA_WP5_SHIFT: u32 = 9;
pub const AIPS_PACRA_SP5_MASK: u32 = 1024;
pub const AIPS_PACRA_SP5_SHIFT: u32 = 10;
pub const AIPS_PACRA_TP4_MASK: u32 = 4096;
pub const AIPS_PACRA_TP4_SHIFT: u32 = 12;
pub const AIPS_PACRA_WP4_MASK: u32 = 8192;
pub const AIPS_PACRA_WP4_SHIFT: u32 = 13;
pub const AIPS_PACRA_SP4_MASK: u32 = 16384;
pub const AIPS_PACRA_SP4_SHIFT: u32 = 14;
pub const AIPS_PACRA_TP3_MASK: u32 = 65536;
pub const AIPS_PACRA_TP3_SHIFT: u32 = 16;
pub const AIPS_PACRA_WP3_MASK: u32 = 131072;
pub const AIPS_PACRA_WP3_SHIFT: u32 = 17;
pub const AIPS_PACRA_SP3_MASK: u32 = 262144;
pub const AIPS_PACRA_SP3_SHIFT: u32 = 18;
pub const AIPS_PACRA_TP2_MASK: u32 = 1048576;
pub const AIPS_PACRA_TP2_SHIFT: u32 = 20;
pub const AIPS_PACRA_WP2_MASK: u32 = 2097152;
pub const AIPS_PACRA_WP2_SHIFT: u32 = 21;
pub const AIPS_PACRA_SP2_MASK: u32 = 4194304;
pub const AIPS_PACRA_SP2_SHIFT: u32 = 22;
pub const AIPS_PACRA_TP1_MASK: u32 = 16777216;
pub const AIPS_PACRA_TP1_SHIFT: u32 = 24;
pub const AIPS_PACRA_WP1_MASK: u32 = 33554432;
pub const AIPS_PACRA_WP1_SHIFT: u32 = 25;
pub const AIPS_PACRA_SP1_MASK: u32 = 67108864;
pub const AIPS_PACRA_SP1_SHIFT: u32 = 26;
pub const AIPS_PACRA_TP0_MASK: u32 = 268435456;
pub const AIPS_PACRA_TP0_SHIFT: u32 = 28;
pub const AIPS_PACRA_WP0_MASK: u32 = 536870912;
pub const AIPS_PACRA_WP0_SHIFT: u32 = 29;
pub const AIPS_PACRA_SP0_MASK: u32 = 1073741824;
pub const AIPS_PACRA_SP0_SHIFT: u32 = 30;
pub const AIPS_PACRB_TP7_MASK: u32 = 1;
pub const AIPS_PACRB_TP7_SHIFT: u32 = 0;
pub const AIPS_PACRB_WP7_MASK: u32 = 2;
pub const AIPS_PACRB_WP7_SHIFT: u32 = 1;
pub const AIPS_PACRB_SP7_MASK: u32 = 4;
pub const AIPS_PACRB_SP7_SHIFT: u32 = 2;
pub const AIPS_PACRB_TP6_MASK: u32 = 16;
pub const AIPS_PACRB_TP6_SHIFT: u32 = 4;
pub const AIPS_PACRB_WP6_MASK: u32 = 32;
pub const AIPS_PACRB_WP6_SHIFT: u32 = 5;
pub const AIPS_PACRB_SP6_MASK: u32 = 64;
pub const AIPS_PACRB_SP6_SHIFT: u32 = 6;
pub const AIPS_PACRB_TP5_MASK: u32 = 256;
pub const AIPS_PACRB_TP5_SHIFT: u32 = 8;
pub const AIPS_PACRB_WP5_MASK: u32 = 512;
pub const AIPS_PACRB_WP5_SHIFT: u32 = 9;
pub const AIPS_PACRB_SP5_MASK: u32 = 1024;
pub const AIPS_PACRB_SP5_SHIFT: u32 = 10;
pub const AIPS_PACRB_TP4_MASK: u32 = 4096;
pub const AIPS_PACRB_TP4_SHIFT: u32 = 12;
pub const AIPS_PACRB_WP4_MASK: u32 = 8192;
pub const AIPS_PACRB_WP4_SHIFT: u32 = 13;
pub const AIPS_PACRB_SP4_MASK: u32 = 16384;
pub const AIPS_PACRB_SP4_SHIFT: u32 = 14;
pub const AIPS_PACRB_TP3_MASK: u32 = 65536;
pub const AIPS_PACRB_TP3_SHIFT: u32 = 16;
pub const AIPS_PACRB_WP3_MASK: u32 = 131072;
pub const AIPS_PACRB_WP3_SHIFT: u32 = 17;
pub const AIPS_PACRB_SP3_MASK: u32 = 262144;
pub const AIPS_PACRB_SP3_SHIFT: u32 = 18;
pub const AIPS_PACRB_TP2_MASK: u32 = 1048576;
pub const AIPS_PACRB_TP2_SHIFT: u32 = 20;
pub const AIPS_PACRB_WP2_MASK: u32 = 2097152;
pub const AIPS_PACRB_WP2_SHIFT: u32 = 21;
pub const AIPS_PACRB_SP2_MASK: u32 = 4194304;
pub const AIPS_PACRB_SP2_SHIFT: u32 = 22;
pub const AIPS_PACRB_TP1_MASK: u32 = 16777216;
pub const AIPS_PACRB_TP1_SHIFT: u32 = 24;
pub const AIPS_PACRB_WP1_MASK: u32 = 33554432;
pub const AIPS_PACRB_WP1_SHIFT: u32 = 25;
pub const AIPS_PACRB_SP1_MASK: u32 = 67108864;
pub const AIPS_PACRB_SP1_SHIFT: u32 = 26;
pub const AIPS_PACRB_TP0_MASK: u32 = 268435456;
pub const AIPS_PACRB_TP0_SHIFT: u32 = 28;
pub const AIPS_PACRB_WP0_MASK: u32 = 536870912;
pub const AIPS_PACRB_WP0_SHIFT: u32 = 29;
pub const AIPS_PACRB_SP0_MASK: u32 = 1073741824;
pub const AIPS_PACRB_SP0_SHIFT: u32 = 30;
pub const AIPS_PACRC_TP7_MASK: u32 = 1;
pub const AIPS_PACRC_TP7_SHIFT: u32 = 0;
pub const AIPS_PACRC_WP7_MASK: u32 = 2;
pub const AIPS_PACRC_WP7_SHIFT: u32 = 1;
pub const AIPS_PACRC_SP7_MASK: u32 = 4;
pub const AIPS_PACRC_SP7_SHIFT: u32 = 2;
pub const AIPS_PACRC_TP6_MASK: u32 = 16;
pub const AIPS_PACRC_TP6_SHIFT: u32 = 4;
pub const AIPS_PACRC_WP6_MASK: u32 = 32;
pub const AIPS_PACRC_WP6_SHIFT: u32 = 5;
pub const AIPS_PACRC_SP6_MASK: u32 = 64;
pub const AIPS_PACRC_SP6_SHIFT: u32 = 6;
pub const AIPS_PACRC_TP5_MASK: u32 = 256;
pub const AIPS_PACRC_TP5_SHIFT: u32 = 8;
pub const AIPS_PACRC_WP5_MASK: u32 = 512;
pub const AIPS_PACRC_WP5_SHIFT: u32 = 9;
pub const AIPS_PACRC_SP5_MASK: u32 = 1024;
pub const AIPS_PACRC_SP5_SHIFT: u32 = 10;
pub const AIPS_PACRC_TP4_MASK: u32 = 4096;
pub const AIPS_PACRC_TP4_SHIFT: u32 = 12;
pub const AIPS_PACRC_WP4_MASK: u32 = 8192;
pub const AIPS_PACRC_WP4_SHIFT: u32 = 13;
pub const AIPS_PACRC_SP4_MASK: u32 = 16384;
pub const AIPS_PACRC_SP4_SHIFT: u32 = 14;
pub const AIPS_PACRC_TP3_MASK: u32 = 65536;
pub const AIPS_PACRC_TP3_SHIFT: u32 = 16;
pub const AIPS_PACRC_WP3_MASK: u32 = 131072;
pub const AIPS_PACRC_WP3_SHIFT: u32 = 17;
pub const AIPS_PACRC_SP3_MASK: u32 = 262144;
pub const AIPS_PACRC_SP3_SHIFT: u32 = 18;
pub const AIPS_PACRC_TP2_MASK: u32 = 1048576;
pub const AIPS_PACRC_TP2_SHIFT: u32 = 20;
pub const AIPS_PACRC_WP2_MASK: u32 = 2097152;
pub const AIPS_PACRC_WP2_SHIFT: u32 = 21;
pub const AIPS_PACRC_SP2_MASK: u32 = 4194304;
pub const AIPS_PACRC_SP2_SHIFT: u32 = 22;
pub const AIPS_PACRC_TP1_MASK: u32 = 16777216;
pub const AIPS_PACRC_TP1_SHIFT: u32 = 24;
pub const AIPS_PACRC_WP1_MASK: u32 = 33554432;
pub const AIPS_PACRC_WP1_SHIFT: u32 = 25;
pub const AIPS_PACRC_SP1_MASK: u32 = 67108864;
pub const AIPS_PACRC_SP1_SHIFT: u32 = 26;
pub const AIPS_PACRC_TP0_MASK: u32 = 268435456;
pub const AIPS_PACRC_TP0_SHIFT: u32 = 28;
pub const AIPS_PACRC_WP0_MASK: u32 = 536870912;
pub const AIPS_PACRC_WP0_SHIFT: u32 = 29;
pub const AIPS_PACRC_SP0_MASK: u32 = 1073741824;
pub const AIPS_PACRC_SP0_SHIFT: u32 = 30;
pub const AIPS_PACRD_TP7_MASK: u32 = 1;
pub const AIPS_PACRD_TP7_SHIFT: u32 = 0;
pub const AIPS_PACRD_WP7_MASK: u32 = 2;
pub const AIPS_PACRD_WP7_SHIFT: u32 = 1;
pub const AIPS_PACRD_SP7_MASK: u32 = 4;
pub const AIPS_PACRD_SP7_SHIFT: u32 = 2;
pub const AIPS_PACRD_TP6_MASK: u32 = 16;
pub const AIPS_PACRD_TP6_SHIFT: u32 = 4;
pub const AIPS_PACRD_WP6_MASK: u32 = 32;
pub const AIPS_PACRD_WP6_SHIFT: u32 = 5;
pub const AIPS_PACRD_SP6_MASK: u32 = 64;
pub const AIPS_PACRD_SP6_SHIFT: u32 = 6;
pub const AIPS_PACRD_TP5_MASK: u32 = 256;
pub const AIPS_PACRD_TP5_SHIFT: u32 = 8;
pub const AIPS_PACRD_WP5_MASK: u32 = 512;
pub const AIPS_PACRD_WP5_SHIFT: u32 = 9;
pub const AIPS_PACRD_SP5_MASK: u32 = 1024;
pub const AIPS_PACRD_SP5_SHIFT: u32 = 10;
pub const AIPS_PACRD_TP4_MASK: u32 = 4096;
pub const AIPS_PACRD_TP4_SHIFT: u32 = 12;
pub const AIPS_PACRD_WP4_MASK: u32 = 8192;
pub const AIPS_PACRD_WP4_SHIFT: u32 = 13;
pub const AIPS_PACRD_SP4_MASK: u32 = 16384;
pub const AIPS_PACRD_SP4_SHIFT: u32 = 14;
pub const AIPS_PACRD_TP3_MASK: u32 = 65536;
pub const AIPS_PACRD_TP3_SHIFT: u32 = 16;
pub const AIPS_PACRD_WP3_MASK: u32 = 131072;
pub const AIPS_PACRD_WP3_SHIFT: u32 = 17;
pub const AIPS_PACRD_SP3_MASK: u32 = 262144;
pub const AIPS_PACRD_SP3_SHIFT: u32 = 18;
pub const AIPS_PACRD_TP2_MASK: u32 = 1048576;
pub const AIPS_PACRD_TP2_SHIFT: u32 = 20;
pub const AIPS_PACRD_WP2_MASK: u32 = 2097152;
pub const AIPS_PACRD_WP2_SHIFT: u32 = 21;
pub const AIPS_PACRD_SP2_MASK: u32 = 4194304;
pub const AIPS_PACRD_SP2_SHIFT: u32 = 22;
pub const AIPS_PACRD_TP1_MASK: u32 = 16777216;
pub const AIPS_PACRD_TP1_SHIFT: u32 = 24;
pub const AIPS_PACRD_WP1_MASK: u32 = 33554432;
pub const AIPS_PACRD_WP1_SHIFT: u32 = 25;
pub const AIPS_PACRD_SP1_MASK: u32 = 67108864;
pub const AIPS_PACRD_SP1_SHIFT: u32 = 26;
pub const AIPS_PACRD_TP0_MASK: u32 = 268435456;
pub const AIPS_PACRD_TP0_SHIFT: u32 = 28;
pub const AIPS_PACRD_WP0_MASK: u32 = 536870912;
pub const AIPS_PACRD_WP0_SHIFT: u32 = 29;
pub const AIPS_PACRD_SP0_MASK: u32 = 1073741824;
pub const AIPS_PACRD_SP0_SHIFT: u32 = 30;
pub const AIPS_PACRE_TP7_MASK: u32 = 1;
pub const AIPS_PACRE_TP7_SHIFT: u32 = 0;
pub const AIPS_PACRE_WP7_MASK: u32 = 2;
pub const AIPS_PACRE_WP7_SHIFT: u32 = 1;
pub const AIPS_PACRE_SP7_MASK: u32 = 4;
pub const AIPS_PACRE_SP7_SHIFT: u32 = 2;
pub const AIPS_PACRE_TP6_MASK: u32 = 16;
pub const AIPS_PACRE_TP6_SHIFT: u32 = 4;
pub const AIPS_PACRE_WP6_MASK: u32 = 32;
pub const AIPS_PACRE_WP6_SHIFT: u32 = 5;
pub const AIPS_PACRE_SP6_MASK: u32 = 64;
pub const AIPS_PACRE_SP6_SHIFT: u32 = 6;
pub const AIPS_PACRE_TP5_MASK: u32 = 256;
pub const AIPS_PACRE_TP5_SHIFT: u32 = 8;
pub const AIPS_PACRE_WP5_MASK: u32 = 512;
pub const AIPS_PACRE_WP5_SHIFT: u32 = 9;
pub const AIPS_PACRE_SP5_MASK: u32 = 1024;
pub const AIPS_PACRE_SP5_SHIFT: u32 = 10;
pub const AIPS_PACRE_TP4_MASK: u32 = 4096;
pub const AIPS_PACRE_TP4_SHIFT: u32 = 12;
pub const AIPS_PACRE_WP4_MASK: u32 = 8192;
pub const AIPS_PACRE_WP4_SHIFT: u32 = 13;
pub const AIPS_PACRE_SP4_MASK: u32 = 16384;
pub const AIPS_PACRE_SP4_SHIFT: u32 = 14;
pub const AIPS_PACRE_TP3_MASK: u32 = 65536;
pub const AIPS_PACRE_TP3_SHIFT: u32 = 16;
pub const AIPS_PACRE_WP3_MASK: u32 = 131072;
pub const AIPS_PACRE_WP3_SHIFT: u32 = 17;
pub const AIPS_PACRE_SP3_MASK: u32 = 262144;
pub const AIPS_PACRE_SP3_SHIFT: u32 = 18;
pub const AIPS_PACRE_TP2_MASK: u32 = 1048576;
pub const AIPS_PACRE_TP2_SHIFT: u32 = 20;
pub const AIPS_PACRE_WP2_MASK: u32 = 2097152;
pub const AIPS_PACRE_WP2_SHIFT: u32 = 21;
pub const AIPS_PACRE_SP2_MASK: u32 = 4194304;
pub const AIPS_PACRE_SP2_SHIFT: u32 = 22;
pub const AIPS_PACRE_TP1_MASK: u32 = 16777216;
pub const AIPS_PACRE_TP1_SHIFT: u32 = 24;
pub const AIPS_PACRE_WP1_MASK: u32 = 33554432;
pub const AIPS_PACRE_WP1_SHIFT: u32 = 25;
pub const AIPS_PACRE_SP1_MASK: u32 = 67108864;
pub const AIPS_PACRE_SP1_SHIFT: u32 = 26;
pub const AIPS_PACRE_TP0_MASK: u32 = 268435456;
pub const AIPS_PACRE_TP0_SHIFT: u32 = 28;
pub const AIPS_PACRE_WP0_MASK: u32 = 536870912;
pub const AIPS_PACRE_WP0_SHIFT: u32 = 29;
pub const AIPS_PACRE_SP0_MASK: u32 = 1073741824;
pub const AIPS_PACRE_SP0_SHIFT: u32 = 30;
pub const AIPS_PACRF_TP7_MASK: u32 = 1;
pub const AIPS_PACRF_TP7_SHIFT: u32 = 0;
pub const AIPS_PACRF_WP7_MASK: u32 = 2;
pub const AIPS_PACRF_WP7_SHIFT: u32 = 1;
pub const AIPS_PACRF_SP7_MASK: u32 = 4;
pub const AIPS_PACRF_SP7_SHIFT: u32 = 2;
pub const AIPS_PACRF_TP6_MASK: u32 = 16;
pub const AIPS_PACRF_TP6_SHIFT: u32 = 4;
pub const AIPS_PACRF_WP6_MASK: u32 = 32;
pub const AIPS_PACRF_WP6_SHIFT: u32 = 5;
pub const AIPS_PACRF_SP6_MASK: u32 = 64;
pub const AIPS_PACRF_SP6_SHIFT: u32 = 6;
pub const AIPS_PACRF_TP5_MASK: u32 = 256;
pub const AIPS_PACRF_TP5_SHIFT: u32 = 8;
pub const AIPS_PACRF_WP5_MASK: u32 = 512;
pub const AIPS_PACRF_WP5_SHIFT: u32 = 9;
pub const AIPS_PACRF_SP5_MASK: u32 = 1024;
pub const AIPS_PACRF_SP5_SHIFT: u32 = 10;
pub const AIPS_PACRF_TP4_MASK: u32 = 4096;
pub const AIPS_PACRF_TP4_SHIFT: u32 = 12;
pub const AIPS_PACRF_WP4_MASK: u32 = 8192;
pub const AIPS_PACRF_WP4_SHIFT: u32 = 13;
pub const AIPS_PACRF_SP4_MASK: u32 = 16384;
pub const AIPS_PACRF_SP4_SHIFT: u32 = 14;
pub const AIPS_PACRF_TP3_MASK: u32 = 65536;
pub const AIPS_PACRF_TP3_SHIFT: u32 = 16;
pub const AIPS_PACRF_WP3_MASK: u32 = 131072;
pub const AIPS_PACRF_WP3_SHIFT: u32 = 17;
pub const AIPS_PACRF_SP3_MASK: u32 = 262144;
pub const AIPS_PACRF_SP3_SHIFT: u32 = 18;
pub const AIPS_PACRF_TP2_MASK: u32 = 1048576;
pub const AIPS_PACRF_TP2_SHIFT: u32 = 20;
pub const AIPS_PACRF_WP2_MASK: u32 = 2097152;
pub const AIPS_PACRF_WP2_SHIFT: u32 = 21;
pub const AIPS_PACRF_SP2_MASK: u32 = 4194304;
pub const AIPS_PACRF_SP2_SHIFT: u32 = 22;
pub const AIPS_PACRF_TP1_MASK: u32 = 16777216;
pub const AIPS_PACRF_TP1_SHIFT: u32 = 24;
pub const AIPS_PACRF_WP1_MASK: u32 = 33554432;
pub const AIPS_PACRF_WP1_SHIFT: u32 = 25;
pub const AIPS_PACRF_SP1_MASK: u32 = 67108864;
pub const AIPS_PACRF_SP1_SHIFT: u32 = 26;
pub const AIPS_PACRF_TP0_MASK: u32 = 268435456;
pub const AIPS_PACRF_TP0_SHIFT: u32 = 28;
pub const AIPS_PACRF_WP0_MASK: u32 = 536870912;
pub const AIPS_PACRF_WP0_SHIFT: u32 = 29;
pub const AIPS_PACRF_SP0_MASK: u32 = 1073741824;
pub const AIPS_PACRF_SP0_SHIFT: u32 = 30;
pub const AIPS_PACRG_TP7_MASK: u32 = 1;
pub const AIPS_PACRG_TP7_SHIFT: u32 = 0;
pub const AIPS_PACRG_WP7_MASK: u32 = 2;
pub const AIPS_PACRG_WP7_SHIFT: u32 = 1;
pub const AIPS_PACRG_SP7_MASK: u32 = 4;
pub const AIPS_PACRG_SP7_SHIFT: u32 = 2;
pub const AIPS_PACRG_TP6_MASK: u32 = 16;
pub const AIPS_PACRG_TP6_SHIFT: u32 = 4;
pub const AIPS_PACRG_WP6_MASK: u32 = 32;
pub const AIPS_PACRG_WP6_SHIFT: u32 = 5;
pub const AIPS_PACRG_SP6_MASK: u32 = 64;
pub const AIPS_PACRG_SP6_SHIFT: u32 = 6;
pub const AIPS_PACRG_TP5_MASK: u32 = 256;
pub const AIPS_PACRG_TP5_SHIFT: u32 = 8;
pub const AIPS_PACRG_WP5_MASK: u32 = 512;
pub const AIPS_PACRG_WP5_SHIFT: u32 = 9;
pub const AIPS_PACRG_SP5_MASK: u32 = 1024;
pub const AIPS_PACRG_SP5_SHIFT: u32 = 10;
pub const AIPS_PACRG_TP4_MASK: u32 = 4096;
pub const AIPS_PACRG_TP4_SHIFT: u32 = 12;
pub const AIPS_PACRG_WP4_MASK: u32 = 8192;
pub const AIPS_PACRG_WP4_SHIFT: u32 = 13;
pub const AIPS_PACRG_SP4_MASK: u32 = 16384;
pub const AIPS_PACRG_SP4_SHIFT: u32 = 14;
pub const AIPS_PACRG_TP3_MASK: u32 = 65536;
pub const AIPS_PACRG_TP3_SHIFT: u32 = 16;
pub const AIPS_PACRG_WP3_MASK: u32 = 131072;
pub const AIPS_PACRG_WP3_SHIFT: u32 = 17;
pub const AIPS_PACRG_SP3_MASK: u32 = 262144;
pub const AIPS_PACRG_SP3_SHIFT: u32 = 18;
pub const AIPS_PACRG_TP2_MASK: u32 = 1048576;
pub const AIPS_PACRG_TP2_SHIFT: u32 = 20;
pub const AIPS_PACRG_WP2_MASK: u32 = 2097152;
pub const AIPS_PACRG_WP2_SHIFT: u32 = 21;
pub const AIPS_PACRG_SP2_MASK: u32 = 4194304;
pub const AIPS_PACRG_SP2_SHIFT: u32 = 22;
pub const AIPS_PACRG_TP1_MASK: u32 = 16777216;
pub const AIPS_PACRG_TP1_SHIFT: u32 = 24;
pub const AIPS_PACRG_WP1_MASK: u32 = 33554432;
pub const AIPS_PACRG_WP1_SHIFT: u32 = 25;
pub const AIPS_PACRG_SP1_MASK: u32 = 67108864;
pub const AIPS_PACRG_SP1_SHIFT: u32 = 26;
pub const AIPS_PACRG_TP0_MASK: u32 = 268435456;
pub const AIPS_PACRG_TP0_SHIFT: u32 = 28;
pub const AIPS_PACRG_WP0_MASK: u32 = 536870912;
pub const AIPS_PACRG_WP0_SHIFT: u32 = 29;
pub const AIPS_PACRG_SP0_MASK: u32 = 1073741824;
pub const AIPS_PACRG_SP0_SHIFT: u32 = 30;
pub const AIPS_PACRH_TP7_MASK: u32 = 1;
pub const AIPS_PACRH_TP7_SHIFT: u32 = 0;
pub const AIPS_PACRH_WP7_MASK: u32 = 2;
pub const AIPS_PACRH_WP7_SHIFT: u32 = 1;
pub const AIPS_PACRH_SP7_MASK: u32 = 4;
pub const AIPS_PACRH_SP7_SHIFT: u32 = 2;
pub const AIPS_PACRH_TP6_MASK: u32 = 16;
pub const AIPS_PACRH_TP6_SHIFT: u32 = 4;
pub const AIPS_PACRH_WP6_MASK: u32 = 32;
pub const AIPS_PACRH_WP6_SHIFT: u32 = 5;
pub const AIPS_PACRH_SP6_MASK: u32 = 64;
pub const AIPS_PACRH_SP6_SHIFT: u32 = 6;
pub const AIPS_PACRH_TP5_MASK: u32 = 256;
pub const AIPS_PACRH_TP5_SHIFT: u32 = 8;
pub const AIPS_PACRH_WP5_MASK: u32 = 512;
pub const AIPS_PACRH_WP5_SHIFT: u32 = 9;
pub const AIPS_PACRH_SP5_MASK: u32 = 1024;
pub const AIPS_PACRH_SP5_SHIFT: u32 = 10;
pub const AIPS_PACRH_TP4_MASK: u32 = 4096;
pub const AIPS_PACRH_TP4_SHIFT: u32 = 12;
pub const AIPS_PACRH_WP4_MASK: u32 = 8192;
pub const AIPS_PACRH_WP4_SHIFT: u32 = 13;
pub const AIPS_PACRH_SP4_MASK: u32 = 16384;
pub const AIPS_PACRH_SP4_SHIFT: u32 = 14;
pub const AIPS_PACRH_TP3_MASK: u32 = 65536;
pub const AIPS_PACRH_TP3_SHIFT: u32 = 16;
pub const AIPS_PACRH_WP3_MASK: u32 = 131072;
pub const AIPS_PACRH_WP3_SHIFT: u32 = 17;
pub const AIPS_PACRH_SP3_MASK: u32 = 262144;
pub const AIPS_PACRH_SP3_SHIFT: u32 = 18;
pub const AIPS_PACRH_TP2_MASK: u32 = 1048576;
pub const AIPS_PACRH_TP2_SHIFT: u32 = 20;
pub const AIPS_PACRH_WP2_MASK: u32 = 2097152;
pub const AIPS_PACRH_WP2_SHIFT: u32 = 21;
pub const AIPS_PACRH_SP2_MASK: u32 = 4194304;
pub const AIPS_PACRH_SP2_SHIFT: u32 = 22;
pub const AIPS_PACRH_TP1_MASK: u32 = 16777216;
pub const AIPS_PACRH_TP1_SHIFT: u32 = 24;
pub const AIPS_PACRH_WP1_MASK: u32 = 33554432;
pub const AIPS_PACRH_WP1_SHIFT: u32 = 25;
pub const AIPS_PACRH_SP1_MASK: u32 = 67108864;
pub const AIPS_PACRH_SP1_SHIFT: u32 = 26;
pub const AIPS_PACRH_TP0_MASK: u32 = 268435456;
pub const AIPS_PACRH_TP0_SHIFT: u32 = 28;
pub const AIPS_PACRH_WP0_MASK: u32 = 536870912;
pub const AIPS_PACRH_WP0_SHIFT: u32 = 29;
pub const AIPS_PACRH_SP0_MASK: u32 = 1073741824;
pub const AIPS_PACRH_SP0_SHIFT: u32 = 30;
pub const AIPS_PACRI_TP7_MASK: u32 = 1;
pub const AIPS_PACRI_TP7_SHIFT: u32 = 0;
pub const AIPS_PACRI_WP7_MASK: u32 = 2;
pub const AIPS_PACRI_WP7_SHIFT: u32 = 1;
pub const AIPS_PACRI_SP7_MASK: u32 = 4;
pub const AIPS_PACRI_SP7_SHIFT: u32 = 2;
pub const AIPS_PACRI_TP6_MASK: u32 = 16;
pub const AIPS_PACRI_TP6_SHIFT: u32 = 4;
pub const AIPS_PACRI_WP6_MASK: u32 = 32;
pub const AIPS_PACRI_WP6_SHIFT: u32 = 5;
pub const AIPS_PACRI_SP6_MASK: u32 = 64;
pub const AIPS_PACRI_SP6_SHIFT: u32 = 6;
pub const AIPS_PACRI_TP5_MASK: u32 = 256;
pub const AIPS_PACRI_TP5_SHIFT: u32 = 8;
pub const AIPS_PACRI_WP5_MASK: u32 = 512;
pub const AIPS_PACRI_WP5_SHIFT: u32 = 9;
pub const AIPS_PACRI_SP5_MASK: u32 = 1024;
pub const AIPS_PACRI_SP5_SHIFT: u32 = 10;
pub const AIPS_PACRI_TP4_MASK: u32 = 4096;
pub const AIPS_PACRI_TP4_SHIFT: u32 = 12;
pub const AIPS_PACRI_WP4_MASK: u32 = 8192;
pub const AIPS_PACRI_WP4_SHIFT: u32 = 13;
pub const AIPS_PACRI_SP4_MASK: u32 = 16384;
pub const AIPS_PACRI_SP4_SHIFT: u32 = 14;
pub const AIPS_PACRI_TP3_MASK: u32 = 65536;
pub const AIPS_PACRI_TP3_SHIFT: u32 = 16;
pub const AIPS_PACRI_WP3_MASK: u32 = 131072;
pub const AIPS_PACRI_WP3_SHIFT: u32 = 17;
pub const AIPS_PACRI_SP3_MASK: u32 = 262144;
pub const AIPS_PACRI_SP3_SHIFT: u32 = 18;
pub const AIPS_PACRI_TP2_MASK: u32 = 1048576;
pub const AIPS_PACRI_TP2_SHIFT: u32 = 20;
pub const AIPS_PACRI_WP2_MASK: u32 = 2097152;
pub const AIPS_PACRI_WP2_SHIFT: u32 = 21;
pub const AIPS_PACRI_SP2_MASK: u32 = 4194304;
pub const AIPS_PACRI_SP2_SHIFT: u32 = 22;
pub const AIPS_PACRI_TP1_MASK: u32 = 16777216;
pub const AIPS_PACRI_TP1_SHIFT: u32 = 24;
pub const AIPS_PACRI_WP1_MASK: u32 = 33554432;
pub const AIPS_PACRI_WP1_SHIFT: u32 = 25;
pub const AIPS_PACRI_SP1_MASK: u32 = 67108864;
pub const AIPS_PACRI_SP1_SHIFT: u32 = 26;
pub const AIPS_PACRI_TP0_MASK: u32 = 268435456;
pub const AIPS_PACRI_TP0_SHIFT: u32 = 28;
pub const AIPS_PACRI_WP0_MASK: u32 = 536870912;
pub const AIPS_PACRI_WP0_SHIFT: u32 = 29;
pub const AIPS_PACRI_SP0_MASK: u32 = 1073741824;
pub const AIPS_PACRI_SP0_SHIFT: u32 = 30;
pub const AIPS_PACRJ_TP7_MASK: u32 = 1;
pub const AIPS_PACRJ_TP7_SHIFT: u32 = 0;
pub const AIPS_PACRJ_WP7_MASK: u32 = 2;
pub const AIPS_PACRJ_WP7_SHIFT: u32 = 1;
pub const AIPS_PACRJ_SP7_MASK: u32 = 4;
pub const AIPS_PACRJ_SP7_SHIFT: u32 = 2;
pub const AIPS_PACRJ_TP6_MASK: u32 = 16;
pub const AIPS_PACRJ_TP6_SHIFT: u32 = 4;
pub const AIPS_PACRJ_WP6_MASK: u32 = 32;
pub const AIPS_PACRJ_WP6_SHIFT: u32 = 5;
pub const AIPS_PACRJ_SP6_MASK: u32 = 64;
pub const AIPS_PACRJ_SP6_SHIFT: u32 = 6;
pub const AIPS_PACRJ_TP5_MASK: u32 = 256;
pub const AIPS_PACRJ_TP5_SHIFT: u32 = 8;
pub const AIPS_PACRJ_WP5_MASK: u32 = 512;
pub const AIPS_PACRJ_WP5_SHIFT: u32 = 9;
pub const AIPS_PACRJ_SP5_MASK: u32 = 1024;
pub const AIPS_PACRJ_SP5_SHIFT: u32 = 10;
pub const AIPS_PACRJ_TP4_MASK: u32 = 4096;
pub const AIPS_PACRJ_TP4_SHIFT: u32 = 12;
pub const AIPS_PACRJ_WP4_MASK: u32 = 8192;
pub const AIPS_PACRJ_WP4_SHIFT: u32 = 13;
pub const AIPS_PACRJ_SP4_MASK: u32 = 16384;
pub const AIPS_PACRJ_SP4_SHIFT: u32 = 14;
pub const AIPS_PACRJ_TP3_MASK: u32 = 65536;
pub const AIPS_PACRJ_TP3_SHIFT: u32 = 16;
pub const AIPS_PACRJ_WP3_MASK: u32 = 131072;
pub const AIPS_PACRJ_WP3_SHIFT: u32 = 17;
pub const AIPS_PACRJ_SP3_MASK: u32 = 262144;
pub const AIPS_PACRJ_SP3_SHIFT: u32 = 18;
pub const AIPS_PACRJ_TP2_MASK: u32 = 1048576;
pub const AIPS_PACRJ_TP2_SHIFT: u32 = 20;
pub const AIPS_PACRJ_WP2_MASK: u32 = 2097152;
pub const AIPS_PACRJ_WP2_SHIFT: u32 = 21;
pub const AIPS_PACRJ_SP2_MASK: u32 = 4194304;
pub const AIPS_PACRJ_SP2_SHIFT: u32 = 22;
pub const AIPS_PACRJ_TP1_MASK: u32 = 16777216;
pub const AIPS_PACRJ_TP1_SHIFT: u32 = 24;
pub const AIPS_PACRJ_WP1_MASK: u32 = 33554432;
pub const AIPS_PACRJ_WP1_SHIFT: u32 = 25;
pub const AIPS_PACRJ_SP1_MASK: u32 = 67108864;
pub const AIPS_PACRJ_SP1_SHIFT: u32 = 26;
pub const AIPS_PACRJ_TP0_MASK: u32 = 268435456;
pub const AIPS_PACRJ_TP0_SHIFT: u32 = 28;
pub const AIPS_PACRJ_WP0_MASK: u32 = 536870912;
pub const AIPS_PACRJ_WP0_SHIFT: u32 = 29;
pub const AIPS_PACRJ_SP0_MASK: u32 = 1073741824;
pub const AIPS_PACRJ_SP0_SHIFT: u32 = 30;
pub const AIPS_PACRK_TP7_MASK: u32 = 1;
pub const AIPS_PACRK_TP7_SHIFT: u32 = 0;
pub const AIPS_PACRK_WP7_MASK: u32 = 2;
pub const AIPS_PACRK_WP7_SHIFT: u32 = 1;
pub const AIPS_PACRK_SP7_MASK: u32 = 4;
pub const AIPS_PACRK_SP7_SHIFT: u32 = 2;
pub const AIPS_PACRK_TP6_MASK: u32 = 16;
pub const AIPS_PACRK_TP6_SHIFT: u32 = 4;
pub const AIPS_PACRK_WP6_MASK: u32 = 32;
pub const AIPS_PACRK_WP6_SHIFT: u32 = 5;
pub const AIPS_PACRK_SP6_MASK: u32 = 64;
pub const AIPS_PACRK_SP6_SHIFT: u32 = 6;
pub const AIPS_PACRK_TP5_MASK: u32 = 256;
pub const AIPS_PACRK_TP5_SHIFT: u32 = 8;
pub const AIPS_PACRK_WP5_MASK: u32 = 512;
pub const AIPS_PACRK_WP5_SHIFT: u32 = 9;
pub const AIPS_PACRK_SP5_MASK: u32 = 1024;
pub const AIPS_PACRK_SP5_SHIFT: u32 = 10;
pub const AIPS_PACRK_TP4_MASK: u32 = 4096;
pub const AIPS_PACRK_TP4_SHIFT: u32 = 12;
pub const AIPS_PACRK_WP4_MASK: u32 = 8192;
pub const AIPS_PACRK_WP4_SHIFT: u32 = 13;
pub const AIPS_PACRK_SP4_MASK: u32 = 16384;
pub const AIPS_PACRK_SP4_SHIFT: u32 = 14;
pub const AIPS_PACRK_TP3_MASK: u32 = 65536;
pub const AIPS_PACRK_TP3_SHIFT: u32 = 16;
pub const AIPS_PACRK_WP3_MASK: u32 = 131072;
pub const AIPS_PACRK_WP3_SHIFT: u32 = 17;
pub const AIPS_PACRK_SP3_MASK: u32 = 262144;
pub const AIPS_PACRK_SP3_SHIFT: u32 = 18;
pub const AIPS_PACRK_TP2_MASK: u32 = 1048576;
pub const AIPS_PACRK_TP2_SHIFT: u32 = 20;
pub const AIPS_PACRK_WP2_MASK: u32 = 2097152;
pub const AIPS_PACRK_WP2_SHIFT: u32 = 21;
pub const AIPS_PACRK_SP2_MASK: u32 = 4194304;
pub const AIPS_PACRK_SP2_SHIFT: u32 = 22;
pub const AIPS_PACRK_TP1_MASK: u32 = 16777216;
pub const AIPS_PACRK_TP1_SHIFT: u32 = 24;
pub const AIPS_PACRK_WP1_MASK: u32 = 33554432;
pub const AIPS_PACRK_WP1_SHIFT: u32 = 25;
pub const AIPS_PACRK_SP1_MASK: u32 = 67108864;
pub const AIPS_PACRK_SP1_SHIFT: u32 = 26;
pub const AIPS_PACRK_TP0_MASK: u32 = 268435456;
pub const AIPS_PACRK_TP0_SHIFT: u32 = 28;
pub const AIPS_PACRK_WP0_MASK: u32 = 536870912;
pub const AIPS_PACRK_WP0_SHIFT: u32 = 29;
pub const AIPS_PACRK_SP0_MASK: u32 = 1073741824;
pub const AIPS_PACRK_SP0_SHIFT: u32 = 30;
pub const AIPS_PACRL_TP7_MASK: u32 = 1;
pub const AIPS_PACRL_TP7_SHIFT: u32 = 0;
pub const AIPS_PACRL_WP7_MASK: u32 = 2;
pub const AIPS_PACRL_WP7_SHIFT: u32 = 1;
pub const AIPS_PACRL_SP7_MASK: u32 = 4;
pub const AIPS_PACRL_SP7_SHIFT: u32 = 2;
pub const AIPS_PACRL_TP6_MASK: u32 = 16;
pub const AIPS_PACRL_TP6_SHIFT: u32 = 4;
pub const AIPS_PACRL_WP6_MASK: u32 = 32;
pub const AIPS_PACRL_WP6_SHIFT: u32 = 5;
pub const AIPS_PACRL_SP6_MASK: u32 = 64;
pub const AIPS_PACRL_SP6_SHIFT: u32 = 6;
pub const AIPS_PACRL_TP5_MASK: u32 = 256;
pub const AIPS_PACRL_TP5_SHIFT: u32 = 8;
pub const AIPS_PACRL_WP5_MASK: u32 = 512;
pub const AIPS_PACRL_WP5_SHIFT: u32 = 9;
pub const AIPS_PACRL_SP5_MASK: u32 = 1024;
pub const AIPS_PACRL_SP5_SHIFT: u32 = 10;
pub const AIPS_PACRL_TP4_MASK: u32 = 4096;
pub const AIPS_PACRL_TP4_SHIFT: u32 = 12;
pub const AIPS_PACRL_WP4_MASK: u32 = 8192;
pub const AIPS_PACRL_WP4_SHIFT: u32 = 13;
pub const AIPS_PACRL_SP4_MASK: u32 = 16384;
pub const AIPS_PACRL_SP4_SHIFT: u32 = 14;
pub const AIPS_PACRL_TP3_MASK: u32 = 65536;
pub const AIPS_PACRL_TP3_SHIFT: u32 = 16;
pub const AIPS_PACRL_WP3_MASK: u32 = 131072;
pub const AIPS_PACRL_WP3_SHIFT: u32 = 17;
pub const AIPS_PACRL_SP3_MASK: u32 = 262144;
pub const AIPS_PACRL_SP3_SHIFT: u32 = 18;
pub const AIPS_PACRL_TP2_MASK: u32 = 1048576;
pub const AIPS_PACRL_TP2_SHIFT: u32 = 20;
pub const AIPS_PACRL_WP2_MASK: u32 = 2097152;
pub const AIPS_PACRL_WP2_SHIFT: u32 = 21;
pub const AIPS_PACRL_SP2_MASK: u32 = 4194304;
pub const AIPS_PACRL_SP2_SHIFT: u32 = 22;
pub const AIPS_PACRL_TP1_MASK: u32 = 16777216;
pub const AIPS_PACRL_TP1_SHIFT: u32 = 24;
pub const AIPS_PACRL_WP1_MASK: u32 = 33554432;
pub const AIPS_PACRL_WP1_SHIFT: u32 = 25;
pub const AIPS_PACRL_SP1_MASK: u32 = 67108864;
pub const AIPS_PACRL_SP1_SHIFT: u32 = 26;
pub const AIPS_PACRL_TP0_MASK: u32 = 268435456;
pub const AIPS_PACRL_TP0_SHIFT: u32 = 28;
pub const AIPS_PACRL_WP0_MASK: u32 = 536870912;
pub const AIPS_PACRL_WP0_SHIFT: u32 = 29;
pub const AIPS_PACRL_SP0_MASK: u32 = 1073741824;
pub const AIPS_PACRL_SP0_SHIFT: u32 = 30;
pub const AIPS_PACRM_TP7_MASK: u32 = 1;
pub const AIPS_PACRM_TP7_SHIFT: u32 = 0;
pub const AIPS_PACRM_WP7_MASK: u32 = 2;
pub const AIPS_PACRM_WP7_SHIFT: u32 = 1;
pub const AIPS_PACRM_SP7_MASK: u32 = 4;
pub const AIPS_PACRM_SP7_SHIFT: u32 = 2;
pub const AIPS_PACRM_TP6_MASK: u32 = 16;
pub const AIPS_PACRM_TP6_SHIFT: u32 = 4;
pub const AIPS_PACRM_WP6_MASK: u32 = 32;
pub const AIPS_PACRM_WP6_SHIFT: u32 = 5;
pub const AIPS_PACRM_SP6_MASK: u32 = 64;
pub const AIPS_PACRM_SP6_SHIFT: u32 = 6;
pub const AIPS_PACRM_TP5_MASK: u32 = 256;
pub const AIPS_PACRM_TP5_SHIFT: u32 = 8;
pub const AIPS_PACRM_WP5_MASK: u32 = 512;
pub const AIPS_PACRM_WP5_SHIFT: u32 = 9;
pub const AIPS_PACRM_SP5_MASK: u32 = 1024;
pub const AIPS_PACRM_SP5_SHIFT: u32 = 10;
pub const AIPS_PACRM_TP4_MASK: u32 = 4096;
pub const AIPS_PACRM_TP4_SHIFT: u32 = 12;
pub const AIPS_PACRM_WP4_MASK: u32 = 8192;
pub const AIPS_PACRM_WP4_SHIFT: u32 = 13;
pub const AIPS_PACRM_SP4_MASK: u32 = 16384;
pub const AIPS_PACRM_SP4_SHIFT: u32 = 14;
pub const AIPS_PACRM_TP3_MASK: u32 = 65536;
pub const AIPS_PACRM_TP3_SHIFT: u32 = 16;
pub const AIPS_PACRM_WP3_MASK: u32 = 131072;
pub const AIPS_PACRM_WP3_SHIFT: u32 = 17;
pub const AIPS_PACRM_SP3_MASK: u32 = 262144;
pub const AIPS_PACRM_SP3_SHIFT: u32 = 18;
pub const AIPS_PACRM_TP2_MASK: u32 = 1048576;
pub const AIPS_PACRM_TP2_SHIFT: u32 = 20;
pub const AIPS_PACRM_WP2_MASK: u32 = 2097152;
pub const AIPS_PACRM_WP2_SHIFT: u32 = 21;
pub const AIPS_PACRM_SP2_MASK: u32 = 4194304;
pub const AIPS_PACRM_SP2_SHIFT: u32 = 22;
pub const AIPS_PACRM_TP1_MASK: u32 = 16777216;
pub const AIPS_PACRM_TP1_SHIFT: u32 = 24;
pub const AIPS_PACRM_WP1_MASK: u32 = 33554432;
pub const AIPS_PACRM_WP1_SHIFT: u32 = 25;
pub const AIPS_PACRM_SP1_MASK: u32 = 67108864;
pub const AIPS_PACRM_SP1_SHIFT: u32 = 26;
pub const AIPS_PACRM_TP0_MASK: u32 = 268435456;
pub const AIPS_PACRM_TP0_SHIFT: u32 = 28;
pub const AIPS_PACRM_WP0_MASK: u32 = 536870912;
pub const AIPS_PACRM_WP0_SHIFT: u32 = 29;
pub const AIPS_PACRM_SP0_MASK: u32 = 1073741824;
pub const AIPS_PACRM_SP0_SHIFT: u32 = 30;
pub const AIPS_PACRN_TP7_MASK: u32 = 1;
pub const AIPS_PACRN_TP7_SHIFT: u32 = 0;
pub const AIPS_PACRN_WP7_MASK: u32 = 2;
pub const AIPS_PACRN_WP7_SHIFT: u32 = 1;
pub const AIPS_PACRN_SP7_MASK: u32 = 4;
pub const AIPS_PACRN_SP7_SHIFT: u32 = 2;
pub const AIPS_PACRN_TP6_MASK: u32 = 16;
pub const AIPS_PACRN_TP6_SHIFT: u32 = 4;
pub const AIPS_PACRN_WP6_MASK: u32 = 32;
pub const AIPS_PACRN_WP6_SHIFT: u32 = 5;
pub const AIPS_PACRN_SP6_MASK: u32 = 64;
pub const AIPS_PACRN_SP6_SHIFT: u32 = 6;
pub const AIPS_PACRN_TP5_MASK: u32 = 256;
pub const AIPS_PACRN_TP5_SHIFT: u32 = 8;
pub const AIPS_PACRN_WP5_MASK: u32 = 512;
pub const AIPS_PACRN_WP5_SHIFT: u32 = 9;
pub const AIPS_PACRN_SP5_MASK: u32 = 1024;
pub const AIPS_PACRN_SP5_SHIFT: u32 = 10;
pub const AIPS_PACRN_TP4_MASK: u32 = 4096;
pub const AIPS_PACRN_TP4_SHIFT: u32 = 12;
pub const AIPS_PACRN_WP4_MASK: u32 = 8192;
pub const AIPS_PACRN_WP4_SHIFT: u32 = 13;
pub const AIPS_PACRN_SP4_MASK: u32 = 16384;
pub const AIPS_PACRN_SP4_SHIFT: u32 = 14;
pub const AIPS_PACRN_TP3_MASK: u32 = 65536;
pub const AIPS_PACRN_TP3_SHIFT: u32 = 16;
pub const AIPS_PACRN_WP3_MASK: u32 = 131072;
pub const AIPS_PACRN_WP3_SHIFT: u32 = 17;
pub const AIPS_PACRN_SP3_MASK: u32 = 262144;
pub const AIPS_PACRN_SP3_SHIFT: u32 = 18;
pub const AIPS_PACRN_TP2_MASK: u32 = 1048576;
pub const AIPS_PACRN_TP2_SHIFT: u32 = 20;
pub const AIPS_PACRN_WP2_MASK: u32 = 2097152;
pub const AIPS_PACRN_WP2_SHIFT: u32 = 21;
pub const AIPS_PACRN_SP2_MASK: u32 = 4194304;
pub const AIPS_PACRN_SP2_SHIFT: u32 = 22;
pub const AIPS_PACRN_TP1_MASK: u32 = 16777216;
pub const AIPS_PACRN_TP1_SHIFT: u32 = 24;
pub const AIPS_PACRN_WP1_MASK: u32 = 33554432;
pub const AIPS_PACRN_WP1_SHIFT: u32 = 25;
pub const AIPS_PACRN_SP1_MASK: u32 = 67108864;
pub const AIPS_PACRN_SP1_SHIFT: u32 = 26;
pub const AIPS_PACRN_TP0_MASK: u32 = 268435456;
pub const AIPS_PACRN_TP0_SHIFT: u32 = 28;
pub const AIPS_PACRN_WP0_MASK: u32 = 536870912;
pub const AIPS_PACRN_WP0_SHIFT: u32 = 29;
pub const AIPS_PACRN_SP0_MASK: u32 = 1073741824;
pub const AIPS_PACRN_SP0_SHIFT: u32 = 30;
pub const AIPS_PACRO_TP7_MASK: u32 = 1;
pub const AIPS_PACRO_TP7_SHIFT: u32 = 0;
pub const AIPS_PACRO_WP7_MASK: u32 = 2;
pub const AIPS_PACRO_WP7_SHIFT: u32 = 1;
pub const AIPS_PACRO_SP7_MASK: u32 = 4;
pub const AIPS_PACRO_SP7_SHIFT: u32 = 2;
pub const AIPS_PACRO_TP6_MASK: u32 = 16;
pub const AIPS_PACRO_TP6_SHIFT: u32 = 4;
pub const AIPS_PACRO_WP6_MASK: u32 = 32;
pub const AIPS_PACRO_WP6_SHIFT: u32 = 5;
pub const AIPS_PACRO_SP6_MASK: u32 = 64;
pub const AIPS_PACRO_SP6_SHIFT: u32 = 6;
pub const AIPS_PACRO_TP5_MASK: u32 = 256;
pub const AIPS_PACRO_TP5_SHIFT: u32 = 8;
pub const AIPS_PACRO_WP5_MASK: u32 = 512;
pub const AIPS_PACRO_WP5_SHIFT: u32 = 9;
pub const AIPS_PACRO_SP5_MASK: u32 = 1024;
pub const AIPS_PACRO_SP5_SHIFT: u32 = 10;
pub const AIPS_PACRO_TP4_MASK: u32 = 4096;
pub const AIPS_PACRO_TP4_SHIFT: u32 = 12;
pub const AIPS_PACRO_WP4_MASK: u32 = 8192;
pub const AIPS_PACRO_WP4_SHIFT: u32 = 13;
pub const AIPS_PACRO_SP4_MASK: u32 = 16384;
pub const AIPS_PACRO_SP4_SHIFT: u32 = 14;
pub const AIPS_PACRO_TP3_MASK: u32 = 65536;
pub const AIPS_PACRO_TP3_SHIFT: u32 = 16;
pub const AIPS_PACRO_WP3_MASK: u32 = 131072;
pub const AIPS_PACRO_WP3_SHIFT: u32 = 17;
pub const AIPS_PACRO_SP3_MASK: u32 = 262144;
pub const AIPS_PACRO_SP3_SHIFT: u32 = 18;
pub const AIPS_PACRO_TP2_MASK: u32 = 1048576;
pub const AIPS_PACRO_TP2_SHIFT: u32 = 20;
pub const AIPS_PACRO_WP2_MASK: u32 = 2097152;
pub const AIPS_PACRO_WP2_SHIFT: u32 = 21;
pub const AIPS_PACRO_SP2_MASK: u32 = 4194304;
pub const AIPS_PACRO_SP2_SHIFT: u32 = 22;
pub const AIPS_PACRO_TP1_MASK: u32 = 16777216;
pub const AIPS_PACRO_TP1_SHIFT: u32 = 24;
pub const AIPS_PACRO_WP1_MASK: u32 = 33554432;
pub const AIPS_PACRO_WP1_SHIFT: u32 = 25;
pub const AIPS_PACRO_SP1_MASK: u32 = 67108864;
pub const AIPS_PACRO_SP1_SHIFT: u32 = 26;
pub const AIPS_PACRO_TP0_MASK: u32 = 268435456;
pub const AIPS_PACRO_TP0_SHIFT: u32 = 28;
pub const AIPS_PACRO_WP0_MASK: u32 = 536870912;
pub const AIPS_PACRO_WP0_SHIFT: u32 = 29;
pub const AIPS_PACRO_SP0_MASK: u32 = 1073741824;
pub const AIPS_PACRO_SP0_SHIFT: u32 = 30;
pub const AIPS_PACRP_TP7_MASK: u32 = 1;
pub const AIPS_PACRP_TP7_SHIFT: u32 = 0;
pub const AIPS_PACRP_WP7_MASK: u32 = 2;
pub const AIPS_PACRP_WP7_SHIFT: u32 = 1;
pub const AIPS_PACRP_SP7_MASK: u32 = 4;
pub const AIPS_PACRP_SP7_SHIFT: u32 = 2;
pub const AIPS_PACRP_TP6_MASK: u32 = 16;
pub const AIPS_PACRP_TP6_SHIFT: u32 = 4;
pub const AIPS_PACRP_WP6_MASK: u32 = 32;
pub const AIPS_PACRP_WP6_SHIFT: u32 = 5;
pub const AIPS_PACRP_SP6_MASK: u32 = 64;
pub const AIPS_PACRP_SP6_SHIFT: u32 = 6;
pub const AIPS_PACRP_TP5_MASK: u32 = 256;
pub const AIPS_PACRP_TP5_SHIFT: u32 = 8;
pub const AIPS_PACRP_WP5_MASK: u32 = 512;
pub const AIPS_PACRP_WP5_SHIFT: u32 = 9;
pub const AIPS_PACRP_SP5_MASK: u32 = 1024;
pub const AIPS_PACRP_SP5_SHIFT: u32 = 10;
pub const AIPS_PACRP_TP4_MASK: u32 = 4096;
pub const AIPS_PACRP_TP4_SHIFT: u32 = 12;
pub const AIPS_PACRP_WP4_MASK: u32 = 8192;
pub const AIPS_PACRP_WP4_SHIFT: u32 = 13;
pub const AIPS_PACRP_SP4_MASK: u32 = 16384;
pub const AIPS_PACRP_SP4_SHIFT: u32 = 14;
pub const AIPS_PACRP_TP3_MASK: u32 = 65536;
pub const AIPS_PACRP_TP3_SHIFT: u32 = 16;
pub const AIPS_PACRP_WP3_MASK: u32 = 131072;
pub const AIPS_PACRP_WP3_SHIFT: u32 = 17;
pub const AIPS_PACRP_SP3_MASK: u32 = 262144;
pub const AIPS_PACRP_SP3_SHIFT: u32 = 18;
pub const AIPS_PACRP_TP2_MASK: u32 = 1048576;
pub const AIPS_PACRP_TP2_SHIFT: u32 = 20;
pub const AIPS_PACRP_WP2_MASK: u32 = 2097152;
pub const AIPS_PACRP_WP2_SHIFT: u32 = 21;
pub const AIPS_PACRP_SP2_MASK: u32 = 4194304;
pub const AIPS_PACRP_SP2_SHIFT: u32 = 22;
pub const AIPS_PACRP_TP1_MASK: u32 = 16777216;
pub const AIPS_PACRP_TP1_SHIFT: u32 = 24;
pub const AIPS_PACRP_WP1_MASK: u32 = 33554432;
pub const AIPS_PACRP_WP1_SHIFT: u32 = 25;
pub const AIPS_PACRP_SP1_MASK: u32 = 67108864;
pub const AIPS_PACRP_SP1_SHIFT: u32 = 26;
pub const AIPS_PACRP_TP0_MASK: u32 = 268435456;
pub const AIPS_PACRP_TP0_SHIFT: u32 = 28;
pub const AIPS_PACRP_WP0_MASK: u32 = 536870912;
pub const AIPS_PACRP_WP0_SHIFT: u32 = 29;
pub const AIPS_PACRP_SP0_MASK: u32 = 1073741824;
pub const AIPS_PACRP_SP0_SHIFT: u32 = 30;
pub const AIPS0_BASE: u32 = 1073741824;
pub const AIPS1_BASE: u32 = 1074266112;
#[doc = " AXBS - Register Layout Typedef"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct AXBS_Type {
    pub SLAVE: [AXBS_Type__bindgen_ty_1; 5usize],
    pub RESERVED_0: [u8; 768usize],
    #[doc = "< Master General Purpose Control Register, offset: 0x800"]
    pub MGPCR0: u32,
    pub RESERVED_1: [u8; 252usize],
    #[doc = "< Master General Purpose Control Register, offset: 0x900"]
    pub MGPCR1: u32,
    pub RESERVED_2: [u8; 252usize],
    #[doc = "< Master General Purpose Control Register, offset: 0xA00"]
    pub MGPCR2: u32,
    pub RESERVED_3: [u8; 508usize],
    #[doc = "< Master General Purpose Control Register, offset: 0xC00"]
    pub MGPCR4: u32,
    pub RESERVED_4: [u8; 252usize],
    #[doc = "< Master General Purpose Control Register, offset: 0xD00"]
    pub MGPCR5: u32,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct AXBS_Type__bindgen_ty_1 {
    #[doc = "< Priority Registers Slave, array offset: 0x0, array step: 0x100"]
    pub PRS: u32,
    pub RESERVED_0: [u8; 12usize],
    #[doc = "< Control Register, array offset: 0x10, array step: 0x100"]
    pub CRS: u32,
    pub RESERVED_1: [u8; 236usize],
}
#[test]
fn bindgen_test_layout_AXBS_Type__bindgen_ty_1() {
    const UNINIT: ::std::mem::MaybeUninit<AXBS_Type__bindgen_ty_1> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<AXBS_Type__bindgen_ty_1>(),
        256usize,
        concat!("Size of: ", stringify!(AXBS_Type__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<AXBS_Type__bindgen_ty_1>(),
        4usize,
        concat!("Alignment of ", stringify!(AXBS_Type__bindgen_ty_1))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).PRS) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(AXBS_Type__bindgen_ty_1),
            "::",
            stringify!(PRS)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).RESERVED_0) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(AXBS_Type__bindgen_ty_1),
            "::",
            stringify!(RESERVED_0)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).CRS) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(AXBS_Type__bindgen_ty_1),
            "::",
            stringify!(CRS)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).RESERVED_1) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(AXBS_Type__bindgen_ty_1),
            "::",
            stringify!(RESERVED_1)
        )
    );
}
#[test]
fn bindgen_test_layout_AXBS_Type() {
    const UNINIT: ::std::mem::MaybeUninit<AXBS_Type> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<AXBS_Type>(),
        3332usize,
        concat!("Size of: ", stringify!(AXBS_Type))
    );
    assert_eq!(
        ::std::mem::align_of::<AXBS_Type>(),
        4usize,
        concat!("Alignment of ", stringify!(AXBS_Type))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).SLAVE) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(AXBS_Type),
            "::",
            stringify!(SLAVE)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).RESERVED_0) as usize - ptr as usize },
        1280usize,
        concat!(
            "Offset of field: ",
            stringify!(AXBS_Type),
            "::",
            stringify!(RESERVED_0)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).MGPCR0) as usize - ptr as usize },
        2048usize,
        concat!(
            "Offset of field: ",
            stringify!(AXBS_Type),
            "::",
            stringify!(MGPCR0)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).RESERVED_1) as usize - ptr as usize },
        2052usize,
        concat!(
            "Offset of field: ",
            stringify!(AXBS_Type),
            "::",
            stringify!(RESERVED_1)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).MGPCR1) as usize - ptr as usize },
        2304usize,
        concat!(
            "Offset of field: ",
            stringify!(AXBS_Type),
            "::",
            stringify!(MGPCR1)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).RESERVED_2) as usize - ptr as usize },
        2308usize,
        concat!(
            "Offset of field: ",
            stringify!(AXBS_Type),
            "::",
            stringify!(RESERVED_2)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).MGPCR2) as usize - ptr as usize },
        2560usize,
        concat!(
            "Offset of field: ",
            stringify!(AXBS_Type),
            "::",
            stringify!(MGPCR2)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).RESERVED_3) as usize - ptr as usize },
        2564usize,
        concat!(
            "Offset of field: ",
            stringify!(AXBS_Type),
            "::",
            stringify!(RESERVED_3)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).MGPCR4) as usize - ptr as usize },
        3072usize,
        concat!(
            "Offset of field: ",
            stringify!(AXBS_Type),
            "::",
            stringify!(MGPCR4)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).RESERVED_4) as usize - ptr as usize },
        3076usize,
        concat!(
            "Offset of field: ",
            stringify!(AXBS_Type),
            "::",
            stringify!(RESERVED_4)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).MGPCR5) as usize - ptr as usize },
        3328usize,
        concat!(
            "Offset of field: ",
            stringify!(AXBS_Type),
            "::",
            stringify!(MGPCR5)
        )
    );
}
pub const AXBS_PRS_M0_MASK: u32 = 7;
pub const AXBS_PRS_M0_SHIFT: u32 = 0;
pub const AXBS_PRS_M1_MASK: u32 = 112;
pub const AXBS_PRS_M1_SHIFT: u32 = 4;
pub const AXBS_PRS_M2_MASK: u32 = 1792;
pub const AXBS_PRS_M2_SHIFT: u32 = 8;
pub const AXBS_PRS_M4_MASK: u32 = 458752;
pub const AXBS_PRS_M4_SHIFT: u32 = 16;
pub const AXBS_PRS_M5_MASK: u32 = 7340032;
pub const AXBS_PRS_M5_SHIFT: u32 = 20;
pub const AXBS_PRS_COUNT: u32 = 5;
pub const AXBS_CRS_PARK_MASK: u32 = 7;
pub const AXBS_CRS_PARK_SHIFT: u32 = 0;
pub const AXBS_CRS_PCTL_MASK: u32 = 48;
pub const AXBS_CRS_PCTL_SHIFT: u32 = 4;
pub const AXBS_CRS_ARB_MASK: u32 = 768;
pub const AXBS_CRS_ARB_SHIFT: u32 = 8;
pub const AXBS_CRS_HLP_MASK: u32 = 1073741824;
pub const AXBS_CRS_HLP_SHIFT: u32 = 30;
pub const AXBS_CRS_RO_MASK: u32 = 2147483648;
pub const AXBS_CRS_RO_SHIFT: u32 = 31;
pub const AXBS_CRS_COUNT: u32 = 5;
pub const AXBS_MGPCR0_AULB_MASK: u32 = 7;
pub const AXBS_MGPCR0_AULB_SHIFT: u32 = 0;
pub const AXBS_MGPCR1_AULB_MASK: u32 = 7;
pub const AXBS_MGPCR1_AULB_SHIFT: u32 = 0;
pub const AXBS_MGPCR2_AULB_MASK: u32 = 7;
pub const AXBS_MGPCR2_AULB_SHIFT: u32 = 0;
pub const AXBS_MGPCR4_AULB_MASK: u32 = 7;
pub const AXBS_MGPCR4_AULB_SHIFT: u32 = 0;
pub const AXBS_MGPCR5_AULB_MASK: u32 = 7;
pub const AXBS_MGPCR5_AULB_SHIFT: u32 = 0;
pub const AXBS_BASE: u32 = 1073758208;
#[doc = " CAN - Register Layout Typedef"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CAN_Type {
    #[doc = "< Module Configuration Register, offset: 0x0"]
    pub MCR: u32,
    #[doc = "< Control 1 register, offset: 0x4"]
    pub CTRL1: u32,
    #[doc = "< Free Running Timer, offset: 0x8"]
    pub TIMER: u32,
    pub RESERVED_0: [u8; 4usize],
    #[doc = "< Rx Mailboxes Global Mask Register, offset: 0x10"]
    pub RXMGMASK: u32,
    #[doc = "< Rx 14 Mask register, offset: 0x14"]
    pub RX14MASK: u32,
    #[doc = "< Rx 15 Mask register, offset: 0x18"]
    pub RX15MASK: u32,
    #[doc = "< Error Counter, offset: 0x1C"]
    pub ECR: u32,
    #[doc = "< Error and Status 1 register, offset: 0x20"]
    pub ESR1: u32,
    pub RESERVED_1: [u8; 4usize],
    #[doc = "< Interrupt Masks 1 register, offset: 0x28"]
    pub IMASK1: u32,
    pub RESERVED_2: [u8; 4usize],
    #[doc = "< Interrupt Flags 1 register, offset: 0x30"]
    pub IFLAG1: u32,
    #[doc = "< Control 2 register, offset: 0x34"]
    pub CTRL2: u32,
    #[doc = "< Error and Status 2 register, offset: 0x38"]
    pub ESR2: u32,
    pub RESERVED_3: [u8; 8usize],
    #[doc = "< CRC Register, offset: 0x44"]
    pub CRCR: u32,
    #[doc = "< Rx FIFO Global Mask register, offset: 0x48"]
    pub RXFGMASK: u32,
    #[doc = "< Rx FIFO Information Register, offset: 0x4C"]
    pub RXFIR: u32,
    pub RESERVED_4: [u8; 48usize],
    pub MB: [CAN_Type__bindgen_ty_1; 16usize],
    pub RESERVED_5: [u8; 1792usize],
    #[doc = "< Rx Individual Mask Registers, array offset: 0x880, array step: 0x4"]
    pub RXIMR: [u32; 16usize],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CAN_Type__bindgen_ty_1 {
    #[doc = "< Message Buffer 0 CS Register..Message Buffer 15 CS Register, array offset: 0x80, array step: 0x10"]
    pub CS: u32,
    #[doc = "< Message Buffer 0 ID Register..Message Buffer 15 ID Register, array offset: 0x84, array step: 0x10"]
    pub ID: u32,
    #[doc = "< Message Buffer 0 WORD0 Register..Message Buffer 15 WORD0 Register, array offset: 0x88, array step: 0x10"]
    pub WORD0: u32,
    #[doc = "< Message Buffer 0 WORD1 Register..Message Buffer 15 WORD1 Register, array offset: 0x8C, array step: 0x10"]
    pub WORD1: u32,
}
#[test]
fn bindgen_test_layout_CAN_Type__bindgen_ty_1() {
    const UNINIT: ::std::mem::MaybeUninit<CAN_Type__bindgen_ty_1> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<CAN_Type__bindgen_ty_1>(),
        16usize,
        concat!("Size of: ", stringify!(CAN_Type__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<CAN_Type__bindgen_ty_1>(),
        4usize,
        concat!("Alignment of ", stringify!(CAN_Type__bindgen_ty_1))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).CS) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(CAN_Type__bindgen_ty_1),
            "::",
            stringify!(CS)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ID) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(CAN_Type__bindgen_ty_1),
            "::",
            stringify!(ID)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).WORD0) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(CAN_Type__bindgen_ty_1),
            "::",
            stringify!(WORD0)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).WORD1) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(CAN_Type__bindgen_ty_1),
            "::",
            stringify!(WORD1)
        )
    );
}
#[test]
fn bindgen_test_layout_CAN_Type() {
    const UNINIT: ::std::mem::MaybeUninit<CAN_Type> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<CAN_Type>(),
        2240usize,
        concat!("Size of: ", stringify!(CAN_Type))
    );
    assert_eq!(
        ::std::mem::align_of::<CAN_Type>(),
        4usize,
        concat!("Alignment of ", stringify!(CAN_Type))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).MCR) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(CAN_Type),
            "::",
            stringify!(MCR)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).CTRL1) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(CAN_Type),
            "::",
            stringify!(CTRL1)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).TIMER) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(CAN_Type),
            "::",
            stringify!(TIMER)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).RESERVED_0) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(CAN_Type),
            "::",
            stringify!(RESERVED_0)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).RXMGMASK) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(CAN_Type),
            "::",
            stringify!(RXMGMASK)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).RX14MASK) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(CAN_Type),
            "::",
            stringify!(RX14MASK)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).RX15MASK) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(CAN_Type),
            "::",
            stringify!(RX15MASK)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ECR) as usize - ptr as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(CAN_Type),
            "::",
            stringify!(ECR)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ESR1) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(CAN_Type),
            "::",
            stringify!(ESR1)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).RESERVED_1) as usize - ptr as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(CAN_Type),
            "::",
            stringify!(RESERVED_1)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).IMASK1) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(CAN_Type),
            "::",
            stringify!(IMASK1)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).RESERVED_2) as usize - ptr as usize },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(CAN_Type),
            "::",
            stringify!(RESERVED_2)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).IFLAG1) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(CAN_Type),
            "::",
            stringify!(IFLAG1)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).CTRL2) as usize - ptr as usize },
        52usize,
        concat!(
            "Offset of field: ",
            stringify!(CAN_Type),
            "::",
            stringify!(CTRL2)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ESR2) as usize - ptr as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(CAN_Type),
            "::",
            stringify!(ESR2)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).RESERVED_3) as usize - ptr as usize },
        60usize,
        concat!(
            "Offset of field: ",
            stringify!(CAN_Type),
            "::",
            stringify!(RESERVED_3)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).CRCR) as usize - ptr as usize },
        68usize,
        concat!(
            "Offset of field: ",
            stringify!(CAN_Type),
            "::",
            stringify!(CRCR)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).RXFGMASK) as usize - ptr as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(CAN_Type),
            "::",
            stringify!(RXFGMASK)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).RXFIR) as usize - ptr as usize },
        76usize,
        concat!(
            "Offset of field: ",
            stringify!(CAN_Type),
            "::",
            stringify!(RXFIR)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).RESERVED_4) as usize - ptr as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(CAN_Type),
            "::",
            stringify!(RESERVED_4)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).MB) as usize - ptr as usize },
        128usize,
        concat!(
            "Offset of field: ",
            stringify!(CAN_Type),
            "::",
            stringify!(MB)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).RESERVED_5) as usize - ptr as usize },
        384usize,
        concat!(
            "Offset of field: ",
            stringify!(CAN_Type),
            "::",
            stringify!(RESERVED_5)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).RXIMR) as usize - ptr as usize },
        2176usize,
        concat!(
            "Offset of field: ",
            stringify!(CAN_Type),
            "::",
            stringify!(RXIMR)
        )
    );
}
pub const CAN_MCR_MAXMB_MASK: u32 = 127;
pub const CAN_MCR_MAXMB_SHIFT: u32 = 0;
pub const CAN_MCR_IDAM_MASK: u32 = 768;
pub const CAN_MCR_IDAM_SHIFT: u32 = 8;
pub const CAN_MCR_AEN_MASK: u32 = 4096;
pub const CAN_MCR_AEN_SHIFT: u32 = 12;
pub const CAN_MCR_LPRIOEN_MASK: u32 = 8192;
pub const CAN_MCR_LPRIOEN_SHIFT: u32 = 13;
pub const CAN_MCR_IRMQ_MASK: u32 = 65536;
pub const CAN_MCR_IRMQ_SHIFT: u32 = 16;
pub const CAN_MCR_SRXDIS_MASK: u32 = 131072;
pub const CAN_MCR_SRXDIS_SHIFT: u32 = 17;
pub const CAN_MCR_WAKSRC_MASK: u32 = 524288;
pub const CAN_MCR_WAKSRC_SHIFT: u32 = 19;
pub const CAN_MCR_LPMACK_MASK: u32 = 1048576;
pub const CAN_MCR_LPMACK_SHIFT: u32 = 20;
pub const CAN_MCR_WRNEN_MASK: u32 = 2097152;
pub const CAN_MCR_WRNEN_SHIFT: u32 = 21;
pub const CAN_MCR_SLFWAK_MASK: u32 = 4194304;
pub const CAN_MCR_SLFWAK_SHIFT: u32 = 22;
pub const CAN_MCR_SUPV_MASK: u32 = 8388608;
pub const CAN_MCR_SUPV_SHIFT: u32 = 23;
pub const CAN_MCR_FRZACK_MASK: u32 = 16777216;
pub const CAN_MCR_FRZACK_SHIFT: u32 = 24;
pub const CAN_MCR_SOFTRST_MASK: u32 = 33554432;
pub const CAN_MCR_SOFTRST_SHIFT: u32 = 25;
pub const CAN_MCR_WAKMSK_MASK: u32 = 67108864;
pub const CAN_MCR_WAKMSK_SHIFT: u32 = 26;
pub const CAN_MCR_NOTRDY_MASK: u32 = 134217728;
pub const CAN_MCR_NOTRDY_SHIFT: u32 = 27;
pub const CAN_MCR_HALT_MASK: u32 = 268435456;
pub const CAN_MCR_HALT_SHIFT: u32 = 28;
pub const CAN_MCR_RFEN_MASK: u32 = 536870912;
pub const CAN_MCR_RFEN_SHIFT: u32 = 29;
pub const CAN_MCR_FRZ_MASK: u32 = 1073741824;
pub const CAN_MCR_FRZ_SHIFT: u32 = 30;
pub const CAN_MCR_MDIS_MASK: u32 = 2147483648;
pub const CAN_MCR_MDIS_SHIFT: u32 = 31;
pub const CAN_CTRL1_PROPSEG_MASK: u32 = 7;
pub const CAN_CTRL1_PROPSEG_SHIFT: u32 = 0;
pub const CAN_CTRL1_LOM_MASK: u32 = 8;
pub const CAN_CTRL1_LOM_SHIFT: u32 = 3;
pub const CAN_CTRL1_LBUF_MASK: u32 = 16;
pub const CAN_CTRL1_LBUF_SHIFT: u32 = 4;
pub const CAN_CTRL1_TSYN_MASK: u32 = 32;
pub const CAN_CTRL1_TSYN_SHIFT: u32 = 5;
pub const CAN_CTRL1_BOFFREC_MASK: u32 = 64;
pub const CAN_CTRL1_BOFFREC_SHIFT: u32 = 6;
pub const CAN_CTRL1_SMP_MASK: u32 = 128;
pub const CAN_CTRL1_SMP_SHIFT: u32 = 7;
pub const CAN_CTRL1_RWRNMSK_MASK: u32 = 1024;
pub const CAN_CTRL1_RWRNMSK_SHIFT: u32 = 10;
pub const CAN_CTRL1_TWRNMSK_MASK: u32 = 2048;
pub const CAN_CTRL1_TWRNMSK_SHIFT: u32 = 11;
pub const CAN_CTRL1_LPB_MASK: u32 = 4096;
pub const CAN_CTRL1_LPB_SHIFT: u32 = 12;
pub const CAN_CTRL1_CLKSRC_MASK: u32 = 8192;
pub const CAN_CTRL1_CLKSRC_SHIFT: u32 = 13;
pub const CAN_CTRL1_ERRMSK_MASK: u32 = 16384;
pub const CAN_CTRL1_ERRMSK_SHIFT: u32 = 14;
pub const CAN_CTRL1_BOFFMSK_MASK: u32 = 32768;
pub const CAN_CTRL1_BOFFMSK_SHIFT: u32 = 15;
pub const CAN_CTRL1_PSEG2_MASK: u32 = 458752;
pub const CAN_CTRL1_PSEG2_SHIFT: u32 = 16;
pub const CAN_CTRL1_PSEG1_MASK: u32 = 3670016;
pub const CAN_CTRL1_PSEG1_SHIFT: u32 = 19;
pub const CAN_CTRL1_RJW_MASK: u32 = 12582912;
pub const CAN_CTRL1_RJW_SHIFT: u32 = 22;
pub const CAN_CTRL1_PRESDIV_MASK: u32 = 4278190080;
pub const CAN_CTRL1_PRESDIV_SHIFT: u32 = 24;
pub const CAN_TIMER_TIMER_MASK: u32 = 65535;
pub const CAN_TIMER_TIMER_SHIFT: u32 = 0;
pub const CAN_RXMGMASK_MG_MASK: u32 = 4294967295;
pub const CAN_RXMGMASK_MG_SHIFT: u32 = 0;
pub const CAN_RX14MASK_RX14M_MASK: u32 = 4294967295;
pub const CAN_RX14MASK_RX14M_SHIFT: u32 = 0;
pub const CAN_RX15MASK_RX15M_MASK: u32 = 4294967295;
pub const CAN_RX15MASK_RX15M_SHIFT: u32 = 0;
pub const CAN_ECR_TXERRCNT_MASK: u32 = 255;
pub const CAN_ECR_TXERRCNT_SHIFT: u32 = 0;
pub const CAN_ECR_RXERRCNT_MASK: u32 = 65280;
pub const CAN_ECR_RXERRCNT_SHIFT: u32 = 8;
pub const CAN_ESR1_WAKINT_MASK: u32 = 1;
pub const CAN_ESR1_WAKINT_SHIFT: u32 = 0;
pub const CAN_ESR1_ERRINT_MASK: u32 = 2;
pub const CAN_ESR1_ERRINT_SHIFT: u32 = 1;
pub const CAN_ESR1_BOFFINT_MASK: u32 = 4;
pub const CAN_ESR1_BOFFINT_SHIFT: u32 = 2;
pub const CAN_ESR1_RX_MASK: u32 = 8;
pub const CAN_ESR1_RX_SHIFT: u32 = 3;
pub const CAN_ESR1_FLTCONF_MASK: u32 = 48;
pub const CAN_ESR1_FLTCONF_SHIFT: u32 = 4;
pub const CAN_ESR1_TX_MASK: u32 = 64;
pub const CAN_ESR1_TX_SHIFT: u32 = 6;
pub const CAN_ESR1_IDLE_MASK: u32 = 128;
pub const CAN_ESR1_IDLE_SHIFT: u32 = 7;
pub const CAN_ESR1_RXWRN_MASK: u32 = 256;
pub const CAN_ESR1_RXWRN_SHIFT: u32 = 8;
pub const CAN_ESR1_TXWRN_MASK: u32 = 512;
pub const CAN_ESR1_TXWRN_SHIFT: u32 = 9;
pub const CAN_ESR1_STFERR_MASK: u32 = 1024;
pub const CAN_ESR1_STFERR_SHIFT: u32 = 10;
pub const CAN_ESR1_FRMERR_MASK: u32 = 2048;
pub const CAN_ESR1_FRMERR_SHIFT: u32 = 11;
pub const CAN_ESR1_CRCERR_MASK: u32 = 4096;
pub const CAN_ESR1_CRCERR_SHIFT: u32 = 12;
pub const CAN_ESR1_ACKERR_MASK: u32 = 8192;
pub const CAN_ESR1_ACKERR_SHIFT: u32 = 13;
pub const CAN_ESR1_BIT0ERR_MASK: u32 = 16384;
pub const CAN_ESR1_BIT0ERR_SHIFT: u32 = 14;
pub const CAN_ESR1_BIT1ERR_MASK: u32 = 32768;
pub const CAN_ESR1_BIT1ERR_SHIFT: u32 = 15;
pub const CAN_ESR1_RWRNINT_MASK: u32 = 65536;
pub const CAN_ESR1_RWRNINT_SHIFT: u32 = 16;
pub const CAN_ESR1_TWRNINT_MASK: u32 = 131072;
pub const CAN_ESR1_TWRNINT_SHIFT: u32 = 17;
pub const CAN_ESR1_SYNCH_MASK: u32 = 262144;
pub const CAN_ESR1_SYNCH_SHIFT: u32 = 18;
pub const CAN_IMASK1_BUFLM_MASK: u32 = 4294967295;
pub const CAN_IMASK1_BUFLM_SHIFT: u32 = 0;
pub const CAN_IFLAG1_BUF0I_MASK: u32 = 1;
pub const CAN_IFLAG1_BUF0I_SHIFT: u32 = 0;
pub const CAN_IFLAG1_BUF4TO1I_MASK: u32 = 30;
pub const CAN_IFLAG1_BUF4TO1I_SHIFT: u32 = 1;
pub const CAN_IFLAG1_BUF5I_MASK: u32 = 32;
pub const CAN_IFLAG1_BUF5I_SHIFT: u32 = 5;
pub const CAN_IFLAG1_BUF6I_MASK: u32 = 64;
pub const CAN_IFLAG1_BUF6I_SHIFT: u32 = 6;
pub const CAN_IFLAG1_BUF7I_MASK: u32 = 128;
pub const CAN_IFLAG1_BUF7I_SHIFT: u32 = 7;
pub const CAN_IFLAG1_BUF31TO8I_MASK: u32 = 4294967040;
pub const CAN_IFLAG1_BUF31TO8I_SHIFT: u32 = 8;
pub const CAN_CTRL2_EACEN_MASK: u32 = 65536;
pub const CAN_CTRL2_EACEN_SHIFT: u32 = 16;
pub const CAN_CTRL2_RRS_MASK: u32 = 131072;
pub const CAN_CTRL2_RRS_SHIFT: u32 = 17;
pub const CAN_CTRL2_MRP_MASK: u32 = 262144;
pub const CAN_CTRL2_MRP_SHIFT: u32 = 18;
pub const CAN_CTRL2_TASD_MASK: u32 = 16252928;
pub const CAN_CTRL2_TASD_SHIFT: u32 = 19;
pub const CAN_CTRL2_RFFN_MASK: u32 = 251658240;
pub const CAN_CTRL2_RFFN_SHIFT: u32 = 24;
pub const CAN_CTRL2_WRMFRZ_MASK: u32 = 268435456;
pub const CAN_CTRL2_WRMFRZ_SHIFT: u32 = 28;
pub const CAN_ESR2_IMB_MASK: u32 = 8192;
pub const CAN_ESR2_IMB_SHIFT: u32 = 13;
pub const CAN_ESR2_VPS_MASK: u32 = 16384;
pub const CAN_ESR2_VPS_SHIFT: u32 = 14;
pub const CAN_ESR2_LPTM_MASK: u32 = 8323072;
pub const CAN_ESR2_LPTM_SHIFT: u32 = 16;
pub const CAN_CRCR_TXCRC_MASK: u32 = 32767;
pub const CAN_CRCR_TXCRC_SHIFT: u32 = 0;
pub const CAN_CRCR_MBCRC_MASK: u32 = 8323072;
pub const CAN_CRCR_MBCRC_SHIFT: u32 = 16;
pub const CAN_RXFGMASK_FGM_MASK: u32 = 4294967295;
pub const CAN_RXFGMASK_FGM_SHIFT: u32 = 0;
pub const CAN_RXFIR_IDHIT_MASK: u32 = 511;
pub const CAN_RXFIR_IDHIT_SHIFT: u32 = 0;
pub const CAN_CS_TIME_STAMP_MASK: u32 = 65535;
pub const CAN_CS_TIME_STAMP_SHIFT: u32 = 0;
pub const CAN_CS_DLC_MASK: u32 = 983040;
pub const CAN_CS_DLC_SHIFT: u32 = 16;
pub const CAN_CS_RTR_MASK: u32 = 1048576;
pub const CAN_CS_RTR_SHIFT: u32 = 20;
pub const CAN_CS_IDE_MASK: u32 = 2097152;
pub const CAN_CS_IDE_SHIFT: u32 = 21;
pub const CAN_CS_SRR_MASK: u32 = 4194304;
pub const CAN_CS_SRR_SHIFT: u32 = 22;
pub const CAN_CS_CODE_MASK: u32 = 251658240;
pub const CAN_CS_CODE_SHIFT: u32 = 24;
pub const CAN_CS_COUNT: u32 = 16;
pub const CAN_ID_EXT_MASK: u32 = 262143;
pub const CAN_ID_EXT_SHIFT: u32 = 0;
pub const CAN_ID_STD_MASK: u32 = 536608768;
pub const CAN_ID_STD_SHIFT: u32 = 18;
pub const CAN_ID_PRIO_MASK: u32 = 3758096384;
pub const CAN_ID_PRIO_SHIFT: u32 = 29;
pub const CAN_ID_COUNT: u32 = 16;
pub const CAN_WORD0_DATA_BYTE_3_MASK: u32 = 255;
pub const CAN_WORD0_DATA_BYTE_3_SHIFT: u32 = 0;
pub const CAN_WORD0_DATA_BYTE_2_MASK: u32 = 65280;
pub const CAN_WORD0_DATA_BYTE_2_SHIFT: u32 = 8;
pub const CAN_WORD0_DATA_BYTE_1_MASK: u32 = 16711680;
pub const CAN_WORD0_DATA_BYTE_1_SHIFT: u32 = 16;
pub const CAN_WORD0_DATA_BYTE_0_MASK: u32 = 4278190080;
pub const CAN_WORD0_DATA_BYTE_0_SHIFT: u32 = 24;
pub const CAN_WORD0_COUNT: u32 = 16;
pub const CAN_WORD1_DATA_BYTE_7_MASK: u32 = 255;
pub const CAN_WORD1_DATA_BYTE_7_SHIFT: u32 = 0;
pub const CAN_WORD1_DATA_BYTE_6_MASK: u32 = 65280;
pub const CAN_WORD1_DATA_BYTE_6_SHIFT: u32 = 8;
pub const CAN_WORD1_DATA_BYTE_5_MASK: u32 = 16711680;
pub const CAN_WORD1_DATA_BYTE_5_SHIFT: u32 = 16;
pub const CAN_WORD1_DATA_BYTE_4_MASK: u32 = 4278190080;
pub const CAN_WORD1_DATA_BYTE_4_SHIFT: u32 = 24;
pub const CAN_WORD1_COUNT: u32 = 16;
pub const CAN_RXIMR_MI_MASK: u32 = 4294967295;
pub const CAN_RXIMR_MI_SHIFT: u32 = 0;
pub const CAN_RXIMR_COUNT: u32 = 16;
pub const CAN0_BASE: u32 = 1073889280;
#[doc = " CAU - Register Layout Typedef"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CAU_Type {
    #[doc = "< Direct access register 0..Direct access register 15, array offset: 0x0, array step: 0x4"]
    pub DIRECT: [u32; 16usize],
    pub RESERVED_0: [u8; 2048usize],
    #[doc = "< Status register - Load Register command, offset: 0x840"]
    pub LDR_CASR: u32,
    #[doc = "< Accumulator register - Load Register command, offset: 0x844"]
    pub LDR_CAA: u32,
    #[doc = "< General Purpose Register 0 - Load Register command..General Purpose Register 8 - Load Register command, array offset: 0x848, array step: 0x4"]
    pub LDR_CA: [u32; 9usize],
    pub RESERVED_1: [u8; 20usize],
    #[doc = "< Status register - Store Register command, offset: 0x880"]
    pub STR_CASR: u32,
    #[doc = "< Accumulator register - Store Register command, offset: 0x884"]
    pub STR_CAA: u32,
    #[doc = "< General Purpose Register 0 - Store Register command..General Purpose Register 8 - Store Register command, array offset: 0x888, array step: 0x4"]
    pub STR_CA: [u32; 9usize],
    pub RESERVED_2: [u8; 20usize],
    #[doc = "< Status register - Add Register command, offset: 0x8C0"]
    pub ADR_CASR: u32,
    #[doc = "< Accumulator register - Add to register command, offset: 0x8C4"]
    pub ADR_CAA: u32,
    #[doc = "< General Purpose Register 0 - Add to register command..General Purpose Register 8 - Add to register command, array offset: 0x8C8, array step: 0x4"]
    pub ADR_CA: [u32; 9usize],
    pub RESERVED_3: [u8; 20usize],
    #[doc = "< Status register - Reverse and Add to Register command, offset: 0x900"]
    pub RADR_CASR: u32,
    #[doc = "< Accumulator register - Reverse and Add to Register command, offset: 0x904"]
    pub RADR_CAA: u32,
    #[doc = "< General Purpose Register 0 - Reverse and Add to Register command..General Purpose Register 8 - Reverse and Add to Register command, array offset: 0x908, array step: 0x4"]
    pub RADR_CA: [u32; 9usize],
    pub RESERVED_4: [u8; 84usize],
    #[doc = "< Status register - Exclusive Or command, offset: 0x980"]
    pub XOR_CASR: u32,
    #[doc = "< Accumulator register - Exclusive Or command, offset: 0x984"]
    pub XOR_CAA: u32,
    #[doc = "< General Purpose Register 0 - Exclusive Or command..General Purpose Register 8 - Exclusive Or command, array offset: 0x988, array step: 0x4"]
    pub XOR_CA: [u32; 9usize],
    pub RESERVED_5: [u8; 20usize],
    #[doc = "< Status register - Rotate Left command, offset: 0x9C0"]
    pub ROTL_CASR: u32,
    #[doc = "< Accumulator register - Rotate Left command, offset: 0x9C4"]
    pub ROTL_CAA: u32,
    #[doc = "< General Purpose Register 0 - Rotate Left command..General Purpose Register 8 - Rotate Left command, array offset: 0x9C8, array step: 0x4"]
    pub ROTL_CA: [u32; 9usize],
    pub RESERVED_6: [u8; 276usize],
    #[doc = "< Status register - AES Column Operation command, offset: 0xB00"]
    pub AESC_CASR: u32,
    #[doc = "< Accumulator register - AES Column Operation command, offset: 0xB04"]
    pub AESC_CAA: u32,
    #[doc = "< General Purpose Register 0 - AES Column Operation command..General Purpose Register 8 - AES Column Operation command, array offset: 0xB08, array step: 0x4"]
    pub AESC_CA: [u32; 9usize],
    pub RESERVED_7: [u8; 20usize],
    #[doc = "< Status register - AES Inverse Column Operation command, offset: 0xB40"]
    pub AESIC_CASR: u32,
    #[doc = "< Accumulator register - AES Inverse Column Operation command, offset: 0xB44"]
    pub AESIC_CAA: u32,
    #[doc = "< General Purpose Register 0 - AES Inverse Column Operation command..General Purpose Register 8 - AES Inverse Column Operation command, array offset: 0xB48, array step: 0x4"]
    pub AESIC_CA: [u32; 9usize],
}
#[test]
fn bindgen_test_layout_CAU_Type() {
    const UNINIT: ::std::mem::MaybeUninit<CAU_Type> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<CAU_Type>(),
        2924usize,
        concat!("Size of: ", stringify!(CAU_Type))
    );
    assert_eq!(
        ::std::mem::align_of::<CAU_Type>(),
        4usize,
        concat!("Alignment of ", stringify!(CAU_Type))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).DIRECT) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(CAU_Type),
            "::",
            stringify!(DIRECT)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).RESERVED_0) as usize - ptr as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(CAU_Type),
            "::",
            stringify!(RESERVED_0)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).LDR_CASR) as usize - ptr as usize },
        2112usize,
        concat!(
            "Offset of field: ",
            stringify!(CAU_Type),
            "::",
            stringify!(LDR_CASR)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).LDR_CAA) as usize - ptr as usize },
        2116usize,
        concat!(
            "Offset of field: ",
            stringify!(CAU_Type),
            "::",
            stringify!(LDR_CAA)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).LDR_CA) as usize - ptr as usize },
        2120usize,
        concat!(
            "Offset of field: ",
            stringify!(CAU_Type),
            "::",
            stringify!(LDR_CA)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).RESERVED_1) as usize - ptr as usize },
        2156usize,
        concat!(
            "Offset of field: ",
            stringify!(CAU_Type),
            "::",
            stringify!(RESERVED_1)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).STR_CASR) as usize - ptr as usize },
        2176usize,
        concat!(
            "Offset of field: ",
            stringify!(CAU_Type),
            "::",
            stringify!(STR_CASR)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).STR_CAA) as usize - ptr as usize },
        2180usize,
        concat!(
            "Offset of field: ",
            stringify!(CAU_Type),
            "::",
            stringify!(STR_CAA)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).STR_CA) as usize - ptr as usize },
        2184usize,
        concat!(
            "Offset of field: ",
            stringify!(CAU_Type),
            "::",
            stringify!(STR_CA)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).RESERVED_2) as usize - ptr as usize },
        2220usize,
        concat!(
            "Offset of field: ",
            stringify!(CAU_Type),
            "::",
            stringify!(RESERVED_2)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ADR_CASR) as usize - ptr as usize },
        2240usize,
        concat!(
            "Offset of field: ",
            stringify!(CAU_Type),
            "::",
            stringify!(ADR_CASR)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ADR_CAA) as usize - ptr as usize },
        2244usize,
        concat!(
            "Offset of field: ",
            stringify!(CAU_Type),
            "::",
            stringify!(ADR_CAA)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ADR_CA) as usize - ptr as usize },
        2248usize,
        concat!(
            "Offset of field: ",
            stringify!(CAU_Type),
            "::",
            stringify!(ADR_CA)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).RESERVED_3) as usize - ptr as usize },
        2284usize,
        concat!(
            "Offset of field: ",
            stringify!(CAU_Type),
            "::",
            stringify!(RESERVED_3)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).RADR_CASR) as usize - ptr as usize },
        2304usize,
        concat!(
            "Offset of field: ",
            stringify!(CAU_Type),
            "::",
            stringify!(RADR_CASR)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).RADR_CAA) as usize - ptr as usize },
        2308usize,
        concat!(
            "Offset of field: ",
            stringify!(CAU_Type),
            "::",
            stringify!(RADR_CAA)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).RADR_CA) as usize - ptr as usize },
        2312usize,
        concat!(
            "Offset of field: ",
            stringify!(CAU_Type),
            "::",
            stringify!(RADR_CA)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).RESERVED_4) as usize - ptr as usize },
        2348usize,
        concat!(
            "Offset of field: ",
            stringify!(CAU_Type),
            "::",
            stringify!(RESERVED_4)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).XOR_CASR) as usize - ptr as usize },
        2432usize,
        concat!(
            "Offset of field: ",
            stringify!(CAU_Type),
            "::",
            stringify!(XOR_CASR)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).XOR_CAA) as usize - ptr as usize },
        2436usize,
        concat!(
            "Offset of field: ",
            stringify!(CAU_Type),
            "::",
            stringify!(XOR_CAA)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).XOR_CA) as usize - ptr as usize },
        2440usize,
        concat!(
            "Offset of field: ",
            stringify!(CAU_Type),
            "::",
            stringify!(XOR_CA)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).RESERVED_5) as usize - ptr as usize },
        2476usize,
        concat!(
            "Offset of field: ",
            stringify!(CAU_Type),
            "::",
            stringify!(RESERVED_5)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ROTL_CASR) as usize - ptr as usize },
        2496usize,
        concat!(
            "Offset of field: ",
            stringify!(CAU_Type),
            "::",
            stringify!(ROTL_CASR)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ROTL_CAA) as usize - ptr as usize },
        2500usize,
        concat!(
            "Offset of field: ",
            stringify!(CAU_Type),
            "::",
            stringify!(ROTL_CAA)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ROTL_CA) as usize - ptr as usize },
        2504usize,
        concat!(
            "Offset of field: ",
            stringify!(CAU_Type),
            "::",
            stringify!(ROTL_CA)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).RESERVED_6) as usize - ptr as usize },
        2540usize,
        concat!(
            "Offset of field: ",
            stringify!(CAU_Type),
            "::",
            stringify!(RESERVED_6)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).AESC_CASR) as usize - ptr as usize },
        2816usize,
        concat!(
            "Offset of field: ",
            stringify!(CAU_Type),
            "::",
            stringify!(AESC_CASR)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).AESC_CAA) as usize - ptr as usize },
        2820usize,
        concat!(
            "Offset of field: ",
            stringify!(CAU_Type),
            "::",
            stringify!(AESC_CAA)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).AESC_CA) as usize - ptr as usize },
        2824usize,
        concat!(
            "Offset of field: ",
            stringify!(CAU_Type),
            "::",
            stringify!(AESC_CA)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).RESERVED_7) as usize - ptr as usize },
        2860usize,
        concat!(
            "Offset of field: ",
            stringify!(CAU_Type),
            "::",
            stringify!(RESERVED_7)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).AESIC_CASR) as usize - ptr as usize },
        2880usize,
        concat!(
            "Offset of field: ",
            stringify!(CAU_Type),
            "::",
            stringify!(AESIC_CASR)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).AESIC_CAA) as usize - ptr as usize },
        2884usize,
        concat!(
            "Offset of field: ",
            stringify!(CAU_Type),
            "::",
            stringify!(AESIC_CAA)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).AESIC_CA) as usize - ptr as usize },
        2888usize,
        concat!(
            "Offset of field: ",
            stringify!(CAU_Type),
            "::",
            stringify!(AESIC_CA)
        )
    );
}
pub const CAU_DIRECT_CAU_DIRECT0_MASK: u32 = 4294967295;
pub const CAU_DIRECT_CAU_DIRECT0_SHIFT: u32 = 0;
pub const CAU_DIRECT_CAU_DIRECT1_MASK: u32 = 4294967295;
pub const CAU_DIRECT_CAU_DIRECT1_SHIFT: u32 = 0;
pub const CAU_DIRECT_CAU_DIRECT2_MASK: u32 = 4294967295;
pub const CAU_DIRECT_CAU_DIRECT2_SHIFT: u32 = 0;
pub const CAU_DIRECT_CAU_DIRECT3_MASK: u32 = 4294967295;
pub const CAU_DIRECT_CAU_DIRECT3_SHIFT: u32 = 0;
pub const CAU_DIRECT_CAU_DIRECT4_MASK: u32 = 4294967295;
pub const CAU_DIRECT_CAU_DIRECT4_SHIFT: u32 = 0;
pub const CAU_DIRECT_CAU_DIRECT5_MASK: u32 = 4294967295;
pub const CAU_DIRECT_CAU_DIRECT5_SHIFT: u32 = 0;
pub const CAU_DIRECT_CAU_DIRECT6_MASK: u32 = 4294967295;
pub const CAU_DIRECT_CAU_DIRECT6_SHIFT: u32 = 0;
pub const CAU_DIRECT_CAU_DIRECT7_MASK: u32 = 4294967295;
pub const CAU_DIRECT_CAU_DIRECT7_SHIFT: u32 = 0;
pub const CAU_DIRECT_CAU_DIRECT8_MASK: u32 = 4294967295;
pub const CAU_DIRECT_CAU_DIRECT8_SHIFT: u32 = 0;
pub const CAU_DIRECT_CAU_DIRECT9_MASK: u32 = 4294967295;
pub const CAU_DIRECT_CAU_DIRECT9_SHIFT: u32 = 0;
pub const CAU_DIRECT_CAU_DIRECT10_MASK: u32 = 4294967295;
pub const CAU_DIRECT_CAU_DIRECT10_SHIFT: u32 = 0;
pub const CAU_DIRECT_CAU_DIRECT11_MASK: u32 = 4294967295;
pub const CAU_DIRECT_CAU_DIRECT11_SHIFT: u32 = 0;
pub const CAU_DIRECT_CAU_DIRECT12_MASK: u32 = 4294967295;
pub const CAU_DIRECT_CAU_DIRECT12_SHIFT: u32 = 0;
pub const CAU_DIRECT_CAU_DIRECT13_MASK: u32 = 4294967295;
pub const CAU_DIRECT_CAU_DIRECT13_SHIFT: u32 = 0;
pub const CAU_DIRECT_CAU_DIRECT14_MASK: u32 = 4294967295;
pub const CAU_DIRECT_CAU_DIRECT14_SHIFT: u32 = 0;
pub const CAU_DIRECT_CAU_DIRECT15_MASK: u32 = 4294967295;
pub const CAU_DIRECT_CAU_DIRECT15_SHIFT: u32 = 0;
pub const CAU_DIRECT_COUNT: u32 = 16;
pub const CAU_LDR_CASR_IC_MASK: u32 = 1;
pub const CAU_LDR_CASR_IC_SHIFT: u32 = 0;
pub const CAU_LDR_CASR_DPE_MASK: u32 = 2;
pub const CAU_LDR_CASR_DPE_SHIFT: u32 = 1;
pub const CAU_LDR_CASR_VER_MASK: u32 = 4026531840;
pub const CAU_LDR_CASR_VER_SHIFT: u32 = 28;
pub const CAU_LDR_CAA_ACC_MASK: u32 = 4294967295;
pub const CAU_LDR_CAA_ACC_SHIFT: u32 = 0;
pub const CAU_LDR_CA_CA0_MASK: u32 = 4294967295;
pub const CAU_LDR_CA_CA0_SHIFT: u32 = 0;
pub const CAU_LDR_CA_CA1_MASK: u32 = 4294967295;
pub const CAU_LDR_CA_CA1_SHIFT: u32 = 0;
pub const CAU_LDR_CA_CA2_MASK: u32 = 4294967295;
pub const CAU_LDR_CA_CA2_SHIFT: u32 = 0;
pub const CAU_LDR_CA_CA3_MASK: u32 = 4294967295;
pub const CAU_LDR_CA_CA3_SHIFT: u32 = 0;
pub const CAU_LDR_CA_CA4_MASK: u32 = 4294967295;
pub const CAU_LDR_CA_CA4_SHIFT: u32 = 0;
pub const CAU_LDR_CA_CA5_MASK: u32 = 4294967295;
pub const CAU_LDR_CA_CA5_SHIFT: u32 = 0;
pub const CAU_LDR_CA_CA6_MASK: u32 = 4294967295;
pub const CAU_LDR_CA_CA6_SHIFT: u32 = 0;
pub const CAU_LDR_CA_CA7_MASK: u32 = 4294967295;
pub const CAU_LDR_CA_CA7_SHIFT: u32 = 0;
pub const CAU_LDR_CA_CA8_MASK: u32 = 4294967295;
pub const CAU_LDR_CA_CA8_SHIFT: u32 = 0;
pub const CAU_LDR_CA_COUNT: u32 = 9;
pub const CAU_STR_CASR_IC_MASK: u32 = 1;
pub const CAU_STR_CASR_IC_SHIFT: u32 = 0;
pub const CAU_STR_CASR_DPE_MASK: u32 = 2;
pub const CAU_STR_CASR_DPE_SHIFT: u32 = 1;
pub const CAU_STR_CASR_VER_MASK: u32 = 4026531840;
pub const CAU_STR_CASR_VER_SHIFT: u32 = 28;
pub const CAU_STR_CAA_ACC_MASK: u32 = 4294967295;
pub const CAU_STR_CAA_ACC_SHIFT: u32 = 0;
pub const CAU_STR_CA_CA0_MASK: u32 = 4294967295;
pub const CAU_STR_CA_CA0_SHIFT: u32 = 0;
pub const CAU_STR_CA_CA1_MASK: u32 = 4294967295;
pub const CAU_STR_CA_CA1_SHIFT: u32 = 0;
pub const CAU_STR_CA_CA2_MASK: u32 = 4294967295;
pub const CAU_STR_CA_CA2_SHIFT: u32 = 0;
pub const CAU_STR_CA_CA3_MASK: u32 = 4294967295;
pub const CAU_STR_CA_CA3_SHIFT: u32 = 0;
pub const CAU_STR_CA_CA4_MASK: u32 = 4294967295;
pub const CAU_STR_CA_CA4_SHIFT: u32 = 0;
pub const CAU_STR_CA_CA5_MASK: u32 = 4294967295;
pub const CAU_STR_CA_CA5_SHIFT: u32 = 0;
pub const CAU_STR_CA_CA6_MASK: u32 = 4294967295;
pub const CAU_STR_CA_CA6_SHIFT: u32 = 0;
pub const CAU_STR_CA_CA7_MASK: u32 = 4294967295;
pub const CAU_STR_CA_CA7_SHIFT: u32 = 0;
pub const CAU_STR_CA_CA8_MASK: u32 = 4294967295;
pub const CAU_STR_CA_CA8_SHIFT: u32 = 0;
pub const CAU_STR_CA_COUNT: u32 = 9;
pub const CAU_ADR_CASR_IC_MASK: u32 = 1;
pub const CAU_ADR_CASR_IC_SHIFT: u32 = 0;
pub const CAU_ADR_CASR_DPE_MASK: u32 = 2;
pub const CAU_ADR_CASR_DPE_SHIFT: u32 = 1;
pub const CAU_ADR_CASR_VER_MASK: u32 = 4026531840;
pub const CAU_ADR_CASR_VER_SHIFT: u32 = 28;
pub const CAU_ADR_CAA_ACC_MASK: u32 = 4294967295;
pub const CAU_ADR_CAA_ACC_SHIFT: u32 = 0;
pub const CAU_ADR_CA_CA0_MASK: u32 = 4294967295;
pub const CAU_ADR_CA_CA0_SHIFT: u32 = 0;
pub const CAU_ADR_CA_CA1_MASK: u32 = 4294967295;
pub const CAU_ADR_CA_CA1_SHIFT: u32 = 0;
pub const CAU_ADR_CA_CA2_MASK: u32 = 4294967295;
pub const CAU_ADR_CA_CA2_SHIFT: u32 = 0;
pub const CAU_ADR_CA_CA3_MASK: u32 = 4294967295;
pub const CAU_ADR_CA_CA3_SHIFT: u32 = 0;
pub const CAU_ADR_CA_CA4_MASK: u32 = 4294967295;
pub const CAU_ADR_CA_CA4_SHIFT: u32 = 0;
pub const CAU_ADR_CA_CA5_MASK: u32 = 4294967295;
pub const CAU_ADR_CA_CA5_SHIFT: u32 = 0;
pub const CAU_ADR_CA_CA6_MASK: u32 = 4294967295;
pub const CAU_ADR_CA_CA6_SHIFT: u32 = 0;
pub const CAU_ADR_CA_CA7_MASK: u32 = 4294967295;
pub const CAU_ADR_CA_CA7_SHIFT: u32 = 0;
pub const CAU_ADR_CA_CA8_MASK: u32 = 4294967295;
pub const CAU_ADR_CA_CA8_SHIFT: u32 = 0;
pub const CAU_ADR_CA_COUNT: u32 = 9;
pub const CAU_RADR_CASR_IC_MASK: u32 = 1;
pub const CAU_RADR_CASR_IC_SHIFT: u32 = 0;
pub const CAU_RADR_CASR_DPE_MASK: u32 = 2;
pub const CAU_RADR_CASR_DPE_SHIFT: u32 = 1;
pub const CAU_RADR_CASR_VER_MASK: u32 = 4026531840;
pub const CAU_RADR_CASR_VER_SHIFT: u32 = 28;
pub const CAU_RADR_CAA_ACC_MASK: u32 = 4294967295;
pub const CAU_RADR_CAA_ACC_SHIFT: u32 = 0;
pub const CAU_RADR_CA_CA0_MASK: u32 = 4294967295;
pub const CAU_RADR_CA_CA0_SHIFT: u32 = 0;
pub const CAU_RADR_CA_CA1_MASK: u32 = 4294967295;
pub const CAU_RADR_CA_CA1_SHIFT: u32 = 0;
pub const CAU_RADR_CA_CA2_MASK: u32 = 4294967295;
pub const CAU_RADR_CA_CA2_SHIFT: u32 = 0;
pub const CAU_RADR_CA_CA3_MASK: u32 = 4294967295;
pub const CAU_RADR_CA_CA3_SHIFT: u32 = 0;
pub const CAU_RADR_CA_CA4_MASK: u32 = 4294967295;
pub const CAU_RADR_CA_CA4_SHIFT: u32 = 0;
pub const CAU_RADR_CA_CA5_MASK: u32 = 4294967295;
pub const CAU_RADR_CA_CA5_SHIFT: u32 = 0;
pub const CAU_RADR_CA_CA6_MASK: u32 = 4294967295;
pub const CAU_RADR_CA_CA6_SHIFT: u32 = 0;
pub const CAU_RADR_CA_CA7_MASK: u32 = 4294967295;
pub const CAU_RADR_CA_CA7_SHIFT: u32 = 0;
pub const CAU_RADR_CA_CA8_MASK: u32 = 4294967295;
pub const CAU_RADR_CA_CA8_SHIFT: u32 = 0;
pub const CAU_RADR_CA_COUNT: u32 = 9;
pub const CAU_XOR_CASR_IC_MASK: u32 = 1;
pub const CAU_XOR_CASR_IC_SHIFT: u32 = 0;
pub const CAU_XOR_CASR_DPE_MASK: u32 = 2;
pub const CAU_XOR_CASR_DPE_SHIFT: u32 = 1;
pub const CAU_XOR_CASR_VER_MASK: u32 = 4026531840;
pub const CAU_XOR_CASR_VER_SHIFT: u32 = 28;
pub const CAU_XOR_CAA_ACC_MASK: u32 = 4294967295;
pub const CAU_XOR_CAA_ACC_SHIFT: u32 = 0;
pub const CAU_XOR_CA_CA0_MASK: u32 = 4294967295;
pub const CAU_XOR_CA_CA0_SHIFT: u32 = 0;
pub const CAU_XOR_CA_CA1_MASK: u32 = 4294967295;
pub const CAU_XOR_CA_CA1_SHIFT: u32 = 0;
pub const CAU_XOR_CA_CA2_MASK: u32 = 4294967295;
pub const CAU_XOR_CA_CA2_SHIFT: u32 = 0;
pub const CAU_XOR_CA_CA3_MASK: u32 = 4294967295;
pub const CAU_XOR_CA_CA3_SHIFT: u32 = 0;
pub const CAU_XOR_CA_CA4_MASK: u32 = 4294967295;
pub const CAU_XOR_CA_CA4_SHIFT: u32 = 0;
pub const CAU_XOR_CA_CA5_MASK: u32 = 4294967295;
pub const CAU_XOR_CA_CA5_SHIFT: u32 = 0;
pub const CAU_XOR_CA_CA6_MASK: u32 = 4294967295;
pub const CAU_XOR_CA_CA6_SHIFT: u32 = 0;
pub const CAU_XOR_CA_CA7_MASK: u32 = 4294967295;
pub const CAU_XOR_CA_CA7_SHIFT: u32 = 0;
pub const CAU_XOR_CA_CA8_MASK: u32 = 4294967295;
pub const CAU_XOR_CA_CA8_SHIFT: u32 = 0;
pub const CAU_XOR_CA_COUNT: u32 = 9;
pub const CAU_ROTL_CASR_IC_MASK: u32 = 1;
pub const CAU_ROTL_CASR_IC_SHIFT: u32 = 0;
pub const CAU_ROTL_CASR_DPE_MASK: u32 = 2;
pub const CAU_ROTL_CASR_DPE_SHIFT: u32 = 1;
pub const CAU_ROTL_CASR_VER_MASK: u32 = 4026531840;
pub const CAU_ROTL_CASR_VER_SHIFT: u32 = 28;
pub const CAU_ROTL_CAA_ACC_MASK: u32 = 4294967295;
pub const CAU_ROTL_CAA_ACC_SHIFT: u32 = 0;
pub const CAU_ROTL_CA_CA0_MASK: u32 = 4294967295;
pub const CAU_ROTL_CA_CA0_SHIFT: u32 = 0;
pub const CAU_ROTL_CA_CA1_MASK: u32 = 4294967295;
pub const CAU_ROTL_CA_CA1_SHIFT: u32 = 0;
pub const CAU_ROTL_CA_CA2_MASK: u32 = 4294967295;
pub const CAU_ROTL_CA_CA2_SHIFT: u32 = 0;
pub const CAU_ROTL_CA_CA3_MASK: u32 = 4294967295;
pub const CAU_ROTL_CA_CA3_SHIFT: u32 = 0;
pub const CAU_ROTL_CA_CA4_MASK: u32 = 4294967295;
pub const CAU_ROTL_CA_CA4_SHIFT: u32 = 0;
pub const CAU_ROTL_CA_CA5_MASK: u32 = 4294967295;
pub const CAU_ROTL_CA_CA5_SHIFT: u32 = 0;
pub const CAU_ROTL_CA_CA6_MASK: u32 = 4294967295;
pub const CAU_ROTL_CA_CA6_SHIFT: u32 = 0;
pub const CAU_ROTL_CA_CA7_MASK: u32 = 4294967295;
pub const CAU_ROTL_CA_CA7_SHIFT: u32 = 0;
pub const CAU_ROTL_CA_CA8_MASK: u32 = 4294967295;
pub const CAU_ROTL_CA_CA8_SHIFT: u32 = 0;
pub const CAU_ROTL_CA_COUNT: u32 = 9;
pub const CAU_AESC_CASR_IC_MASK: u32 = 1;
pub const CAU_AESC_CASR_IC_SHIFT: u32 = 0;
pub const CAU_AESC_CASR_DPE_MASK: u32 = 2;
pub const CAU_AESC_CASR_DPE_SHIFT: u32 = 1;
pub const CAU_AESC_CASR_VER_MASK: u32 = 4026531840;
pub const CAU_AESC_CASR_VER_SHIFT: u32 = 28;
pub const CAU_AESC_CAA_ACC_MASK: u32 = 4294967295;
pub const CAU_AESC_CAA_ACC_SHIFT: u32 = 0;
pub const CAU_AESC_CA_CA0_MASK: u32 = 4294967295;
pub const CAU_AESC_CA_CA0_SHIFT: u32 = 0;
pub const CAU_AESC_CA_CA1_MASK: u32 = 4294967295;
pub const CAU_AESC_CA_CA1_SHIFT: u32 = 0;
pub const CAU_AESC_CA_CA2_MASK: u32 = 4294967295;
pub const CAU_AESC_CA_CA2_SHIFT: u32 = 0;
pub const CAU_AESC_CA_CA3_MASK: u32 = 4294967295;
pub const CAU_AESC_CA_CA3_SHIFT: u32 = 0;
pub const CAU_AESC_CA_CA4_MASK: u32 = 4294967295;
pub const CAU_AESC_CA_CA4_SHIFT: u32 = 0;
pub const CAU_AESC_CA_CA5_MASK: u32 = 4294967295;
pub const CAU_AESC_CA_CA5_SHIFT: u32 = 0;
pub const CAU_AESC_CA_CA6_MASK: u32 = 4294967295;
pub const CAU_AESC_CA_CA6_SHIFT: u32 = 0;
pub const CAU_AESC_CA_CA7_MASK: u32 = 4294967295;
pub const CAU_AESC_CA_CA7_SHIFT: u32 = 0;
pub const CAU_AESC_CA_CA8_MASK: u32 = 4294967295;
pub const CAU_AESC_CA_CA8_SHIFT: u32 = 0;
pub const CAU_AESC_CA_COUNT: u32 = 9;
pub const CAU_AESIC_CASR_IC_MASK: u32 = 1;
pub const CAU_AESIC_CASR_IC_SHIFT: u32 = 0;
pub const CAU_AESIC_CASR_DPE_MASK: u32 = 2;
pub const CAU_AESIC_CASR_DPE_SHIFT: u32 = 1;
pub const CAU_AESIC_CASR_VER_MASK: u32 = 4026531840;
pub const CAU_AESIC_CASR_VER_SHIFT: u32 = 28;
pub const CAU_AESIC_CAA_ACC_MASK: u32 = 4294967295;
pub const CAU_AESIC_CAA_ACC_SHIFT: u32 = 0;
pub const CAU_AESIC_CA_CA0_MASK: u32 = 4294967295;
pub const CAU_AESIC_CA_CA0_SHIFT: u32 = 0;
pub const CAU_AESIC_CA_CA1_MASK: u32 = 4294967295;
pub const CAU_AESIC_CA_CA1_SHIFT: u32 = 0;
pub const CAU_AESIC_CA_CA2_MASK: u32 = 4294967295;
pub const CAU_AESIC_CA_CA2_SHIFT: u32 = 0;
pub const CAU_AESIC_CA_CA3_MASK: u32 = 4294967295;
pub const CAU_AESIC_CA_CA3_SHIFT: u32 = 0;
pub const CAU_AESIC_CA_CA4_MASK: u32 = 4294967295;
pub const CAU_AESIC_CA_CA4_SHIFT: u32 = 0;
pub const CAU_AESIC_CA_CA5_MASK: u32 = 4294967295;
pub const CAU_AESIC_CA_CA5_SHIFT: u32 = 0;
pub const CAU_AESIC_CA_CA6_MASK: u32 = 4294967295;
pub const CAU_AESIC_CA_CA6_SHIFT: u32 = 0;
pub const CAU_AESIC_CA_CA7_MASK: u32 = 4294967295;
pub const CAU_AESIC_CA_CA7_SHIFT: u32 = 0;
pub const CAU_AESIC_CA_CA8_MASK: u32 = 4294967295;
pub const CAU_AESIC_CA_CA8_SHIFT: u32 = 0;
pub const CAU_AESIC_CA_COUNT: u32 = 9;
pub const CAU_BASE: u32 = 3758624768;
#[doc = " CMP - Register Layout Typedef"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CMP_Type {
    #[doc = "< CMP Control Register 0, offset: 0x0"]
    pub CR0: u8,
    #[doc = "< CMP Control Register 1, offset: 0x1"]
    pub CR1: u8,
    #[doc = "< CMP Filter Period Register, offset: 0x2"]
    pub FPR: u8,
    #[doc = "< CMP Status and Control Register, offset: 0x3"]
    pub SCR: u8,
    #[doc = "< DAC Control Register, offset: 0x4"]
    pub DACCR: u8,
    #[doc = "< MUX Control Register, offset: 0x5"]
    pub MUXCR: u8,
}
#[test]
fn bindgen_test_layout_CMP_Type() {
    const UNINIT: ::std::mem::MaybeUninit<CMP_Type> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<CMP_Type>(),
        6usize,
        concat!("Size of: ", stringify!(CMP_Type))
    );
    assert_eq!(
        ::std::mem::align_of::<CMP_Type>(),
        1usize,
        concat!("Alignment of ", stringify!(CMP_Type))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).CR0) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(CMP_Type),
            "::",
            stringify!(CR0)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).CR1) as usize - ptr as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(CMP_Type),
            "::",
            stringify!(CR1)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).FPR) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(CMP_Type),
            "::",
            stringify!(FPR)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).SCR) as usize - ptr as usize },
        3usize,
        concat!(
            "Offset of field: ",
            stringify!(CMP_Type),
            "::",
            stringify!(SCR)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).DACCR) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(CMP_Type),
            "::",
            stringify!(DACCR)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).MUXCR) as usize - ptr as usize },
        5usize,
        concat!(
            "Offset of field: ",
            stringify!(CMP_Type),
            "::",
            stringify!(MUXCR)
        )
    );
}
pub const CMP_CR0_HYSTCTR_MASK: u32 = 3;
pub const CMP_CR0_HYSTCTR_SHIFT: u32 = 0;
pub const CMP_CR0_FILTER_CNT_MASK: u32 = 112;
pub const CMP_CR0_FILTER_CNT_SHIFT: u32 = 4;
pub const CMP_CR1_EN_MASK: u32 = 1;
pub const CMP_CR1_EN_SHIFT: u32 = 0;
pub const CMP_CR1_OPE_MASK: u32 = 2;
pub const CMP_CR1_OPE_SHIFT: u32 = 1;
pub const CMP_CR1_COS_MASK: u32 = 4;
pub const CMP_CR1_COS_SHIFT: u32 = 2;
pub const CMP_CR1_INV_MASK: u32 = 8;
pub const CMP_CR1_INV_SHIFT: u32 = 3;
pub const CMP_CR1_PMODE_MASK: u32 = 16;
pub const CMP_CR1_PMODE_SHIFT: u32 = 4;
pub const CMP_CR1_WE_MASK: u32 = 64;
pub const CMP_CR1_WE_SHIFT: u32 = 6;
pub const CMP_CR1_SE_MASK: u32 = 128;
pub const CMP_CR1_SE_SHIFT: u32 = 7;
pub const CMP_FPR_FILT_PER_MASK: u32 = 255;
pub const CMP_FPR_FILT_PER_SHIFT: u32 = 0;
pub const CMP_SCR_COUT_MASK: u32 = 1;
pub const CMP_SCR_COUT_SHIFT: u32 = 0;
pub const CMP_SCR_CFF_MASK: u32 = 2;
pub const CMP_SCR_CFF_SHIFT: u32 = 1;
pub const CMP_SCR_CFR_MASK: u32 = 4;
pub const CMP_SCR_CFR_SHIFT: u32 = 2;
pub const CMP_SCR_IEF_MASK: u32 = 8;
pub const CMP_SCR_IEF_SHIFT: u32 = 3;
pub const CMP_SCR_IER_MASK: u32 = 16;
pub const CMP_SCR_IER_SHIFT: u32 = 4;
pub const CMP_SCR_DMAEN_MASK: u32 = 64;
pub const CMP_SCR_DMAEN_SHIFT: u32 = 6;
pub const CMP_DACCR_VOSEL_MASK: u32 = 63;
pub const CMP_DACCR_VOSEL_SHIFT: u32 = 0;
pub const CMP_DACCR_VRSEL_MASK: u32 = 64;
pub const CMP_DACCR_VRSEL_SHIFT: u32 = 6;
pub const CMP_DACCR_DACEN_MASK: u32 = 128;
pub const CMP_DACCR_DACEN_SHIFT: u32 = 7;
pub const CMP_MUXCR_MSEL_MASK: u32 = 7;
pub const CMP_MUXCR_MSEL_SHIFT: u32 = 0;
pub const CMP_MUXCR_PSEL_MASK: u32 = 56;
pub const CMP_MUXCR_PSEL_SHIFT: u32 = 3;
pub const CMP_MUXCR_PSTM_MASK: u32 = 128;
pub const CMP_MUXCR_PSTM_SHIFT: u32 = 7;
pub const CMP0_BASE: u32 = 1074212864;
pub const CMP1_BASE: u32 = 1074212872;
pub const CMP2_BASE: u32 = 1074212880;
#[doc = " CMT - Register Layout Typedef"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CMT_Type {
    #[doc = "< CMT Carrier Generator High Data Register 1, offset: 0x0"]
    pub CGH1: u8,
    #[doc = "< CMT Carrier Generator Low Data Register 1, offset: 0x1"]
    pub CGL1: u8,
    #[doc = "< CMT Carrier Generator High Data Register 2, offset: 0x2"]
    pub CGH2: u8,
    #[doc = "< CMT Carrier Generator Low Data Register 2, offset: 0x3"]
    pub CGL2: u8,
    #[doc = "< CMT Output Control Register, offset: 0x4"]
    pub OC: u8,
    #[doc = "< CMT Modulator Status and Control Register, offset: 0x5"]
    pub MSC: u8,
    #[doc = "< CMT Modulator Data Register Mark High, offset: 0x6"]
    pub CMD1: u8,
    #[doc = "< CMT Modulator Data Register Mark Low, offset: 0x7"]
    pub CMD2: u8,
    #[doc = "< CMT Modulator Data Register Space High, offset: 0x8"]
    pub CMD3: u8,
    #[doc = "< CMT Modulator Data Register Space Low, offset: 0x9"]
    pub CMD4: u8,
    #[doc = "< CMT Primary Prescaler Register, offset: 0xA"]
    pub PPS: u8,
    #[doc = "< CMT Direct Memory Access Register, offset: 0xB"]
    pub DMA: u8,
}
#[test]
fn bindgen_test_layout_CMT_Type() {
    const UNINIT: ::std::mem::MaybeUninit<CMT_Type> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<CMT_Type>(),
        12usize,
        concat!("Size of: ", stringify!(CMT_Type))
    );
    assert_eq!(
        ::std::mem::align_of::<CMT_Type>(),
        1usize,
        concat!("Alignment of ", stringify!(CMT_Type))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).CGH1) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(CMT_Type),
            "::",
            stringify!(CGH1)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).CGL1) as usize - ptr as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(CMT_Type),
            "::",
            stringify!(CGL1)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).CGH2) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(CMT_Type),
            "::",
            stringify!(CGH2)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).CGL2) as usize - ptr as usize },
        3usize,
        concat!(
            "Offset of field: ",
            stringify!(CMT_Type),
            "::",
            stringify!(CGL2)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).OC) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(CMT_Type),
            "::",
            stringify!(OC)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).MSC) as usize - ptr as usize },
        5usize,
        concat!(
            "Offset of field: ",
            stringify!(CMT_Type),
            "::",
            stringify!(MSC)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).CMD1) as usize - ptr as usize },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(CMT_Type),
            "::",
            stringify!(CMD1)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).CMD2) as usize - ptr as usize },
        7usize,
        concat!(
            "Offset of field: ",
            stringify!(CMT_Type),
            "::",
            stringify!(CMD2)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).CMD3) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(CMT_Type),
            "::",
            stringify!(CMD3)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).CMD4) as usize - ptr as usize },
        9usize,
        concat!(
            "Offset of field: ",
            stringify!(CMT_Type),
            "::",
            stringify!(CMD4)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).PPS) as usize - ptr as usize },
        10usize,
        concat!(
            "Offset of field: ",
            stringify!(CMT_Type),
            "::",
            stringify!(PPS)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).DMA) as usize - ptr as usize },
        11usize,
        concat!(
            "Offset of field: ",
            stringify!(CMT_Type),
            "::",
            stringify!(DMA)
        )
    );
}
pub const CMT_CGH1_PH_MASK: u32 = 255;
pub const CMT_CGH1_PH_SHIFT: u32 = 0;
pub const CMT_CGL1_PL_MASK: u32 = 255;
pub const CMT_CGL1_PL_SHIFT: u32 = 0;
pub const CMT_CGH2_SH_MASK: u32 = 255;
pub const CMT_CGH2_SH_SHIFT: u32 = 0;
pub const CMT_CGL2_SL_MASK: u32 = 255;
pub const CMT_CGL2_SL_SHIFT: u32 = 0;
pub const CMT_OC_IROPEN_MASK: u32 = 32;
pub const CMT_OC_IROPEN_SHIFT: u32 = 5;
pub const CMT_OC_CMTPOL_MASK: u32 = 64;
pub const CMT_OC_CMTPOL_SHIFT: u32 = 6;
pub const CMT_OC_IROL_MASK: u32 = 128;
pub const CMT_OC_IROL_SHIFT: u32 = 7;
pub const CMT_MSC_MCGEN_MASK: u32 = 1;
pub const CMT_MSC_MCGEN_SHIFT: u32 = 0;
pub const CMT_MSC_EOCIE_MASK: u32 = 2;
pub const CMT_MSC_EOCIE_SHIFT: u32 = 1;
pub const CMT_MSC_FSK_MASK: u32 = 4;
pub const CMT_MSC_FSK_SHIFT: u32 = 2;
pub const CMT_MSC_BASE_MASK: u32 = 8;
pub const CMT_MSC_BASE_SHIFT: u32 = 3;
pub const CMT_MSC_EXSPC_MASK: u32 = 16;
pub const CMT_MSC_EXSPC_SHIFT: u32 = 4;
pub const CMT_MSC_CMTDIV_MASK: u32 = 96;
pub const CMT_MSC_CMTDIV_SHIFT: u32 = 5;
pub const CMT_MSC_EOCF_MASK: u32 = 128;
pub const CMT_MSC_EOCF_SHIFT: u32 = 7;
pub const CMT_CMD1_MB_MASK: u32 = 255;
pub const CMT_CMD1_MB_SHIFT: u32 = 0;
pub const CMT_CMD2_MB_MASK: u32 = 255;
pub const CMT_CMD2_MB_SHIFT: u32 = 0;
pub const CMT_CMD3_SB_MASK: u32 = 255;
pub const CMT_CMD3_SB_SHIFT: u32 = 0;
pub const CMT_CMD4_SB_MASK: u32 = 255;
pub const CMT_CMD4_SB_SHIFT: u32 = 0;
pub const CMT_PPS_PPSDIV_MASK: u32 = 15;
pub const CMT_PPS_PPSDIV_SHIFT: u32 = 0;
pub const CMT_DMA_DMA_MASK: u32 = 1;
pub const CMT_DMA_DMA_SHIFT: u32 = 0;
pub const CMT_BASE: u32 = 1074143232;
#[doc = " CRC - Register Layout Typedef"]
#[repr(C)]
#[derive(Copy, Clone)]
pub struct CRC_Type {
    pub __bindgen_anon_1: CRC_Type__bindgen_ty_1,
    pub __bindgen_anon_2: CRC_Type__bindgen_ty_2,
    pub __bindgen_anon_3: CRC_Type__bindgen_ty_3,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union CRC_Type__bindgen_ty_1 {
    pub ACCESS16BIT: CRC_Type__bindgen_ty_1__bindgen_ty_1,
    #[doc = "< CRC Data register, offset: 0x0"]
    pub DATA: u32,
    pub ACCESS8BIT: CRC_Type__bindgen_ty_1__bindgen_ty_2,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CRC_Type__bindgen_ty_1__bindgen_ty_1 {
    #[doc = "< CRC_DATAL register., offset: 0x0"]
    pub DATAL: u16,
    #[doc = "< CRC_DATAH register., offset: 0x2"]
    pub DATAH: u16,
}
#[test]
fn bindgen_test_layout_CRC_Type__bindgen_ty_1__bindgen_ty_1() {
    const UNINIT: ::std::mem::MaybeUninit<CRC_Type__bindgen_ty_1__bindgen_ty_1> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<CRC_Type__bindgen_ty_1__bindgen_ty_1>(),
        4usize,
        concat!(
            "Size of: ",
            stringify!(CRC_Type__bindgen_ty_1__bindgen_ty_1)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<CRC_Type__bindgen_ty_1__bindgen_ty_1>(),
        2usize,
        concat!(
            "Alignment of ",
            stringify!(CRC_Type__bindgen_ty_1__bindgen_ty_1)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).DATAL) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(CRC_Type__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(DATAL)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).DATAH) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(CRC_Type__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(DATAH)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CRC_Type__bindgen_ty_1__bindgen_ty_2 {
    #[doc = "< CRC_DATALL register., offset: 0x0"]
    pub DATALL: u8,
    #[doc = "< CRC_DATALU register., offset: 0x1"]
    pub DATALU: u8,
    #[doc = "< CRC_DATAHL register., offset: 0x2"]
    pub DATAHL: u8,
    #[doc = "< CRC_DATAHU register., offset: 0x3"]
    pub DATAHU: u8,
}
#[test]
fn bindgen_test_layout_CRC_Type__bindgen_ty_1__bindgen_ty_2() {
    const UNINIT: ::std::mem::MaybeUninit<CRC_Type__bindgen_ty_1__bindgen_ty_2> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<CRC_Type__bindgen_ty_1__bindgen_ty_2>(),
        4usize,
        concat!(
            "Size of: ",
            stringify!(CRC_Type__bindgen_ty_1__bindgen_ty_2)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<CRC_Type__bindgen_ty_1__bindgen_ty_2>(),
        1usize,
        concat!(
            "Alignment of ",
            stringify!(CRC_Type__bindgen_ty_1__bindgen_ty_2)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).DATALL) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(CRC_Type__bindgen_ty_1__bindgen_ty_2),
            "::",
            stringify!(DATALL)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).DATALU) as usize - ptr as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(CRC_Type__bindgen_ty_1__bindgen_ty_2),
            "::",
            stringify!(DATALU)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).DATAHL) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(CRC_Type__bindgen_ty_1__bindgen_ty_2),
            "::",
            stringify!(DATAHL)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).DATAHU) as usize - ptr as usize },
        3usize,
        concat!(
            "Offset of field: ",
            stringify!(CRC_Type__bindgen_ty_1__bindgen_ty_2),
            "::",
            stringify!(DATAHU)
        )
    );
}
#[test]
fn bindgen_test_layout_CRC_Type__bindgen_ty_1() {
    const UNINIT: ::std::mem::MaybeUninit<CRC_Type__bindgen_ty_1> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<CRC_Type__bindgen_ty_1>(),
        4usize,
        concat!("Size of: ", stringify!(CRC_Type__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<CRC_Type__bindgen_ty_1>(),
        4usize,
        concat!("Alignment of ", stringify!(CRC_Type__bindgen_ty_1))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ACCESS16BIT) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(CRC_Type__bindgen_ty_1),
            "::",
            stringify!(ACCESS16BIT)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).DATA) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(CRC_Type__bindgen_ty_1),
            "::",
            stringify!(DATA)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ACCESS8BIT) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(CRC_Type__bindgen_ty_1),
            "::",
            stringify!(ACCESS8BIT)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union CRC_Type__bindgen_ty_2 {
    pub GPOLY_ACCESS16BIT: CRC_Type__bindgen_ty_2__bindgen_ty_1,
    #[doc = "< CRC Polynomial register, offset: 0x4"]
    pub GPOLY: u32,
    pub GPOLY_ACCESS8BIT: CRC_Type__bindgen_ty_2__bindgen_ty_2,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CRC_Type__bindgen_ty_2__bindgen_ty_1 {
    #[doc = "< CRC_GPOLYL register., offset: 0x4"]
    pub GPOLYL: u16,
    #[doc = "< CRC_GPOLYH register., offset: 0x6"]
    pub GPOLYH: u16,
}
#[test]
fn bindgen_test_layout_CRC_Type__bindgen_ty_2__bindgen_ty_1() {
    const UNINIT: ::std::mem::MaybeUninit<CRC_Type__bindgen_ty_2__bindgen_ty_1> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<CRC_Type__bindgen_ty_2__bindgen_ty_1>(),
        4usize,
        concat!(
            "Size of: ",
            stringify!(CRC_Type__bindgen_ty_2__bindgen_ty_1)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<CRC_Type__bindgen_ty_2__bindgen_ty_1>(),
        2usize,
        concat!(
            "Alignment of ",
            stringify!(CRC_Type__bindgen_ty_2__bindgen_ty_1)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).GPOLYL) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(CRC_Type__bindgen_ty_2__bindgen_ty_1),
            "::",
            stringify!(GPOLYL)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).GPOLYH) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(CRC_Type__bindgen_ty_2__bindgen_ty_1),
            "::",
            stringify!(GPOLYH)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CRC_Type__bindgen_ty_2__bindgen_ty_2 {
    #[doc = "< CRC_GPOLYLL register., offset: 0x4"]
    pub GPOLYLL: u8,
    #[doc = "< CRC_GPOLYLU register., offset: 0x5"]
    pub GPOLYLU: u8,
    #[doc = "< CRC_GPOLYHL register., offset: 0x6"]
    pub GPOLYHL: u8,
    #[doc = "< CRC_GPOLYHU register., offset: 0x7"]
    pub GPOLYHU: u8,
}
#[test]
fn bindgen_test_layout_CRC_Type__bindgen_ty_2__bindgen_ty_2() {
    const UNINIT: ::std::mem::MaybeUninit<CRC_Type__bindgen_ty_2__bindgen_ty_2> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<CRC_Type__bindgen_ty_2__bindgen_ty_2>(),
        4usize,
        concat!(
            "Size of: ",
            stringify!(CRC_Type__bindgen_ty_2__bindgen_ty_2)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<CRC_Type__bindgen_ty_2__bindgen_ty_2>(),
        1usize,
        concat!(
            "Alignment of ",
            stringify!(CRC_Type__bindgen_ty_2__bindgen_ty_2)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).GPOLYLL) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(CRC_Type__bindgen_ty_2__bindgen_ty_2),
            "::",
            stringify!(GPOLYLL)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).GPOLYLU) as usize - ptr as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(CRC_Type__bindgen_ty_2__bindgen_ty_2),
            "::",
            stringify!(GPOLYLU)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).GPOLYHL) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(CRC_Type__bindgen_ty_2__bindgen_ty_2),
            "::",
            stringify!(GPOLYHL)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).GPOLYHU) as usize - ptr as usize },
        3usize,
        concat!(
            "Offset of field: ",
            stringify!(CRC_Type__bindgen_ty_2__bindgen_ty_2),
            "::",
            stringify!(GPOLYHU)
        )
    );
}
#[test]
fn bindgen_test_layout_CRC_Type__bindgen_ty_2() {
    const UNINIT: ::std::mem::MaybeUninit<CRC_Type__bindgen_ty_2> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<CRC_Type__bindgen_ty_2>(),
        4usize,
        concat!("Size of: ", stringify!(CRC_Type__bindgen_ty_2))
    );
    assert_eq!(
        ::std::mem::align_of::<CRC_Type__bindgen_ty_2>(),
        4usize,
        concat!("Alignment of ", stringify!(CRC_Type__bindgen_ty_2))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).GPOLY_ACCESS16BIT) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(CRC_Type__bindgen_ty_2),
            "::",
            stringify!(GPOLY_ACCESS16BIT)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).GPOLY) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(CRC_Type__bindgen_ty_2),
            "::",
            stringify!(GPOLY)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).GPOLY_ACCESS8BIT) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(CRC_Type__bindgen_ty_2),
            "::",
            stringify!(GPOLY_ACCESS8BIT)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union CRC_Type__bindgen_ty_3 {
    #[doc = "< CRC Control register, offset: 0x8"]
    pub CTRL: u32,
    pub CTRL_ACCESS8BIT: CRC_Type__bindgen_ty_3__bindgen_ty_1,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CRC_Type__bindgen_ty_3__bindgen_ty_1 {
    pub RESERVED_0: [u8; 3usize],
    #[doc = "< CRC_CTRLHU register., offset: 0xB"]
    pub CTRLHU: u8,
}
#[test]
fn bindgen_test_layout_CRC_Type__bindgen_ty_3__bindgen_ty_1() {
    const UNINIT: ::std::mem::MaybeUninit<CRC_Type__bindgen_ty_3__bindgen_ty_1> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<CRC_Type__bindgen_ty_3__bindgen_ty_1>(),
        4usize,
        concat!(
            "Size of: ",
            stringify!(CRC_Type__bindgen_ty_3__bindgen_ty_1)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<CRC_Type__bindgen_ty_3__bindgen_ty_1>(),
        1usize,
        concat!(
            "Alignment of ",
            stringify!(CRC_Type__bindgen_ty_3__bindgen_ty_1)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).RESERVED_0) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(CRC_Type__bindgen_ty_3__bindgen_ty_1),
            "::",
            stringify!(RESERVED_0)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).CTRLHU) as usize - ptr as usize },
        3usize,
        concat!(
            "Offset of field: ",
            stringify!(CRC_Type__bindgen_ty_3__bindgen_ty_1),
            "::",
            stringify!(CTRLHU)
        )
    );
}
#[test]
fn bindgen_test_layout_CRC_Type__bindgen_ty_3() {
    const UNINIT: ::std::mem::MaybeUninit<CRC_Type__bindgen_ty_3> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<CRC_Type__bindgen_ty_3>(),
        4usize,
        concat!("Size of: ", stringify!(CRC_Type__bindgen_ty_3))
    );
    assert_eq!(
        ::std::mem::align_of::<CRC_Type__bindgen_ty_3>(),
        4usize,
        concat!("Alignment of ", stringify!(CRC_Type__bindgen_ty_3))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).CTRL) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(CRC_Type__bindgen_ty_3),
            "::",
            stringify!(CTRL)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).CTRL_ACCESS8BIT) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(CRC_Type__bindgen_ty_3),
            "::",
            stringify!(CTRL_ACCESS8BIT)
        )
    );
}
#[test]
fn bindgen_test_layout_CRC_Type() {
    assert_eq!(
        ::std::mem::size_of::<CRC_Type>(),
        12usize,
        concat!("Size of: ", stringify!(CRC_Type))
    );
    assert_eq!(
        ::std::mem::align_of::<CRC_Type>(),
        4usize,
        concat!("Alignment of ", stringify!(CRC_Type))
    );
}
pub const CRC_DATAL_DATAL_MASK: u32 = 65535;
pub const CRC_DATAL_DATAL_SHIFT: u32 = 0;
pub const CRC_DATAH_DATAH_MASK: u32 = 65535;
pub const CRC_DATAH_DATAH_SHIFT: u32 = 0;
pub const CRC_DATA_LL_MASK: u32 = 255;
pub const CRC_DATA_LL_SHIFT: u32 = 0;
pub const CRC_DATA_LU_MASK: u32 = 65280;
pub const CRC_DATA_LU_SHIFT: u32 = 8;
pub const CRC_DATA_HL_MASK: u32 = 16711680;
pub const CRC_DATA_HL_SHIFT: u32 = 16;
pub const CRC_DATA_HU_MASK: u32 = 4278190080;
pub const CRC_DATA_HU_SHIFT: u32 = 24;
pub const CRC_DATALL_DATALL_MASK: u32 = 255;
pub const CRC_DATALL_DATALL_SHIFT: u32 = 0;
pub const CRC_DATALU_DATALU_MASK: u32 = 255;
pub const CRC_DATALU_DATALU_SHIFT: u32 = 0;
pub const CRC_DATAHL_DATAHL_MASK: u32 = 255;
pub const CRC_DATAHL_DATAHL_SHIFT: u32 = 0;
pub const CRC_DATAHU_DATAHU_MASK: u32 = 255;
pub const CRC_DATAHU_DATAHU_SHIFT: u32 = 0;
pub const CRC_GPOLYL_GPOLYL_MASK: u32 = 65535;
pub const CRC_GPOLYL_GPOLYL_SHIFT: u32 = 0;
pub const CRC_GPOLYH_GPOLYH_MASK: u32 = 65535;
pub const CRC_GPOLYH_GPOLYH_SHIFT: u32 = 0;
pub const CRC_GPOLY_LOW_MASK: u32 = 65535;
pub const CRC_GPOLY_LOW_SHIFT: u32 = 0;
pub const CRC_GPOLY_HIGH_MASK: u32 = 4294901760;
pub const CRC_GPOLY_HIGH_SHIFT: u32 = 16;
pub const CRC_GPOLYLL_GPOLYLL_MASK: u32 = 255;
pub const CRC_GPOLYLL_GPOLYLL_SHIFT: u32 = 0;
pub const CRC_GPOLYLU_GPOLYLU_MASK: u32 = 255;
pub const CRC_GPOLYLU_GPOLYLU_SHIFT: u32 = 0;
pub const CRC_GPOLYHL_GPOLYHL_MASK: u32 = 255;
pub const CRC_GPOLYHL_GPOLYHL_SHIFT: u32 = 0;
pub const CRC_GPOLYHU_GPOLYHU_MASK: u32 = 255;
pub const CRC_GPOLYHU_GPOLYHU_SHIFT: u32 = 0;
pub const CRC_CTRL_TCRC_MASK: u32 = 16777216;
pub const CRC_CTRL_TCRC_SHIFT: u32 = 24;
pub const CRC_CTRL_WAS_MASK: u32 = 33554432;
pub const CRC_CTRL_WAS_SHIFT: u32 = 25;
pub const CRC_CTRL_FXOR_MASK: u32 = 67108864;
pub const CRC_CTRL_FXOR_SHIFT: u32 = 26;
pub const CRC_CTRL_TOTR_MASK: u32 = 805306368;
pub const CRC_CTRL_TOTR_SHIFT: u32 = 28;
pub const CRC_CTRL_TOT_MASK: u32 = 3221225472;
pub const CRC_CTRL_TOT_SHIFT: u32 = 30;
pub const CRC_CTRLHU_TCRC_MASK: u32 = 1;
pub const CRC_CTRLHU_TCRC_SHIFT: u32 = 0;
pub const CRC_CTRLHU_WAS_MASK: u32 = 2;
pub const CRC_CTRLHU_WAS_SHIFT: u32 = 1;
pub const CRC_CTRLHU_FXOR_MASK: u32 = 4;
pub const CRC_CTRLHU_FXOR_SHIFT: u32 = 2;
pub const CRC_CTRLHU_TOTR_MASK: u32 = 48;
pub const CRC_CTRLHU_TOTR_SHIFT: u32 = 4;
pub const CRC_CTRLHU_TOT_MASK: u32 = 192;
pub const CRC_CTRLHU_TOT_SHIFT: u32 = 6;
pub const CRC_BASE: u32 = 1073946624;
#[doc = " DAC - Register Layout Typedef"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct DAC_Type {
    pub DAT: [DAC_Type__bindgen_ty_1; 16usize],
    #[doc = "< DAC Status Register, offset: 0x20"]
    pub SR: u8,
    #[doc = "< DAC Control Register, offset: 0x21"]
    pub C0: u8,
    #[doc = "< DAC Control Register 1, offset: 0x22"]
    pub C1: u8,
    #[doc = "< DAC Control Register 2, offset: 0x23"]
    pub C2: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct DAC_Type__bindgen_ty_1 {
    #[doc = "< DAC Data Low Register, array offset: 0x0, array step: 0x2"]
    pub DATL: u8,
    #[doc = "< DAC Data High Register, array offset: 0x1, array step: 0x2"]
    pub DATH: u8,
}
#[test]
fn bindgen_test_layout_DAC_Type__bindgen_ty_1() {
    const UNINIT: ::std::mem::MaybeUninit<DAC_Type__bindgen_ty_1> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<DAC_Type__bindgen_ty_1>(),
        2usize,
        concat!("Size of: ", stringify!(DAC_Type__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<DAC_Type__bindgen_ty_1>(),
        1usize,
        concat!("Alignment of ", stringify!(DAC_Type__bindgen_ty_1))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).DATL) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(DAC_Type__bindgen_ty_1),
            "::",
            stringify!(DATL)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).DATH) as usize - ptr as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(DAC_Type__bindgen_ty_1),
            "::",
            stringify!(DATH)
        )
    );
}
#[test]
fn bindgen_test_layout_DAC_Type() {
    const UNINIT: ::std::mem::MaybeUninit<DAC_Type> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<DAC_Type>(),
        36usize,
        concat!("Size of: ", stringify!(DAC_Type))
    );
    assert_eq!(
        ::std::mem::align_of::<DAC_Type>(),
        1usize,
        concat!("Alignment of ", stringify!(DAC_Type))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).DAT) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(DAC_Type),
            "::",
            stringify!(DAT)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).SR) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(DAC_Type),
            "::",
            stringify!(SR)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).C0) as usize - ptr as usize },
        33usize,
        concat!(
            "Offset of field: ",
            stringify!(DAC_Type),
            "::",
            stringify!(C0)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).C1) as usize - ptr as usize },
        34usize,
        concat!(
            "Offset of field: ",
            stringify!(DAC_Type),
            "::",
            stringify!(C1)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).C2) as usize - ptr as usize },
        35usize,
        concat!(
            "Offset of field: ",
            stringify!(DAC_Type),
            "::",
            stringify!(C2)
        )
    );
}
pub const DAC_DATL_DATA0_MASK: u32 = 255;
pub const DAC_DATL_DATA0_SHIFT: u32 = 0;
pub const DAC_DATL_COUNT: u32 = 16;
pub const DAC_DATH_DATA1_MASK: u32 = 15;
pub const DAC_DATH_DATA1_SHIFT: u32 = 0;
pub const DAC_DATH_COUNT: u32 = 16;
pub const DAC_SR_DACBFRPBF_MASK: u32 = 1;
pub const DAC_SR_DACBFRPBF_SHIFT: u32 = 0;
pub const DAC_SR_DACBFRPTF_MASK: u32 = 2;
pub const DAC_SR_DACBFRPTF_SHIFT: u32 = 1;
pub const DAC_SR_DACBFWMF_MASK: u32 = 4;
pub const DAC_SR_DACBFWMF_SHIFT: u32 = 2;
pub const DAC_C0_DACBBIEN_MASK: u32 = 1;
pub const DAC_C0_DACBBIEN_SHIFT: u32 = 0;
pub const DAC_C0_DACBTIEN_MASK: u32 = 2;
pub const DAC_C0_DACBTIEN_SHIFT: u32 = 1;
pub const DAC_C0_DACBWIEN_MASK: u32 = 4;
pub const DAC_C0_DACBWIEN_SHIFT: u32 = 2;
pub const DAC_C0_LPEN_MASK: u32 = 8;
pub const DAC_C0_LPEN_SHIFT: u32 = 3;
pub const DAC_C0_DACSWTRG_MASK: u32 = 16;
pub const DAC_C0_DACSWTRG_SHIFT: u32 = 4;
pub const DAC_C0_DACTRGSEL_MASK: u32 = 32;
pub const DAC_C0_DACTRGSEL_SHIFT: u32 = 5;
pub const DAC_C0_DACRFS_MASK: u32 = 64;
pub const DAC_C0_DACRFS_SHIFT: u32 = 6;
pub const DAC_C0_DACEN_MASK: u32 = 128;
pub const DAC_C0_DACEN_SHIFT: u32 = 7;
pub const DAC_C1_DACBFEN_MASK: u32 = 1;
pub const DAC_C1_DACBFEN_SHIFT: u32 = 0;
pub const DAC_C1_DACBFMD_MASK: u32 = 6;
pub const DAC_C1_DACBFMD_SHIFT: u32 = 1;
pub const DAC_C1_DACBFWM_MASK: u32 = 24;
pub const DAC_C1_DACBFWM_SHIFT: u32 = 3;
pub const DAC_C1_DMAEN_MASK: u32 = 128;
pub const DAC_C1_DMAEN_SHIFT: u32 = 7;
pub const DAC_C2_DACBFUP_MASK: u32 = 15;
pub const DAC_C2_DACBFUP_SHIFT: u32 = 0;
pub const DAC_C2_DACBFRP_MASK: u32 = 240;
pub const DAC_C2_DACBFRP_SHIFT: u32 = 4;
pub const DAC0_BASE: u32 = 1074577408;
pub const DAC1_BASE: u32 = 1074581504;
#[doc = " DMA - Register Layout Typedef"]
#[repr(C)]
#[derive(Copy, Clone)]
pub struct DMA_Type {
    #[doc = "< Control Register, offset: 0x0"]
    pub CR: u32,
    #[doc = "< Error Status Register, offset: 0x4"]
    pub ES: u32,
    pub RESERVED_0: [u8; 4usize],
    #[doc = "< Enable Request Register, offset: 0xC"]
    pub ERQ: u32,
    pub RESERVED_1: [u8; 4usize],
    #[doc = "< Enable Error Interrupt Register, offset: 0x14"]
    pub EEI: u32,
    #[doc = "< Clear Enable Error Interrupt Register, offset: 0x18"]
    pub CEEI: u8,
    #[doc = "< Set Enable Error Interrupt Register, offset: 0x19"]
    pub SEEI: u8,
    #[doc = "< Clear Enable Request Register, offset: 0x1A"]
    pub CERQ: u8,
    #[doc = "< Set Enable Request Register, offset: 0x1B"]
    pub SERQ: u8,
    #[doc = "< Clear DONE Status Bit Register, offset: 0x1C"]
    pub CDNE: u8,
    #[doc = "< Set START Bit Register, offset: 0x1D"]
    pub SSRT: u8,
    #[doc = "< Clear Error Register, offset: 0x1E"]
    pub CERR: u8,
    #[doc = "< Clear Interrupt Request Register, offset: 0x1F"]
    pub CINT: u8,
    pub RESERVED_2: [u8; 4usize],
    #[doc = "< Interrupt Request Register, offset: 0x24"]
    pub INT: u32,
    pub RESERVED_3: [u8; 4usize],
    #[doc = "< Error Register, offset: 0x2C"]
    pub ERR: u32,
    pub RESERVED_4: [u8; 4usize],
    #[doc = "< Hardware Request Status Register, offset: 0x34"]
    pub HRS: u32,
    pub RESERVED_5: [u8; 12usize],
    #[doc = "< Enable Asynchronous Request in Stop Register, offset: 0x44"]
    pub EARS: u32,
    pub RESERVED_6: [u8; 184usize],
    #[doc = "< Channel n Priority Register, offset: 0x100"]
    pub DCHPRI3: u8,
    #[doc = "< Channel n Priority Register, offset: 0x101"]
    pub DCHPRI2: u8,
    #[doc = "< Channel n Priority Register, offset: 0x102"]
    pub DCHPRI1: u8,
    #[doc = "< Channel n Priority Register, offset: 0x103"]
    pub DCHPRI0: u8,
    #[doc = "< Channel n Priority Register, offset: 0x104"]
    pub DCHPRI7: u8,
    #[doc = "< Channel n Priority Register, offset: 0x105"]
    pub DCHPRI6: u8,
    #[doc = "< Channel n Priority Register, offset: 0x106"]
    pub DCHPRI5: u8,
    #[doc = "< Channel n Priority Register, offset: 0x107"]
    pub DCHPRI4: u8,
    #[doc = "< Channel n Priority Register, offset: 0x108"]
    pub DCHPRI11: u8,
    #[doc = "< Channel n Priority Register, offset: 0x109"]
    pub DCHPRI10: u8,
    #[doc = "< Channel n Priority Register, offset: 0x10A"]
    pub DCHPRI9: u8,
    #[doc = "< Channel n Priority Register, offset: 0x10B"]
    pub DCHPRI8: u8,
    #[doc = "< Channel n Priority Register, offset: 0x10C"]
    pub DCHPRI15: u8,
    #[doc = "< Channel n Priority Register, offset: 0x10D"]
    pub DCHPRI14: u8,
    #[doc = "< Channel n Priority Register, offset: 0x10E"]
    pub DCHPRI13: u8,
    #[doc = "< Channel n Priority Register, offset: 0x10F"]
    pub DCHPRI12: u8,
    pub RESERVED_7: [u8; 3824usize],
    pub TCD: [DMA_Type__bindgen_ty_1; 16usize],
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct DMA_Type__bindgen_ty_1 {
    #[doc = "< TCD Source Address, array offset: 0x1000, array step: 0x20"]
    pub SADDR: u32,
    #[doc = "< TCD Signed Source Address Offset, array offset: 0x1004, array step: 0x20"]
    pub SOFF: u16,
    #[doc = "< TCD Transfer Attributes, array offset: 0x1006, array step: 0x20"]
    pub ATTR: u16,
    pub __bindgen_anon_1: DMA_Type__bindgen_ty_1__bindgen_ty_1,
    #[doc = "< TCD Last Source Address Adjustment, array offset: 0x100C, array step: 0x20"]
    pub SLAST: u32,
    #[doc = "< TCD Destination Address, array offset: 0x1010, array step: 0x20"]
    pub DADDR: u32,
    #[doc = "< TCD Signed Destination Address Offset, array offset: 0x1014, array step: 0x20"]
    pub DOFF: u16,
    pub __bindgen_anon_2: DMA_Type__bindgen_ty_1__bindgen_ty_2,
    #[doc = "< TCD Last Destination Address Adjustment/Scatter Gather Address, array offset: 0x1018, array step: 0x20"]
    pub DLAST_SGA: u32,
    #[doc = "< TCD Control and Status, array offset: 0x101C, array step: 0x20"]
    pub CSR: u16,
    pub __bindgen_anon_3: DMA_Type__bindgen_ty_1__bindgen_ty_3,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union DMA_Type__bindgen_ty_1__bindgen_ty_1 {
    #[doc = "< TCD Minor Byte Count (Minor Loop Disabled), array offset: 0x1008, array step: 0x20"]
    pub NBYTES_MLNO: u32,
    #[doc = "< TCD Signed Minor Loop Offset (Minor Loop Enabled and Offset Disabled), array offset: 0x1008, array step: 0x20"]
    pub NBYTES_MLOFFNO: u32,
    #[doc = "< TCD Signed Minor Loop Offset (Minor Loop and Offset Enabled), array offset: 0x1008, array step: 0x20"]
    pub NBYTES_MLOFFYES: u32,
}
#[test]
fn bindgen_test_layout_DMA_Type__bindgen_ty_1__bindgen_ty_1() {
    const UNINIT: ::std::mem::MaybeUninit<DMA_Type__bindgen_ty_1__bindgen_ty_1> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<DMA_Type__bindgen_ty_1__bindgen_ty_1>(),
        4usize,
        concat!(
            "Size of: ",
            stringify!(DMA_Type__bindgen_ty_1__bindgen_ty_1)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<DMA_Type__bindgen_ty_1__bindgen_ty_1>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(DMA_Type__bindgen_ty_1__bindgen_ty_1)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).NBYTES_MLNO) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(DMA_Type__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(NBYTES_MLNO)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).NBYTES_MLOFFNO) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(DMA_Type__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(NBYTES_MLOFFNO)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).NBYTES_MLOFFYES) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(DMA_Type__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(NBYTES_MLOFFYES)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union DMA_Type__bindgen_ty_1__bindgen_ty_2 {
    #[doc = "< TCD Current Minor Loop Link, Major Loop Count (Channel Linking Disabled), array offset: 0x1016, array step: 0x20"]
    pub CITER_ELINKNO: u16,
    #[doc = "< TCD Current Minor Loop Link, Major Loop Count (Channel Linking Enabled), array offset: 0x1016, array step: 0x20"]
    pub CITER_ELINKYES: u16,
}
#[test]
fn bindgen_test_layout_DMA_Type__bindgen_ty_1__bindgen_ty_2() {
    const UNINIT: ::std::mem::MaybeUninit<DMA_Type__bindgen_ty_1__bindgen_ty_2> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<DMA_Type__bindgen_ty_1__bindgen_ty_2>(),
        2usize,
        concat!(
            "Size of: ",
            stringify!(DMA_Type__bindgen_ty_1__bindgen_ty_2)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<DMA_Type__bindgen_ty_1__bindgen_ty_2>(),
        2usize,
        concat!(
            "Alignment of ",
            stringify!(DMA_Type__bindgen_ty_1__bindgen_ty_2)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).CITER_ELINKNO) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(DMA_Type__bindgen_ty_1__bindgen_ty_2),
            "::",
            stringify!(CITER_ELINKNO)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).CITER_ELINKYES) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(DMA_Type__bindgen_ty_1__bindgen_ty_2),
            "::",
            stringify!(CITER_ELINKYES)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union DMA_Type__bindgen_ty_1__bindgen_ty_3 {
    #[doc = "< TCD Beginning Minor Loop Link, Major Loop Count (Channel Linking Disabled), array offset: 0x101E, array step: 0x20"]
    pub BITER_ELINKNO: u16,
    #[doc = "< TCD Beginning Minor Loop Link, Major Loop Count (Channel Linking Enabled), array offset: 0x101E, array step: 0x20"]
    pub BITER_ELINKYES: u16,
}
#[test]
fn bindgen_test_layout_DMA_Type__bindgen_ty_1__bindgen_ty_3() {
    const UNINIT: ::std::mem::MaybeUninit<DMA_Type__bindgen_ty_1__bindgen_ty_3> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<DMA_Type__bindgen_ty_1__bindgen_ty_3>(),
        2usize,
        concat!(
            "Size of: ",
            stringify!(DMA_Type__bindgen_ty_1__bindgen_ty_3)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<DMA_Type__bindgen_ty_1__bindgen_ty_3>(),
        2usize,
        concat!(
            "Alignment of ",
            stringify!(DMA_Type__bindgen_ty_1__bindgen_ty_3)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).BITER_ELINKNO) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(DMA_Type__bindgen_ty_1__bindgen_ty_3),
            "::",
            stringify!(BITER_ELINKNO)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).BITER_ELINKYES) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(DMA_Type__bindgen_ty_1__bindgen_ty_3),
            "::",
            stringify!(BITER_ELINKYES)
        )
    );
}
#[test]
fn bindgen_test_layout_DMA_Type__bindgen_ty_1() {
    const UNINIT: ::std::mem::MaybeUninit<DMA_Type__bindgen_ty_1> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<DMA_Type__bindgen_ty_1>(),
        32usize,
        concat!("Size of: ", stringify!(DMA_Type__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<DMA_Type__bindgen_ty_1>(),
        4usize,
        concat!("Alignment of ", stringify!(DMA_Type__bindgen_ty_1))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).SADDR) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(DMA_Type__bindgen_ty_1),
            "::",
            stringify!(SADDR)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).SOFF) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(DMA_Type__bindgen_ty_1),
            "::",
            stringify!(SOFF)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ATTR) as usize - ptr as usize },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(DMA_Type__bindgen_ty_1),
            "::",
            stringify!(ATTR)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).SLAST) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(DMA_Type__bindgen_ty_1),
            "::",
            stringify!(SLAST)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).DADDR) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(DMA_Type__bindgen_ty_1),
            "::",
            stringify!(DADDR)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).DOFF) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(DMA_Type__bindgen_ty_1),
            "::",
            stringify!(DOFF)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).DLAST_SGA) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(DMA_Type__bindgen_ty_1),
            "::",
            stringify!(DLAST_SGA)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).CSR) as usize - ptr as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(DMA_Type__bindgen_ty_1),
            "::",
            stringify!(CSR)
        )
    );
}
#[test]
fn bindgen_test_layout_DMA_Type() {
    const UNINIT: ::std::mem::MaybeUninit<DMA_Type> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<DMA_Type>(),
        4608usize,
        concat!("Size of: ", stringify!(DMA_Type))
    );
    assert_eq!(
        ::std::mem::align_of::<DMA_Type>(),
        4usize,
        concat!("Alignment of ", stringify!(DMA_Type))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).CR) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(DMA_Type),
            "::",
            stringify!(CR)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ES) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(DMA_Type),
            "::",
            stringify!(ES)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).RESERVED_0) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(DMA_Type),
            "::",
            stringify!(RESERVED_0)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ERQ) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(DMA_Type),
            "::",
            stringify!(ERQ)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).RESERVED_1) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(DMA_Type),
            "::",
            stringify!(RESERVED_1)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).EEI) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(DMA_Type),
            "::",
            stringify!(EEI)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).CEEI) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(DMA_Type),
            "::",
            stringify!(CEEI)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).SEEI) as usize - ptr as usize },
        25usize,
        concat!(
            "Offset of field: ",
            stringify!(DMA_Type),
            "::",
            stringify!(SEEI)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).CERQ) as usize - ptr as usize },
        26usize,
        concat!(
            "Offset of field: ",
            stringify!(DMA_Type),
            "::",
            stringify!(CERQ)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).SERQ) as usize - ptr as usize },
        27usize,
        concat!(
            "Offset of field: ",
            stringify!(DMA_Type),
            "::",
            stringify!(SERQ)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).CDNE) as usize - ptr as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(DMA_Type),
            "::",
            stringify!(CDNE)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).SSRT) as usize - ptr as usize },
        29usize,
        concat!(
            "Offset of field: ",
            stringify!(DMA_Type),
            "::",
            stringify!(SSRT)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).CERR) as usize - ptr as usize },
        30usize,
        concat!(
            "Offset of field: ",
            stringify!(DMA_Type),
            "::",
            stringify!(CERR)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).CINT) as usize - ptr as usize },
        31usize,
        concat!(
            "Offset of field: ",
            stringify!(DMA_Type),
            "::",
            stringify!(CINT)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).RESERVED_2) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(DMA_Type),
            "::",
            stringify!(RESERVED_2)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).INT) as usize - ptr as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(DMA_Type),
            "::",
            stringify!(INT)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).RESERVED_3) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(DMA_Type),
            "::",
            stringify!(RESERVED_3)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ERR) as usize - ptr as usize },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(DMA_Type),
            "::",
            stringify!(ERR)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).RESERVED_4) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(DMA_Type),
            "::",
            stringify!(RESERVED_4)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).HRS) as usize - ptr as usize },
        52usize,
        concat!(
            "Offset of field: ",
            stringify!(DMA_Type),
            "::",
            stringify!(HRS)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).RESERVED_5) as usize - ptr as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(DMA_Type),
            "::",
            stringify!(RESERVED_5)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).EARS) as usize - ptr as usize },
        68usize,
        concat!(
            "Offset of field: ",
            stringify!(DMA_Type),
            "::",
            stringify!(EARS)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).RESERVED_6) as usize - ptr as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(DMA_Type),
            "::",
            stringify!(RESERVED_6)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).DCHPRI3) as usize - ptr as usize },
        256usize,
        concat!(
            "Offset of field: ",
            stringify!(DMA_Type),
            "::",
            stringify!(DCHPRI3)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).DCHPRI2) as usize - ptr as usize },
        257usize,
        concat!(
            "Offset of field: ",
            stringify!(DMA_Type),
            "::",
            stringify!(DCHPRI2)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).DCHPRI1) as usize - ptr as usize },
        258usize,
        concat!(
            "Offset of field: ",
            stringify!(DMA_Type),
            "::",
            stringify!(DCHPRI1)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).DCHPRI0) as usize - ptr as usize },
        259usize,
        concat!(
            "Offset of field: ",
            stringify!(DMA_Type),
            "::",
            stringify!(DCHPRI0)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).DCHPRI7) as usize - ptr as usize },
        260usize,
        concat!(
            "Offset of field: ",
            stringify!(DMA_Type),
            "::",
            stringify!(DCHPRI7)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).DCHPRI6) as usize - ptr as usize },
        261usize,
        concat!(
            "Offset of field: ",
            stringify!(DMA_Type),
            "::",
            stringify!(DCHPRI6)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).DCHPRI5) as usize - ptr as usize },
        262usize,
        concat!(
            "Offset of field: ",
            stringify!(DMA_Type),
            "::",
            stringify!(DCHPRI5)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).DCHPRI4) as usize - ptr as usize },
        263usize,
        concat!(
            "Offset of field: ",
            stringify!(DMA_Type),
            "::",
            stringify!(DCHPRI4)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).DCHPRI11) as usize - ptr as usize },
        264usize,
        concat!(
            "Offset of field: ",
            stringify!(DMA_Type),
            "::",
            stringify!(DCHPRI11)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).DCHPRI10) as usize - ptr as usize },
        265usize,
        concat!(
            "Offset of field: ",
            stringify!(DMA_Type),
            "::",
            stringify!(DCHPRI10)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).DCHPRI9) as usize - ptr as usize },
        266usize,
        concat!(
            "Offset of field: ",
            stringify!(DMA_Type),
            "::",
            stringify!(DCHPRI9)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).DCHPRI8) as usize - ptr as usize },
        267usize,
        concat!(
            "Offset of field: ",
            stringify!(DMA_Type),
            "::",
            stringify!(DCHPRI8)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).DCHPRI15) as usize - ptr as usize },
        268usize,
        concat!(
            "Offset of field: ",
            stringify!(DMA_Type),
            "::",
            stringify!(DCHPRI15)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).DCHPRI14) as usize - ptr as usize },
        269usize,
        concat!(
            "Offset of field: ",
            stringify!(DMA_Type),
            "::",
            stringify!(DCHPRI14)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).DCHPRI13) as usize - ptr as usize },
        270usize,
        concat!(
            "Offset of field: ",
            stringify!(DMA_Type),
            "::",
            stringify!(DCHPRI13)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).DCHPRI12) as usize - ptr as usize },
        271usize,
        concat!(
            "Offset of field: ",
            stringify!(DMA_Type),
            "::",
            stringify!(DCHPRI12)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).RESERVED_7) as usize - ptr as usize },
        272usize,
        concat!(
            "Offset of field: ",
            stringify!(DMA_Type),
            "::",
            stringify!(RESERVED_7)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).TCD) as usize - ptr as usize },
        4096usize,
        concat!(
            "Offset of field: ",
            stringify!(DMA_Type),
            "::",
            stringify!(TCD)
        )
    );
}
pub const DMA_CR_EDBG_MASK: u32 = 2;
pub const DMA_CR_EDBG_SHIFT: u32 = 1;
pub const DMA_CR_ERCA_MASK: u32 = 4;
pub const DMA_CR_ERCA_SHIFT: u32 = 2;
pub const DMA_CR_HOE_MASK: u32 = 16;
pub const DMA_CR_HOE_SHIFT: u32 = 4;
pub const DMA_CR_HALT_MASK: u32 = 32;
pub const DMA_CR_HALT_SHIFT: u32 = 5;
pub const DMA_CR_CLM_MASK: u32 = 64;
pub const DMA_CR_CLM_SHIFT: u32 = 6;
pub const DMA_CR_EMLM_MASK: u32 = 128;
pub const DMA_CR_EMLM_SHIFT: u32 = 7;
pub const DMA_CR_ECX_MASK: u32 = 65536;
pub const DMA_CR_ECX_SHIFT: u32 = 16;
pub const DMA_CR_CX_MASK: u32 = 131072;
pub const DMA_CR_CX_SHIFT: u32 = 17;
pub const DMA_ES_DBE_MASK: u32 = 1;
pub const DMA_ES_DBE_SHIFT: u32 = 0;
pub const DMA_ES_SBE_MASK: u32 = 2;
pub const DMA_ES_SBE_SHIFT: u32 = 1;
pub const DMA_ES_SGE_MASK: u32 = 4;
pub const DMA_ES_SGE_SHIFT: u32 = 2;
pub const DMA_ES_NCE_MASK: u32 = 8;
pub const DMA_ES_NCE_SHIFT: u32 = 3;
pub const DMA_ES_DOE_MASK: u32 = 16;
pub const DMA_ES_DOE_SHIFT: u32 = 4;
pub const DMA_ES_DAE_MASK: u32 = 32;
pub const DMA_ES_DAE_SHIFT: u32 = 5;
pub const DMA_ES_SOE_MASK: u32 = 64;
pub const DMA_ES_SOE_SHIFT: u32 = 6;
pub const DMA_ES_SAE_MASK: u32 = 128;
pub const DMA_ES_SAE_SHIFT: u32 = 7;
pub const DMA_ES_ERRCHN_MASK: u32 = 3840;
pub const DMA_ES_ERRCHN_SHIFT: u32 = 8;
pub const DMA_ES_CPE_MASK: u32 = 16384;
pub const DMA_ES_CPE_SHIFT: u32 = 14;
pub const DMA_ES_ECX_MASK: u32 = 65536;
pub const DMA_ES_ECX_SHIFT: u32 = 16;
pub const DMA_ES_VLD_MASK: u32 = 2147483648;
pub const DMA_ES_VLD_SHIFT: u32 = 31;
pub const DMA_ERQ_ERQ0_MASK: u32 = 1;
pub const DMA_ERQ_ERQ0_SHIFT: u32 = 0;
pub const DMA_ERQ_ERQ1_MASK: u32 = 2;
pub const DMA_ERQ_ERQ1_SHIFT: u32 = 1;
pub const DMA_ERQ_ERQ2_MASK: u32 = 4;
pub const DMA_ERQ_ERQ2_SHIFT: u32 = 2;
pub const DMA_ERQ_ERQ3_MASK: u32 = 8;
pub const DMA_ERQ_ERQ3_SHIFT: u32 = 3;
pub const DMA_ERQ_ERQ4_MASK: u32 = 16;
pub const DMA_ERQ_ERQ4_SHIFT: u32 = 4;
pub const DMA_ERQ_ERQ5_MASK: u32 = 32;
pub const DMA_ERQ_ERQ5_SHIFT: u32 = 5;
pub const DMA_ERQ_ERQ6_MASK: u32 = 64;
pub const DMA_ERQ_ERQ6_SHIFT: u32 = 6;
pub const DMA_ERQ_ERQ7_MASK: u32 = 128;
pub const DMA_ERQ_ERQ7_SHIFT: u32 = 7;
pub const DMA_ERQ_ERQ8_MASK: u32 = 256;
pub const DMA_ERQ_ERQ8_SHIFT: u32 = 8;
pub const DMA_ERQ_ERQ9_MASK: u32 = 512;
pub const DMA_ERQ_ERQ9_SHIFT: u32 = 9;
pub const DMA_ERQ_ERQ10_MASK: u32 = 1024;
pub const DMA_ERQ_ERQ10_SHIFT: u32 = 10;
pub const DMA_ERQ_ERQ11_MASK: u32 = 2048;
pub const DMA_ERQ_ERQ11_SHIFT: u32 = 11;
pub const DMA_ERQ_ERQ12_MASK: u32 = 4096;
pub const DMA_ERQ_ERQ12_SHIFT: u32 = 12;
pub const DMA_ERQ_ERQ13_MASK: u32 = 8192;
pub const DMA_ERQ_ERQ13_SHIFT: u32 = 13;
pub const DMA_ERQ_ERQ14_MASK: u32 = 16384;
pub const DMA_ERQ_ERQ14_SHIFT: u32 = 14;
pub const DMA_ERQ_ERQ15_MASK: u32 = 32768;
pub const DMA_ERQ_ERQ15_SHIFT: u32 = 15;
pub const DMA_EEI_EEI0_MASK: u32 = 1;
pub const DMA_EEI_EEI0_SHIFT: u32 = 0;
pub const DMA_EEI_EEI1_MASK: u32 = 2;
pub const DMA_EEI_EEI1_SHIFT: u32 = 1;
pub const DMA_EEI_EEI2_MASK: u32 = 4;
pub const DMA_EEI_EEI2_SHIFT: u32 = 2;
pub const DMA_EEI_EEI3_MASK: u32 = 8;
pub const DMA_EEI_EEI3_SHIFT: u32 = 3;
pub const DMA_EEI_EEI4_MASK: u32 = 16;
pub const DMA_EEI_EEI4_SHIFT: u32 = 4;
pub const DMA_EEI_EEI5_MASK: u32 = 32;
pub const DMA_EEI_EEI5_SHIFT: u32 = 5;
pub const DMA_EEI_EEI6_MASK: u32 = 64;
pub const DMA_EEI_EEI6_SHIFT: u32 = 6;
pub const DMA_EEI_EEI7_MASK: u32 = 128;
pub const DMA_EEI_EEI7_SHIFT: u32 = 7;
pub const DMA_EEI_EEI8_MASK: u32 = 256;
pub const DMA_EEI_EEI8_SHIFT: u32 = 8;
pub const DMA_EEI_EEI9_MASK: u32 = 512;
pub const DMA_EEI_EEI9_SHIFT: u32 = 9;
pub const DMA_EEI_EEI10_MASK: u32 = 1024;
pub const DMA_EEI_EEI10_SHIFT: u32 = 10;
pub const DMA_EEI_EEI11_MASK: u32 = 2048;
pub const DMA_EEI_EEI11_SHIFT: u32 = 11;
pub const DMA_EEI_EEI12_MASK: u32 = 4096;
pub const DMA_EEI_EEI12_SHIFT: u32 = 12;
pub const DMA_EEI_EEI13_MASK: u32 = 8192;
pub const DMA_EEI_EEI13_SHIFT: u32 = 13;
pub const DMA_EEI_EEI14_MASK: u32 = 16384;
pub const DMA_EEI_EEI14_SHIFT: u32 = 14;
pub const DMA_EEI_EEI15_MASK: u32 = 32768;
pub const DMA_EEI_EEI15_SHIFT: u32 = 15;
pub const DMA_CEEI_CEEI_MASK: u32 = 15;
pub const DMA_CEEI_CEEI_SHIFT: u32 = 0;
pub const DMA_CEEI_CAEE_MASK: u32 = 64;
pub const DMA_CEEI_CAEE_SHIFT: u32 = 6;
pub const DMA_CEEI_NOP_MASK: u32 = 128;
pub const DMA_CEEI_NOP_SHIFT: u32 = 7;
pub const DMA_SEEI_SEEI_MASK: u32 = 15;
pub const DMA_SEEI_SEEI_SHIFT: u32 = 0;
pub const DMA_SEEI_SAEE_MASK: u32 = 64;
pub const DMA_SEEI_SAEE_SHIFT: u32 = 6;
pub const DMA_SEEI_NOP_MASK: u32 = 128;
pub const DMA_SEEI_NOP_SHIFT: u32 = 7;
pub const DMA_CERQ_CERQ_MASK: u32 = 15;
pub const DMA_CERQ_CERQ_SHIFT: u32 = 0;
pub const DMA_CERQ_CAER_MASK: u32 = 64;
pub const DMA_CERQ_CAER_SHIFT: u32 = 6;
pub const DMA_CERQ_NOP_MASK: u32 = 128;
pub const DMA_CERQ_NOP_SHIFT: u32 = 7;
pub const DMA_SERQ_SERQ_MASK: u32 = 15;
pub const DMA_SERQ_SERQ_SHIFT: u32 = 0;
pub const DMA_SERQ_SAER_MASK: u32 = 64;
pub const DMA_SERQ_SAER_SHIFT: u32 = 6;
pub const DMA_SERQ_NOP_MASK: u32 = 128;
pub const DMA_SERQ_NOP_SHIFT: u32 = 7;
pub const DMA_CDNE_CDNE_MASK: u32 = 15;
pub const DMA_CDNE_CDNE_SHIFT: u32 = 0;
pub const DMA_CDNE_CADN_MASK: u32 = 64;
pub const DMA_CDNE_CADN_SHIFT: u32 = 6;
pub const DMA_CDNE_NOP_MASK: u32 = 128;
pub const DMA_CDNE_NOP_SHIFT: u32 = 7;
pub const DMA_SSRT_SSRT_MASK: u32 = 15;
pub const DMA_SSRT_SSRT_SHIFT: u32 = 0;
pub const DMA_SSRT_SAST_MASK: u32 = 64;
pub const DMA_SSRT_SAST_SHIFT: u32 = 6;
pub const DMA_SSRT_NOP_MASK: u32 = 128;
pub const DMA_SSRT_NOP_SHIFT: u32 = 7;
pub const DMA_CERR_CERR_MASK: u32 = 15;
pub const DMA_CERR_CERR_SHIFT: u32 = 0;
pub const DMA_CERR_CAEI_MASK: u32 = 64;
pub const DMA_CERR_CAEI_SHIFT: u32 = 6;
pub const DMA_CERR_NOP_MASK: u32 = 128;
pub const DMA_CERR_NOP_SHIFT: u32 = 7;
pub const DMA_CINT_CINT_MASK: u32 = 15;
pub const DMA_CINT_CINT_SHIFT: u32 = 0;
pub const DMA_CINT_CAIR_MASK: u32 = 64;
pub const DMA_CINT_CAIR_SHIFT: u32 = 6;
pub const DMA_CINT_NOP_MASK: u32 = 128;
pub const DMA_CINT_NOP_SHIFT: u32 = 7;
pub const DMA_INT_INT0_MASK: u32 = 1;
pub const DMA_INT_INT0_SHIFT: u32 = 0;
pub const DMA_INT_INT1_MASK: u32 = 2;
pub const DMA_INT_INT1_SHIFT: u32 = 1;
pub const DMA_INT_INT2_MASK: u32 = 4;
pub const DMA_INT_INT2_SHIFT: u32 = 2;
pub const DMA_INT_INT3_MASK: u32 = 8;
pub const DMA_INT_INT3_SHIFT: u32 = 3;
pub const DMA_INT_INT4_MASK: u32 = 16;
pub const DMA_INT_INT4_SHIFT: u32 = 4;
pub const DMA_INT_INT5_MASK: u32 = 32;
pub const DMA_INT_INT5_SHIFT: u32 = 5;
pub const DMA_INT_INT6_MASK: u32 = 64;
pub const DMA_INT_INT6_SHIFT: u32 = 6;
pub const DMA_INT_INT7_MASK: u32 = 128;
pub const DMA_INT_INT7_SHIFT: u32 = 7;
pub const DMA_INT_INT8_MASK: u32 = 256;
pub const DMA_INT_INT8_SHIFT: u32 = 8;
pub const DMA_INT_INT9_MASK: u32 = 512;
pub const DMA_INT_INT9_SHIFT: u32 = 9;
pub const DMA_INT_INT10_MASK: u32 = 1024;
pub const DMA_INT_INT10_SHIFT: u32 = 10;
pub const DMA_INT_INT11_MASK: u32 = 2048;
pub const DMA_INT_INT11_SHIFT: u32 = 11;
pub const DMA_INT_INT12_MASK: u32 = 4096;
pub const DMA_INT_INT12_SHIFT: u32 = 12;
pub const DMA_INT_INT13_MASK: u32 = 8192;
pub const DMA_INT_INT13_SHIFT: u32 = 13;
pub const DMA_INT_INT14_MASK: u32 = 16384;
pub const DMA_INT_INT14_SHIFT: u32 = 14;
pub const DMA_INT_INT15_MASK: u32 = 32768;
pub const DMA_INT_INT15_SHIFT: u32 = 15;
pub const DMA_ERR_ERR0_MASK: u32 = 1;
pub const DMA_ERR_ERR0_SHIFT: u32 = 0;
pub const DMA_ERR_ERR1_MASK: u32 = 2;
pub const DMA_ERR_ERR1_SHIFT: u32 = 1;
pub const DMA_ERR_ERR2_MASK: u32 = 4;
pub const DMA_ERR_ERR2_SHIFT: u32 = 2;
pub const DMA_ERR_ERR3_MASK: u32 = 8;
pub const DMA_ERR_ERR3_SHIFT: u32 = 3;
pub const DMA_ERR_ERR4_MASK: u32 = 16;
pub const DMA_ERR_ERR4_SHIFT: u32 = 4;
pub const DMA_ERR_ERR5_MASK: u32 = 32;
pub const DMA_ERR_ERR5_SHIFT: u32 = 5;
pub const DMA_ERR_ERR6_MASK: u32 = 64;
pub const DMA_ERR_ERR6_SHIFT: u32 = 6;
pub const DMA_ERR_ERR7_MASK: u32 = 128;
pub const DMA_ERR_ERR7_SHIFT: u32 = 7;
pub const DMA_ERR_ERR8_MASK: u32 = 256;
pub const DMA_ERR_ERR8_SHIFT: u32 = 8;
pub const DMA_ERR_ERR9_MASK: u32 = 512;
pub const DMA_ERR_ERR9_SHIFT: u32 = 9;
pub const DMA_ERR_ERR10_MASK: u32 = 1024;
pub const DMA_ERR_ERR10_SHIFT: u32 = 10;
pub const DMA_ERR_ERR11_MASK: u32 = 2048;
pub const DMA_ERR_ERR11_SHIFT: u32 = 11;
pub const DMA_ERR_ERR12_MASK: u32 = 4096;
pub const DMA_ERR_ERR12_SHIFT: u32 = 12;
pub const DMA_ERR_ERR13_MASK: u32 = 8192;
pub const DMA_ERR_ERR13_SHIFT: u32 = 13;
pub const DMA_ERR_ERR14_MASK: u32 = 16384;
pub const DMA_ERR_ERR14_SHIFT: u32 = 14;
pub const DMA_ERR_ERR15_MASK: u32 = 32768;
pub const DMA_ERR_ERR15_SHIFT: u32 = 15;
pub const DMA_HRS_HRS0_MASK: u32 = 1;
pub const DMA_HRS_HRS0_SHIFT: u32 = 0;
pub const DMA_HRS_HRS1_MASK: u32 = 2;
pub const DMA_HRS_HRS1_SHIFT: u32 = 1;
pub const DMA_HRS_HRS2_MASK: u32 = 4;
pub const DMA_HRS_HRS2_SHIFT: u32 = 2;
pub const DMA_HRS_HRS3_MASK: u32 = 8;
pub const DMA_HRS_HRS3_SHIFT: u32 = 3;
pub const DMA_HRS_HRS4_MASK: u32 = 16;
pub const DMA_HRS_HRS4_SHIFT: u32 = 4;
pub const DMA_HRS_HRS5_MASK: u32 = 32;
pub const DMA_HRS_HRS5_SHIFT: u32 = 5;
pub const DMA_HRS_HRS6_MASK: u32 = 64;
pub const DMA_HRS_HRS6_SHIFT: u32 = 6;
pub const DMA_HRS_HRS7_MASK: u32 = 128;
pub const DMA_HRS_HRS7_SHIFT: u32 = 7;
pub const DMA_HRS_HRS8_MASK: u32 = 256;
pub const DMA_HRS_HRS8_SHIFT: u32 = 8;
pub const DMA_HRS_HRS9_MASK: u32 = 512;
pub const DMA_HRS_HRS9_SHIFT: u32 = 9;
pub const DMA_HRS_HRS10_MASK: u32 = 1024;
pub const DMA_HRS_HRS10_SHIFT: u32 = 10;
pub const DMA_HRS_HRS11_MASK: u32 = 2048;
pub const DMA_HRS_HRS11_SHIFT: u32 = 11;
pub const DMA_HRS_HRS12_MASK: u32 = 4096;
pub const DMA_HRS_HRS12_SHIFT: u32 = 12;
pub const DMA_HRS_HRS13_MASK: u32 = 8192;
pub const DMA_HRS_HRS13_SHIFT: u32 = 13;
pub const DMA_HRS_HRS14_MASK: u32 = 16384;
pub const DMA_HRS_HRS14_SHIFT: u32 = 14;
pub const DMA_HRS_HRS15_MASK: u32 = 32768;
pub const DMA_HRS_HRS15_SHIFT: u32 = 15;
pub const DMA_EARS_EDREQ_0_MASK: u32 = 1;
pub const DMA_EARS_EDREQ_0_SHIFT: u32 = 0;
pub const DMA_EARS_EDREQ_1_MASK: u32 = 2;
pub const DMA_EARS_EDREQ_1_SHIFT: u32 = 1;
pub const DMA_EARS_EDREQ_2_MASK: u32 = 4;
pub const DMA_EARS_EDREQ_2_SHIFT: u32 = 2;
pub const DMA_EARS_EDREQ_3_MASK: u32 = 8;
pub const DMA_EARS_EDREQ_3_SHIFT: u32 = 3;
pub const DMA_DCHPRI3_CHPRI_MASK: u32 = 15;
pub const DMA_DCHPRI3_CHPRI_SHIFT: u32 = 0;
pub const DMA_DCHPRI3_DPA_MASK: u32 = 64;
pub const DMA_DCHPRI3_DPA_SHIFT: u32 = 6;
pub const DMA_DCHPRI3_ECP_MASK: u32 = 128;
pub const DMA_DCHPRI3_ECP_SHIFT: u32 = 7;
pub const DMA_DCHPRI2_CHPRI_MASK: u32 = 15;
pub const DMA_DCHPRI2_CHPRI_SHIFT: u32 = 0;
pub const DMA_DCHPRI2_DPA_MASK: u32 = 64;
pub const DMA_DCHPRI2_DPA_SHIFT: u32 = 6;
pub const DMA_DCHPRI2_ECP_MASK: u32 = 128;
pub const DMA_DCHPRI2_ECP_SHIFT: u32 = 7;
pub const DMA_DCHPRI1_CHPRI_MASK: u32 = 15;
pub const DMA_DCHPRI1_CHPRI_SHIFT: u32 = 0;
pub const DMA_DCHPRI1_DPA_MASK: u32 = 64;
pub const DMA_DCHPRI1_DPA_SHIFT: u32 = 6;
pub const DMA_DCHPRI1_ECP_MASK: u32 = 128;
pub const DMA_DCHPRI1_ECP_SHIFT: u32 = 7;
pub const DMA_DCHPRI0_CHPRI_MASK: u32 = 15;
pub const DMA_DCHPRI0_CHPRI_SHIFT: u32 = 0;
pub const DMA_DCHPRI0_DPA_MASK: u32 = 64;
pub const DMA_DCHPRI0_DPA_SHIFT: u32 = 6;
pub const DMA_DCHPRI0_ECP_MASK: u32 = 128;
pub const DMA_DCHPRI0_ECP_SHIFT: u32 = 7;
pub const DMA_DCHPRI7_CHPRI_MASK: u32 = 15;
pub const DMA_DCHPRI7_CHPRI_SHIFT: u32 = 0;
pub const DMA_DCHPRI7_DPA_MASK: u32 = 64;
pub const DMA_DCHPRI7_DPA_SHIFT: u32 = 6;
pub const DMA_DCHPRI7_ECP_MASK: u32 = 128;
pub const DMA_DCHPRI7_ECP_SHIFT: u32 = 7;
pub const DMA_DCHPRI6_CHPRI_MASK: u32 = 15;
pub const DMA_DCHPRI6_CHPRI_SHIFT: u32 = 0;
pub const DMA_DCHPRI6_DPA_MASK: u32 = 64;
pub const DMA_DCHPRI6_DPA_SHIFT: u32 = 6;
pub const DMA_DCHPRI6_ECP_MASK: u32 = 128;
pub const DMA_DCHPRI6_ECP_SHIFT: u32 = 7;
pub const DMA_DCHPRI5_CHPRI_MASK: u32 = 15;
pub const DMA_DCHPRI5_CHPRI_SHIFT: u32 = 0;
pub const DMA_DCHPRI5_DPA_MASK: u32 = 64;
pub const DMA_DCHPRI5_DPA_SHIFT: u32 = 6;
pub const DMA_DCHPRI5_ECP_MASK: u32 = 128;
pub const DMA_DCHPRI5_ECP_SHIFT: u32 = 7;
pub const DMA_DCHPRI4_CHPRI_MASK: u32 = 15;
pub const DMA_DCHPRI4_CHPRI_SHIFT: u32 = 0;
pub const DMA_DCHPRI4_DPA_MASK: u32 = 64;
pub const DMA_DCHPRI4_DPA_SHIFT: u32 = 6;
pub const DMA_DCHPRI4_ECP_MASK: u32 = 128;
pub const DMA_DCHPRI4_ECP_SHIFT: u32 = 7;
pub const DMA_DCHPRI11_CHPRI_MASK: u32 = 15;
pub const DMA_DCHPRI11_CHPRI_SHIFT: u32 = 0;
pub const DMA_DCHPRI11_DPA_MASK: u32 = 64;
pub const DMA_DCHPRI11_DPA_SHIFT: u32 = 6;
pub const DMA_DCHPRI11_ECP_MASK: u32 = 128;
pub const DMA_DCHPRI11_ECP_SHIFT: u32 = 7;
pub const DMA_DCHPRI10_CHPRI_MASK: u32 = 15;
pub const DMA_DCHPRI10_CHPRI_SHIFT: u32 = 0;
pub const DMA_DCHPRI10_DPA_MASK: u32 = 64;
pub const DMA_DCHPRI10_DPA_SHIFT: u32 = 6;
pub const DMA_DCHPRI10_ECP_MASK: u32 = 128;
pub const DMA_DCHPRI10_ECP_SHIFT: u32 = 7;
pub const DMA_DCHPRI9_CHPRI_MASK: u32 = 15;
pub const DMA_DCHPRI9_CHPRI_SHIFT: u32 = 0;
pub const DMA_DCHPRI9_DPA_MASK: u32 = 64;
pub const DMA_DCHPRI9_DPA_SHIFT: u32 = 6;
pub const DMA_DCHPRI9_ECP_MASK: u32 = 128;
pub const DMA_DCHPRI9_ECP_SHIFT: u32 = 7;
pub const DMA_DCHPRI8_CHPRI_MASK: u32 = 15;
pub const DMA_DCHPRI8_CHPRI_SHIFT: u32 = 0;
pub const DMA_DCHPRI8_DPA_MASK: u32 = 64;
pub const DMA_DCHPRI8_DPA_SHIFT: u32 = 6;
pub const DMA_DCHPRI8_ECP_MASK: u32 = 128;
pub const DMA_DCHPRI8_ECP_SHIFT: u32 = 7;
pub const DMA_DCHPRI15_CHPRI_MASK: u32 = 15;
pub const DMA_DCHPRI15_CHPRI_SHIFT: u32 = 0;
pub const DMA_DCHPRI15_DPA_MASK: u32 = 64;
pub const DMA_DCHPRI15_DPA_SHIFT: u32 = 6;
pub const DMA_DCHPRI15_ECP_MASK: u32 = 128;
pub const DMA_DCHPRI15_ECP_SHIFT: u32 = 7;
pub const DMA_DCHPRI14_CHPRI_MASK: u32 = 15;
pub const DMA_DCHPRI14_CHPRI_SHIFT: u32 = 0;
pub const DMA_DCHPRI14_DPA_MASK: u32 = 64;
pub const DMA_DCHPRI14_DPA_SHIFT: u32 = 6;
pub const DMA_DCHPRI14_ECP_MASK: u32 = 128;
pub const DMA_DCHPRI14_ECP_SHIFT: u32 = 7;
pub const DMA_DCHPRI13_CHPRI_MASK: u32 = 15;
pub const DMA_DCHPRI13_CHPRI_SHIFT: u32 = 0;
pub const DMA_DCHPRI13_DPA_MASK: u32 = 64;
pub const DMA_DCHPRI13_DPA_SHIFT: u32 = 6;
pub const DMA_DCHPRI13_ECP_MASK: u32 = 128;
pub const DMA_DCHPRI13_ECP_SHIFT: u32 = 7;
pub const DMA_DCHPRI12_CHPRI_MASK: u32 = 15;
pub const DMA_DCHPRI12_CHPRI_SHIFT: u32 = 0;
pub const DMA_DCHPRI12_DPA_MASK: u32 = 64;
pub const DMA_DCHPRI12_DPA_SHIFT: u32 = 6;
pub const DMA_DCHPRI12_ECP_MASK: u32 = 128;
pub const DMA_DCHPRI12_ECP_SHIFT: u32 = 7;
pub const DMA_SADDR_SADDR_MASK: u32 = 4294967295;
pub const DMA_SADDR_SADDR_SHIFT: u32 = 0;
pub const DMA_SADDR_COUNT: u32 = 16;
pub const DMA_SOFF_SOFF_MASK: u32 = 65535;
pub const DMA_SOFF_SOFF_SHIFT: u32 = 0;
pub const DMA_SOFF_COUNT: u32 = 16;
pub const DMA_ATTR_DSIZE_MASK: u32 = 7;
pub const DMA_ATTR_DSIZE_SHIFT: u32 = 0;
pub const DMA_ATTR_DMOD_MASK: u32 = 248;
pub const DMA_ATTR_DMOD_SHIFT: u32 = 3;
pub const DMA_ATTR_SSIZE_MASK: u32 = 1792;
pub const DMA_ATTR_SSIZE_SHIFT: u32 = 8;
pub const DMA_ATTR_SMOD_MASK: u32 = 63488;
pub const DMA_ATTR_SMOD_SHIFT: u32 = 11;
pub const DMA_ATTR_COUNT: u32 = 16;
pub const DMA_NBYTES_MLNO_NBYTES_MASK: u32 = 4294967295;
pub const DMA_NBYTES_MLNO_NBYTES_SHIFT: u32 = 0;
pub const DMA_NBYTES_MLNO_COUNT: u32 = 16;
pub const DMA_NBYTES_MLOFFNO_NBYTES_MASK: u32 = 1073741823;
pub const DMA_NBYTES_MLOFFNO_NBYTES_SHIFT: u32 = 0;
pub const DMA_NBYTES_MLOFFNO_DMLOE_MASK: u32 = 1073741824;
pub const DMA_NBYTES_MLOFFNO_DMLOE_SHIFT: u32 = 30;
pub const DMA_NBYTES_MLOFFNO_SMLOE_MASK: u32 = 2147483648;
pub const DMA_NBYTES_MLOFFNO_SMLOE_SHIFT: u32 = 31;
pub const DMA_NBYTES_MLOFFNO_COUNT: u32 = 16;
pub const DMA_NBYTES_MLOFFYES_NBYTES_MASK: u32 = 1023;
pub const DMA_NBYTES_MLOFFYES_NBYTES_SHIFT: u32 = 0;
pub const DMA_NBYTES_MLOFFYES_MLOFF_MASK: u32 = 1073740800;
pub const DMA_NBYTES_MLOFFYES_MLOFF_SHIFT: u32 = 10;
pub const DMA_NBYTES_MLOFFYES_DMLOE_MASK: u32 = 1073741824;
pub const DMA_NBYTES_MLOFFYES_DMLOE_SHIFT: u32 = 30;
pub const DMA_NBYTES_MLOFFYES_SMLOE_MASK: u32 = 2147483648;
pub const DMA_NBYTES_MLOFFYES_SMLOE_SHIFT: u32 = 31;
pub const DMA_NBYTES_MLOFFYES_COUNT: u32 = 16;
pub const DMA_SLAST_SLAST_MASK: u32 = 4294967295;
pub const DMA_SLAST_SLAST_SHIFT: u32 = 0;
pub const DMA_SLAST_COUNT: u32 = 16;
pub const DMA_DADDR_DADDR_MASK: u32 = 4294967295;
pub const DMA_DADDR_DADDR_SHIFT: u32 = 0;
pub const DMA_DADDR_COUNT: u32 = 16;
pub const DMA_DOFF_DOFF_MASK: u32 = 65535;
pub const DMA_DOFF_DOFF_SHIFT: u32 = 0;
pub const DMA_DOFF_COUNT: u32 = 16;
pub const DMA_CITER_ELINKNO_CITER_MASK: u32 = 32767;
pub const DMA_CITER_ELINKNO_CITER_SHIFT: u32 = 0;
pub const DMA_CITER_ELINKNO_ELINK_MASK: u32 = 32768;
pub const DMA_CITER_ELINKNO_ELINK_SHIFT: u32 = 15;
pub const DMA_CITER_ELINKNO_COUNT: u32 = 16;
pub const DMA_CITER_ELINKYES_CITER_MASK: u32 = 511;
pub const DMA_CITER_ELINKYES_CITER_SHIFT: u32 = 0;
pub const DMA_CITER_ELINKYES_LINKCH_MASK: u32 = 7680;
pub const DMA_CITER_ELINKYES_LINKCH_SHIFT: u32 = 9;
pub const DMA_CITER_ELINKYES_ELINK_MASK: u32 = 32768;
pub const DMA_CITER_ELINKYES_ELINK_SHIFT: u32 = 15;
pub const DMA_CITER_ELINKYES_COUNT: u32 = 16;
pub const DMA_DLAST_SGA_DLASTSGA_MASK: u32 = 4294967295;
pub const DMA_DLAST_SGA_DLASTSGA_SHIFT: u32 = 0;
pub const DMA_DLAST_SGA_COUNT: u32 = 16;
pub const DMA_CSR_START_MASK: u32 = 1;
pub const DMA_CSR_START_SHIFT: u32 = 0;
pub const DMA_CSR_INTMAJOR_MASK: u32 = 2;
pub const DMA_CSR_INTMAJOR_SHIFT: u32 = 1;
pub const DMA_CSR_INTHALF_MASK: u32 = 4;
pub const DMA_CSR_INTHALF_SHIFT: u32 = 2;
pub const DMA_CSR_DREQ_MASK: u32 = 8;
pub const DMA_CSR_DREQ_SHIFT: u32 = 3;
pub const DMA_CSR_ESG_MASK: u32 = 16;
pub const DMA_CSR_ESG_SHIFT: u32 = 4;
pub const DMA_CSR_MAJORELINK_MASK: u32 = 32;
pub const DMA_CSR_MAJORELINK_SHIFT: u32 = 5;
pub const DMA_CSR_ACTIVE_MASK: u32 = 64;
pub const DMA_CSR_ACTIVE_SHIFT: u32 = 6;
pub const DMA_CSR_DONE_MASK: u32 = 128;
pub const DMA_CSR_DONE_SHIFT: u32 = 7;
pub const DMA_CSR_MAJORLINKCH_MASK: u32 = 3840;
pub const DMA_CSR_MAJORLINKCH_SHIFT: u32 = 8;
pub const DMA_CSR_BWC_MASK: u32 = 49152;
pub const DMA_CSR_BWC_SHIFT: u32 = 14;
pub const DMA_CSR_COUNT: u32 = 16;
pub const DMA_BITER_ELINKNO_BITER_MASK: u32 = 32767;
pub const DMA_BITER_ELINKNO_BITER_SHIFT: u32 = 0;
pub const DMA_BITER_ELINKNO_ELINK_MASK: u32 = 32768;
pub const DMA_BITER_ELINKNO_ELINK_SHIFT: u32 = 15;
pub const DMA_BITER_ELINKNO_COUNT: u32 = 16;
pub const DMA_BITER_ELINKYES_BITER_MASK: u32 = 511;
pub const DMA_BITER_ELINKYES_BITER_SHIFT: u32 = 0;
pub const DMA_BITER_ELINKYES_LINKCH_MASK: u32 = 7680;
pub const DMA_BITER_ELINKYES_LINKCH_SHIFT: u32 = 9;
pub const DMA_BITER_ELINKYES_ELINK_MASK: u32 = 32768;
pub const DMA_BITER_ELINKYES_ELINK_SHIFT: u32 = 15;
pub const DMA_BITER_ELINKYES_COUNT: u32 = 16;
pub const DMA_BASE: u32 = 1073774592;
#[doc = " DMAMUX - Register Layout Typedef"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct DMAMUX_Type {
    #[doc = "< Channel Configuration register, array offset: 0x0, array step: 0x1"]
    pub CHCFG: [u8; 16usize],
}
#[test]
fn bindgen_test_layout_DMAMUX_Type() {
    const UNINIT: ::std::mem::MaybeUninit<DMAMUX_Type> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<DMAMUX_Type>(),
        16usize,
        concat!("Size of: ", stringify!(DMAMUX_Type))
    );
    assert_eq!(
        ::std::mem::align_of::<DMAMUX_Type>(),
        1usize,
        concat!("Alignment of ", stringify!(DMAMUX_Type))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).CHCFG) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(DMAMUX_Type),
            "::",
            stringify!(CHCFG)
        )
    );
}
pub const DMAMUX_CHCFG_SOURCE_MASK: u32 = 63;
pub const DMAMUX_CHCFG_SOURCE_SHIFT: u32 = 0;
pub const DMAMUX_CHCFG_TRIG_MASK: u32 = 64;
pub const DMAMUX_CHCFG_TRIG_SHIFT: u32 = 6;
pub const DMAMUX_CHCFG_ENBL_MASK: u32 = 128;
pub const DMAMUX_CHCFG_ENBL_SHIFT: u32 = 7;
pub const DMAMUX_CHCFG_COUNT: u32 = 16;
pub const DMAMUX_BASE: u32 = 1073876992;
#[doc = " EWM - Register Layout Typedef"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct EWM_Type {
    #[doc = "< Control Register, offset: 0x0"]
    pub CTRL: u8,
    #[doc = "< Service Register, offset: 0x1"]
    pub SERV: u8,
    #[doc = "< Compare Low Register, offset: 0x2"]
    pub CMPL: u8,
    #[doc = "< Compare High Register, offset: 0x3"]
    pub CMPH: u8,
}
#[test]
fn bindgen_test_layout_EWM_Type() {
    const UNINIT: ::std::mem::MaybeUninit<EWM_Type> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<EWM_Type>(),
        4usize,
        concat!("Size of: ", stringify!(EWM_Type))
    );
    assert_eq!(
        ::std::mem::align_of::<EWM_Type>(),
        1usize,
        concat!("Alignment of ", stringify!(EWM_Type))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).CTRL) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(EWM_Type),
            "::",
            stringify!(CTRL)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).SERV) as usize - ptr as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(EWM_Type),
            "::",
            stringify!(SERV)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).CMPL) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(EWM_Type),
            "::",
            stringify!(CMPL)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).CMPH) as usize - ptr as usize },
        3usize,
        concat!(
            "Offset of field: ",
            stringify!(EWM_Type),
            "::",
            stringify!(CMPH)
        )
    );
}
pub const EWM_CTRL_EWMEN_MASK: u32 = 1;
pub const EWM_CTRL_EWMEN_SHIFT: u32 = 0;
pub const EWM_CTRL_ASSIN_MASK: u32 = 2;
pub const EWM_CTRL_ASSIN_SHIFT: u32 = 1;
pub const EWM_CTRL_INEN_MASK: u32 = 4;
pub const EWM_CTRL_INEN_SHIFT: u32 = 2;
pub const EWM_CTRL_INTEN_MASK: u32 = 8;
pub const EWM_CTRL_INTEN_SHIFT: u32 = 3;
pub const EWM_SERV_SERVICE_MASK: u32 = 255;
pub const EWM_SERV_SERVICE_SHIFT: u32 = 0;
pub const EWM_CMPL_COMPAREL_MASK: u32 = 255;
pub const EWM_CMPL_COMPAREL_SHIFT: u32 = 0;
pub const EWM_CMPH_COMPAREH_MASK: u32 = 255;
pub const EWM_CMPH_COMPAREH_SHIFT: u32 = 0;
pub const EWM_BASE: u32 = 1074139136;
#[doc = " FB - Register Layout Typedef"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct FB_Type {
    pub CS: [FB_Type__bindgen_ty_1; 6usize],
    pub RESERVED_0: [u8; 24usize],
    #[doc = "< Chip Select port Multiplexing Control Register, offset: 0x60"]
    pub CSPMCR: u32,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct FB_Type__bindgen_ty_1 {
    #[doc = "< Chip Select Address Register, array offset: 0x0, array step: 0xC"]
    pub CSAR: u32,
    #[doc = "< Chip Select Mask Register, array offset: 0x4, array step: 0xC"]
    pub CSMR: u32,
    #[doc = "< Chip Select Control Register, array offset: 0x8, array step: 0xC"]
    pub CSCR: u32,
}
#[test]
fn bindgen_test_layout_FB_Type__bindgen_ty_1() {
    const UNINIT: ::std::mem::MaybeUninit<FB_Type__bindgen_ty_1> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<FB_Type__bindgen_ty_1>(),
        12usize,
        concat!("Size of: ", stringify!(FB_Type__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<FB_Type__bindgen_ty_1>(),
        4usize,
        concat!("Alignment of ", stringify!(FB_Type__bindgen_ty_1))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).CSAR) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(FB_Type__bindgen_ty_1),
            "::",
            stringify!(CSAR)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).CSMR) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(FB_Type__bindgen_ty_1),
            "::",
            stringify!(CSMR)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).CSCR) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(FB_Type__bindgen_ty_1),
            "::",
            stringify!(CSCR)
        )
    );
}
#[test]
fn bindgen_test_layout_FB_Type() {
    const UNINIT: ::std::mem::MaybeUninit<FB_Type> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<FB_Type>(),
        100usize,
        concat!("Size of: ", stringify!(FB_Type))
    );
    assert_eq!(
        ::std::mem::align_of::<FB_Type>(),
        4usize,
        concat!("Alignment of ", stringify!(FB_Type))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).CS) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(FB_Type),
            "::",
            stringify!(CS)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).RESERVED_0) as usize - ptr as usize },
        72usize,
        concat!(
